{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24138009/grade-the-trade-suns-get-emeka-okafor-wizards-get-marcin-gortat",
  "title": "Grade the Trade: Suns get Emeka Okafor, Wizards get Marcin Gortat",
  "data": "  Are the Wizards truly upgrading their center position with Okafor for Gortat? (USATSI)The Washington Wizards and the Phoenix Suns have reportedly agreed to swapping their respective centers, along with some other moving parts in the deal. This is a pretty big move for a Wizards team looking to finally break back into the playoffs, where the Suns are busy acquiring assets to help continue their rebuilding project.How did the two teams come out in the deal? Let\u0027s grade the trade:Washington WizardsReceive: Marcin Gortat, Shannon Brown, Kendall Marshall, and Malcolm LeeEmeka Okafor was a huge part of the Wizards\u0027 success in 2012-13. That may sound funny considering this team was a disaster before John Wall returned to action and gave the franchise a shot of adrenaline/competency on the offensive end of the floor, but the Wizards possessed one of the best defenses in the league despite struggling in the first 33 games. It meant that when Wall returned to the offense, they had a baseline of production and execution they could always rely on -- the defense.Okafor was the anchor of that defense and means a lot to them when he\u0027s healthy. However, Okafor is once again suffering through injury concerns and the Wizards simply aren\u0027t deep enough inside to have to worry about his health. With a disc problem in his neck, their defensive anchor wasn\u0027t reliable and they needed to find someone that could come in and be enough of a presence inside over the course of the full season. With that, they\u0027ve traded for Marcin Gortat, which is a big move for them.Gortat gives them a healthy, mobile center who can run a pick-and-roll with John Wall while giving them defensive rotations and rebounding on the other end of the floor. He\u0027s by no means as effective as Okafor on defense, but he\u0027s good enough to consider this a stabilizing move for the Wizards.If they decide to keep the other parts, grabbing some backcourt depth with Shannon Brown is also a nice addition to this Wizards roster. There isn\u0027t as much pressure for someone like Glen Rice, Jr to perform and Washington adds someone that can help them push the pace. Kendall Marshall could end up being someone they develop over time, but there isn\u0027t any pressure to make him be included in the rotation now since they have Eric Maynor as the backup. Malcolm Lee will likely be a roster cut casualty in the trade.Two years ago, the Wizards went away from stockpiling young assets and decided to bring in veterans to help Wall win now. This move solidifies that a bit more now and gives them a center that hasn\u0027t really had much of an injury history.Grade: A-PHOENIX SUNSReceieve: Emeka Okafor, protected first round pick in 2014The Suns\u0027 plan is pretty simple, right? Maintain flexibility and acquire assets to make a splash in the 2014 draft. If the Wizards were a healthy center away from possibly making the playoffs in the East, then you\u0027ve almost guaranteed yourself a middle first round pick by grabbing their selection and helping them get into the playoffs in the meantime. The pick is reportedly top-12 protected. If the Wizards make the playoffs, that\u0027s likely going to put it in the 15 or 16 range.In this upcoming draft, that\u0027s an incredibly valuable asset for the Suns to use either with a selection or through a trade. They now have four first round picks in the 2014 draft and should be primed to be big movers and shakers in one way or another on draft night. They haven\u0027t added any long-term salary in the process outside of the possible rookie contract and no longer have to wonder if Marshall will develop for them as they groom Eric Bledsoe for the starting point guard duties. If Okafor gets healthy, they have an expiring contract of a good defensive center they can move before or at the deadline to acquire more assets. This move seems like a win-win for both sides.Grade: A",
  "category": "NBA"
}