{
  "url": "http://www.cbsnews.com/8301-204_162-57609110/child-still-hiv-free-despite-stopping-medication-18-months-earlier-study-says/",
  "title": "Child still HIV-free despite stopping medication 18 months earlier, study says",
  "data": " A baby who was reportedly \"cured\" of HIV in March sent ripples through the health care community, fueling hopes for a new way to prevent infection of the disease in newborns. \n\n\n\n\n\nPlay Video\nDoctors says they\u0027ve cured baby of HIV\n\nThe baby, who had been born 2.5 years earlier in Mississippi, was given an aggressive treatment regimen within hours of birth that appeared to knock out the virus from the blood before HIV cell reservoirs could form in the body. Once the child stopped taking medication 18 months later, the virus remained at bay. Seven months after the initial report, researchers wrote in the New England Journal of Medicine that the child remains HIV-free despite not taking medication. \"The child remains in care, and at the age of 36 months, at least 18 months after the cessation of antiretroviral therapy, the child has no detectable level of HIV,\" wrote the researchers. The researchers explained that the mother was admitted to the University of Mississippi hospital about three years ago when she was in labor. At that time, the doctors determined she had HIV. The mother had not received prenatal care to reduce risk of the disease passing to the child, so doctors had to act fast. Typically, doctors give newborns low-dose HIV medications to prevent the infection, but the hospital only had higher-dose therapies on hand.  At only 30-hours-old, the baby was given a standard three-drug regimen of the medications zidovudine, lamivudine and nevirapine. Tests taken after the fact revealed the child was HIV-positive.  Treatment continued, and the level of medications was adjusted. Doctors grew concerned when the child turned 18 months that the baby was not always getting the proper medication, due to irregular blood test results. Then, the family missed several scheduled appointments until 23 months when they showed up to tell the doctor the child stopped taking medications at 18 months, with pharmacy records indicating treatment may have ceased as early as 15 months of age. Typically, HIV forms reservoirs of inactive cells that can re-infect a person who stops taking medication. But, blood and DNA tests completed on the child showed no traces of HIV. The test results \"suggest that replication-competent HIV-1 reservoirs may not have been established or were markedly abated, if not extinguished,\" wrote the authors, led by Dr. Deborah Persaud, a pediatric infectious disease specialist at Johns Hopkins Medicine in Baltimore. Persaud first presented her preliminary findings on March 3 at the Conference on Retroviruses and Opportunistic Infections (CROI) in Atlanta.  \"We\u0027re going to have to start looking at the relative risk versus the benefit of doing it this way,\" Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, told CBS This Morning when the research was first presented in March. The authors of the new paper still stopped short of calling the findings a cure. \"We want to be very cautious here. We\u0027re calling it remission because we\u0027d like to observe the child for a longer time and be absolutely sure there\u0027s no rebound,\" Dr. Katherine Luzuriaga, a University of Massachusetts AIDS expert involved in the baby\u0027s care, told the Associated Press.  In an accompanying editorial published in the same journal issue, Dr. Scott Hammer, an HIV treatment researcher at Columbia University Medical Center in New York City, wrote that the case raises many questions. Was the infant ever infected or was the positive result due to the blood exchange when the baby was passed through the mom during birth. However, he believes the doctors\u0027 theory that the baby was truly infected. \"The big question, of course, is, \u0027Is the child cured of HIV infection?\u0027 The best answer at this moment is a definitive \u0027maybe,\u0027\" wrote Hammer. \"To paraphrase the Chinese philosopher, Lao-tzu, \u0027A journey of a thousand miles begins with a single step,\u0027 he added. \"In the case of HIV infection, this may turn out to be a baby step.\" Prior to the study, the only documented \"cure\" of HIV was in Timothy Ray Brown, who is known as the \"Berlin patient.\" Brown, 46, underwent a radically different procedure. The American had been diagnosed with HIV in 1995. While living in Germany in 2006, he was diagnosed with leukemia. Doctors gave him a blood stem cell transplant using a donor who had a rare genetic mutations linked to HIV resistance. Brown stopped taking the medication for the transplant, and said he hasn\u0027t used them since. Some reports suggest he may still have dead remnants of the virus in his body that can\u0027t replicate.  ",
  "category": "HEALTH"
}