{
  "url": "http://www.cbsnews.com/8301-204_162-57609300/churchgoers-possibly-exposed-to-hepatitis-a-through-communion/",
  "title": "Churchgoers possibly exposed to hepatitis A through communion",
  "data": " People who attended mass at four North Dakota Catholic churches in the past month may have been exposed to the hepatitis A virus through receiving communion, according to state health officials. Communion is a ritual in which parishioners eat bread and wine tranformed into the body and blood of Jesus Christ. Fargo diocese spokesperson Aliceyn Magelky told CBSNews.com Friday that Bishop John Folda was in Italy for a period in Sept. with several newly-ordained bishops when he unknowingly contracted hepatitis A through contaminated food. Around Oct. 10, he started developing symptoms and stayed home, and a blood test revealed shortly after he had the infection. Folda attended mass on the following days at the following churches and participated in communion: September 27, 2013: Holy Spirit Church in Fargo, N.D. (school mass)September 29 - October 2, 2013: St. James Basilica in Jamestown, N.D. (priest convention)October 6, 2013: Cathedral of St. Mary in Fargo, N.D. (noon mass only)October 7, 2013: St. Paul\u0027s Catholic Newman Center in Fargo, N.D. The North Dakota Department of Health is urging those who received communion at those churches on those dates to get tested for the liver-damaging virus if they are developing symptoms. The N.D. health department felt the issue was a serious enough to investigate and release a statement, said Magelky. \"And he is doing just fine (now),\" she said of Folda. \"He has recovered very well.\" Hepatitis A is a viral infection that causes inflammation of the liver. It is usually spread when a person ingests fecal matter from an infected person, even in microscopic amounts, from contact with contaminated objects, food, or drinks. People exposed to hepatitis A may develop symptoms within 15 to 50 days - average of about 30 days - that include fever, fatigue, loss of appetite, nausea, abdominal discomfort, dark urine, pale stools, or yellowing of the skin or eyes (jaundice). The symptoms typically last two months before resolving but in rare cases the infection can cause liver failure and death. \"There are no suspected or confirmed cases linked to the hepatitis A exposures at the North Dakota churches,\" state immunization program manager Molly Howell told CBSNews.com in an email. Risk of developing hepatitis A is low in this situation, Howell added in a statement, noting people who were exposed but do not have symptoms are not recommended to get tested.\n\n\n\n\n\n\nPlay Video\nHepatitis scare at upscale NYC restaurant \n\n People are most contagious during the two weeks before symptoms begin, but typically stop being contagious a week after they start. The disease can be prevented by careful hand-washing after using the bathroom or changing diapers.  Those who have been vaccinated already for hepatitis A are considered immune. The Centers for Disease Control and Prevention have more information on hepatitis A.  ",
  "category": "HEALTH"
}