{
  "url": "http://www.cbsnews.com/8301-204_162-57609133/color-contact-lenses-for-halloween-may-carry-blindness-risk/",
  "title": "Color contact lenses for Halloween may carry blindness risk",
  "data": " Color contact lenses may seem like the perfect addition to your Halloween costume, but wearing them may come at great risk to your eye health.  Color contact lenses, also known as decorative contact lenses or fashion contact lenses, cover the eye and can change a person\u0027s eye color or give the eye a spooky, animal-like appearance. But, experts warn that the contacts are also medical devices that should be regulated by the Food and Drug Administration (FDA). That means if you are picking up a pair without a prescription or if they are being sold as a cosmetic product, the law is being broken. Part of the risk is that people often don\u0027t go to the ophthalmologist or optometrist to make sure that the contacts fit properly. Improper fit can lead to scratches on the cornea, which is the clear dome of tissue above the colored iris portion of the eye. People can also get an ulcer on the cornea, known as a corneal infection. There\u0027s also the risk of getting conjunctivitis, or pink eye, and having decreased vision. It some cases, these problems could lead to blindness.And the health risks could occur with only one wearing.  \"Wearing it for a couple seconds could cause damage,\" Dr. Edward Kondrot, an ophthalmologist and the founder of the Healing The Eye \u0026 Wellness Center in Dade City, Fla., said to CBSNews.com. \"If its poorly fit, you could develop a scratch on the cornea, and it becomes an open wound.\" Not keeping the contact lenses clean and moist can also lead to infections, the Food and Drug Administration pointed out on a post on its website. The problem is not the contact lenses themselves, but the fact that people often use them without consulting an eye care professional, don\u0027t have a prescription and do not use the proper care. \"Bacterial infections can be extremely rapid, result in corneal ulcers, and cause blindness -- sometimes within as little as 24 hours if not diagnosed and treated promptly,\" said Dr. Bernard Lepri, an optometrist at FDA.  Many people are using contacts for the first time when they buy it for a costume, and they don\u0027t even know how to put them in. This further increases the risk for scratching or damaging the eye. \"You\u0027re decked out in your Halloween costume, you have makeup on your face and mascara, which probably harbors bacteria, and your hands are dirty,\" Kondrot added.  He also warned that some lenses themselves may be worrisome. Some unregulated, illegal products may use dyes that contains heavy metals like mercury and lead.  \"These are toxic chemicals that can actually penetrate the eye and enter the nervous system,\" he warned. \"This should scare people enough to not wear these.\" The FDA said that people should never buy color contact lenses from street vendors, salons or beauty supply stores, boutiques, flea markets, novelty stores, Halloween stores, record or video stores, convenience shops, beach shops or the Internet, unless the site requires a prescription. These places are not authorized to sell contact lenses. If you still really want to wear the decorative lenses, the FDA recommended getting an eye exam from a qualified professional and getting a valid prescription. Buy the lenses from a retailer that requires a prescription and take care to follow the directions. If you start having problems -- including redness, eye pain that doesn\u0027t go away after a short period of time and decreasing vision -- you may have an infection and should seek immediate medical help.  \"Get sick on candy, but don\u0027t go blind,\" said Kondrot.   ",
  "category": "HEALTH"
}