{
  "url": "http://www.cbsnews.com/8301-204_162-57609336/fda-proposes-stricter-safety-rules-for-pet-food/",
  "title": "FDA proposes stricter safety rules for pet food",
  "data": " The Food and Drug Administration is proposing long-awaited rules to make pet food and animal feed safer, days after asking the public for help with an investigation into 3,600 pet illnesses linked to jerky treats made in China.\n\n\n\n\n\n\nPlay Video\nFDA eyes Chinese jerky as cause of pet illnesses\n\n\nThe rules stem from a sweeping food safety law passed by Congress almost three years ago, the Food Safety Modernization Act. Like rules proposed earlier this year for human food, they would focus on preventing contamination before it begins. The announcement comes as the FDA says it hasn\u0027t yet determined a cause of almost 600 dog deaths believed to be linked to contaminated jerky treats. The agency has been trying for six years to determine what exactly is causing those illnesses, and has tested more than 1,200 jerky samples since 2011 while investigators still try to connect the dots between the products and pets\u0027 symptoms. \"Today\u0027s announcement addresses a critical part of the food system, and we will continue to work with our national and international industry, consumer and government partners as we work to prevent foodborne illness,\" FDA commissioner Dr. Margaret A. Hamburg, said in a statement. The proposed rules would require those who sell pet food and animal feed in the U.S. -- including importers -- to follow certain sanitation practices and have detailed food safety plans. All of the manufacturers would have to put individual procedures in place to prevent their food from becoming contaminated. The rules would also help human health by aiming to prevent foodborne illnesses in pet food that can be transferred to humans, such as salmonella. The rules fit together with regulations proposed in July to create better oversight over imported food, including pet foods and animal feed, said Michael Taylor, FDA deputy commissioner for foods. The idea behind all of the food safety rules is to make businesses more responsible for the safety of the food they are selling by proving they are using good food safety practices. They might do that by documenting basic information about their suppliers\u0027 cleanliness, testing foods or acquiring food safety audits. If they fail to verify the food is safe, the FDA could stop shipments of their food. The government currently does little to ensure that companies are trying to prevent food safety problems but generally waits and responds to outbreaks after they happen. Taylor said the new rules, once they are in place, could be helpful in investigating the jerky treat deaths if those illnesses are still happening. But they still may not be able to solve the mystery because the FDA has not yet been able to determine what ingredients are causing sickness. The rules generally ask manufacturers to focus on certain hazards and do their best to prevent them. \"We are really still trying to find out what the hazard is\" in the jerky illnesses, Taylor said. One investigator told CBSNews.com earlier this week the investigation has not produced results because there haven\u0027t been enough reports of illnesses to establish a pattern that a particular food is making the dog sick. That\u0027s in part why the FDA put out the public announcement, telling pet owners to look for symptoms associated with jerky treats and call their veterinarian or report it to the agency immediately.  \"Not only are we trying to identify the smoking gun, or source, which would be the food, but we try to make a strong connection between the illness and patient,\" Dr. Lisa Murphy, an assistant professor of toxicology at the University of Pennsylvania School of Veterinary Medicine, said to CBSNews.com. Her lab is one of the facilities conducting tests for the FDA. \"You want to find some evidence that the same toxic substance in the food product is in the dog.\" The FDA said the rule could cost industry $130 million annually to comply. Smaller businesses would have more time to put the rule in place. The agency will take comments for four months before issuing a final rule and will hold a series of public meetings to explain the proposal.  ",
  "category": "HEALTH"
}