{
  "url": "http://www.cbsnews.com/8301-18563_162-57609023/little-grayson-makes-progress-with-auditory-implant/",
  "title": "Little Grayson makes progress with auditory implant",
  "data": " (CBS News) DURHAM, N.C. -- Three-year-old Grayson Clamp was captured on video hearing the voice of his father, Len, for the very first time.  \n\nGrayson and mom Nicole\n/\n\nCBS News\n\n Grayson was born without the nerve that helps connect the ear to the hearing center in the brain. In April, he became the first child in the U.S. to receive an auditory brain stem implant as part of an FDA-approved clinical trial.   The device on his ear collects and transmits sound through wires threaded through the skull. Those wires connect to an implanted electrode that sits in the brain stem.  \n\nGrayson plays with Dr. Jon LaPook.\n/\n\nCBS News\n\n Five months have gone by since the operation.  \n\nNicole Clamp\n/\n\nCBS News\n\n \"It\u0027s like a little miracle every time he hears something, to me,\" says his mother, Nicole. \"But he\u0027s starting to develop speech.\"  The Clamps became Grayson\u0027s foster parents when he was seven weeks old. About a year later, they learned he was completely deaf. Shortly after getting the news, the Clamps were given the option to adopt Grayson.  Nicole says she and Len had no misgivings about going ahead with the adoption after learning Grayson was profoundly deaf.  \"We talked about what kind of parent does a deaf child need,\" she says. \"Do they need to be with deaf parents? Do they need to be with hearing parents? What\u0027s the best situation for him? And it seemed like it was to stay with us.\"  \n\nDr. Craig Buchman\n/\n\nCBS News\n\n Grayson had worked his way into their hearts.  Grayson\u0027s teachers say he spontaneously says a few words, like \"up,\" \"go\" and \"bye-bye.\" He also just learned one new word.  \"Ball -- and I know that because I told him to go get the ball, and he just went and got it,\" Nicole says.  Despite this kind of progress, Grayson has a lot of catching up to do. Since he was a toddler, he\u0027s been communicating with hand gestures. Now he has to link sounds with their meaning, one word at a time.   Watch: Three-year-old hears for the first time in his life, below.  Dr. Craig Buchman of the University of North Carolina performed the surgery. Asked how he thinks Grayson might progress in the future, Buchman says, \"I just don\u0027t know, honestly.\"  \"I mean, we\u0027re going to have to see where he goes,\" he says. \"I mean, I\u0027m really, really hoping for him to develop meaningful spoken language.\"  Nicole says she doesn\u0027t want Grayson to be just a normal kid and young man, like other parents want for their children.  \"I don\u0027t want him to be normal, actually,\" she says. \"I want him to be extraordinary.\"  To anyone who\u0027s met Grayson, he already is.   ",
  "category": "HEALTH"
}