{
  "url": "http://www.cbsnews.com/8301-204_162-57609320/the-road-to-obamacare-how-did-we-get-here/",
  "title": "The road to Obamacare: How did we get here?",
  "data": " The bitter fight over Obamacare -- officially known as the Affordable Care Act (ACA) -- hasn\u0027t dramatically impacted one peculiar and significant aspect of the American health care system: employer-based health insurance.  Fifty-five percent of Americans get health insurance through their employer. Many are surprised to learn that this system is not the result of some well-designed plan by policy experts who weighed its implications and selected it as the best option. Rather, it\u0027s an accident of history that has carried on into the 21st century.  Prior to World War II, just 9 percent of Americans had health insurance. The figure began to rise dramatically after we entered the war in 1941. The government enacted wage and price controls that prevented companies from granting salary increases to workers. It expected everyone, including civilian employees, to sacrifice for the war effort. But in the frenzy of wartime production, demand for workers was high and companies faced a dilemma of how to attract and retain employees without increasing wages. \n\nFew Americans had health insurance until the 1940s, when companies started offering it as a benefit to attract wartime workers.\n/\n\nRussell Lee/FSA/Library of Congress\n\n The solution was to offer health care, a fringe benefit that in 1943, the National War Labor Board ruled did not count as wages. From then on, health benefits started to become increasingly tied to employment.   In 1954, the IRS officially confirmed that employers\u0027 contributions to health benefit plans were tax exempt. This created a huge perk for millions of workers who were receiving valuable benefits that could not be touched by the tax collector. That tax policy now costs the government about $184 billion a year - a figure that keeps rising.  No equivalent tax break was offered for individuals buying their own health insurance. For those folks, ordinary medical expenses, including insurance premiums, were not tax deductible until they exceeded 7.5 percent of income. Starting this year, that figure was raised to 10 percent of income. The disparity has added to the great divide between those with employer-based health insurance and those without it.   But those with on-the-job health insurance have sometimes found themselves uncomfortably dependent on the whims of the boss and the economy. During the great recession, millions of Americans who lost their jobs were dealt a double blow, as unemployment brought the end of affordable job-based health care coverage for themselves and their families.   \n CBS News complete coverage of Obamacare\n   Workers who rely on their employers for insurance have little sense of how much their health care really costs. With someone else footing the bill, there is little incentive to compare prices and save money.  Choice is also limited. While most individuals would balk at the idea of an employer telling them they could only shop for food only at Supermarket X or Supermarket Y, it is perfectly routine to have a corporation tell you which insurance plans you can use. \n\n\n\n\n\n\nPlay Video\nObamacare rules mean some insurance plans are cancelled\n\nThe Affordable Care Act leaves this employer-based system largely intact, but would tax so-called \"Cadillac\" health insurance plans - those that cost significantly more than the national average and offer the most generous benefits. The new tax isn\u0027t scheduled to kick in until 2018, but with strong opposition from unions, it remains to be seen whether this provision will go into effect as planned.    \nWhile some insurance plans purchased on the individual market don\u0027t meet the ACA\u0027s minimum standards and will be cancelled, the administration insists that won\u0027t happen to health insurance plans provided on the job because those meet the coverage requirements. The employer-based insurance system has proven to be the sacred cow of health care policy not necessarily because it is the best system, but because it is the most common.    ",
  "category": "HEALTH"
}