{
  "url": "http://www.cbssports.com/general/eye-on-sports/23840118/andre-agassi-says-rafael-nadal-could-be-best-of-all-time",
  "title": "Andre Agassi says Rafael Nadal could be \u0027best of all time\u0027",
  "data": "  Andre Agassi says the debate for greatest player of all time is between Rafael Nadal and Roger Federer. (Getty Images) It\u0027s a question that is bandied about time and again: Who\u0027s the best tennis player of all time? Of course there are names throughout the ages that pop up, but, consistently, two current stars are considered: Roger Federer and Rafael Nadal.So who\u0027s better?Appearing Monday on HuffPost Live, Andre Agassi addressed the debate.\"I personally think that Nadal has an argument to be made for the best of all time. If Nadal is sitting at a table with Federer and Federer says, \u0027I\u0027m the best ever,\u0027 my first question would be \u0027well then how come you didn\u0027t beat me because I beat you twice as many times? And, hey, by the way, you know I won everything including gold medal and Davis Cup.\u0027\"At the same token, Federer has separated himself during a few years, like nobody else, and he\u0027s done it more consistently. To be able to make the argument for both guys playing in the same generation is pretty remarkable.\"Agassi also discussed his former rival Pete Sampras, describing him as \"off the hook\" on fast surfaces, though beatable on clay. Federer\u0027s range and consistency, Agassi says, sets him apart.\"I think Federer is a class above [Sampras], quite frankly,\" Agassi said. \"I mean, you\u0027re talking about a guy who dominated pretty much on every surface, minus one guy on clay. He\u0027s won everything.\"By all appearances, Federer, 32, may be slowing down somewhat. He hasn\u0027t won a Grand Slam title since Wimbledon in 2012, his record 17th major championship.Nadal, 27, won two majors in 2013, and now has 13 for his career. In addition, he holds a 21-10 record over Federer.",
  "category": "SPORT"
}