{
  "url": "http://www.cbsnews.com/8301-250_162-57609453/cruz-shutdown-successful-because-it-sparked-debate/",
  "title": "Cruz: Shutdown successful because it sparked debate",
  "data": " DES MOINES, Iowa  Texas Sen. Ted Cruz says this month\u0027s partial government shutdown and his key role in it were a success: They got people talking.  \"One of the things we accomplished in the fight over Obamacare is we elevated the national debate over what a disaster, what a train wreck, how much Obamacare is hurting millions of Americans across this country,\" Cruz told about 600 Iowa Republicans on Friday at the Iowa GOP\u0027s annual fundraising dinner in Des Moines. \n\n\n\n\n\n\nPlay Video\nMcConnell: No more government shutdowns\n\n\nCruz\u0027s crusader\u0027s spirit was the perfect example of what longtime Republicans in Iowa and nationally say is at the root of the party\u0027s losing ways and has sparked an intraparty fight over the way forward after consecutive losing presidential elections.  It\u0027s a conversation that\u0027s spilling out from backstage to behind the podium between national GOP establishment luminaries and state leaders around the country.  \"A number of us were saying back in July that this strategy could not and would not work, and of course it didn\u0027t,\" Senate Minority Leader Mitch McConnell, R-Ky., said last Sunday on CBS\u0027 \"Face the Nation.\"  Other Senate Republicans, including the party\u0027s 2008 presidential nominee, Sen. John McCain, R-Ariz., criticized the strategy that led to the shutdown as foolhardy. \n Ted Cruz: The populist egghead Ted Cruz: Leader of the Republican Party? \nAlthough he ultimately lost, the 42-year-old freshman senator played a leading role bringing about the 16-day partial federal shutdown with his demand that President Barack Obama gut his 3-year-old health care law. He also successfully urged a core of House Republicans to follow him, at one point even lobbying conservatives in the House to defy their own leaders by maintaining a hard line against Obamacare.  The final and perhaps most important stop of Ted Cruz\u0027s recent public tour was less an exclamation point on a series of raucous events in Texas and more a presentation of opposite ideas for the GOP\u0027s way forward nationally.\n\n\n\n\n\n\nPlay Video\nRepeated hecklers prompt Cruz offer to Obama\n\n\n\n\n\n\n\n\nPlay Video\nHas the shutdown fight dimmed Ted Cruz\u0027s standing in the GOP?\n\n\n\n\n\n\n\n\nPlay Video\nTed Cruz remarks on Senate shutdown, debt deal\n\n\n Immediately before the Cruz spoke, five-term Iowa Gov. Terry Branstad barely acknowledged the guest and said the way forward for the party nationally was by way of the route cleared by Republican governors.  Branstad, 66, at the heart of Iowa\u0027s GOP establishment, called Cruz \"a bright, up-and-coming senator\" before turning his attention to the tangible successes of Republican governors, beginning with Cruz\u0027s own governor, Rick Perry of Texas.  \"The results of conservative governors are making a difference,\" said Branstad, who is preparing to seek election next year.  He pointed to Wisconsin and Michigan governors moves to trim union rights as reasons for falling unemployment, and Texas\u0027 reduction in regulation for rising job growth.  Cruz, in his 40-minute speech, argued the health care law enacted in 2010 was the main impediment to economic growth.  Cruz was vague after the speech about whether he would continue to try to defund the law in the future.  \"There will be plenty of time the coming months to talk about specific tactics and strategies,\" he told reporters later. \"What I think is critical is we keep the focus on Obamacare, we keep the focus on the fact that this bill isn\u0027t working.\"  Cruz said Democratic senators asking Health and Human Services Secretary Kathleen Sebielius for an extension of the enrollment period was no surprise. But he wished they had called for its repeal or defunding, not \"expand the enrollment period.\"  On Tuesday, Sen. Jeanne Shaheen, D-N.H., sent a letter to the administration urging them to extend the open enrollment period beyond March 31, 2014 - the date after which individuals must have health insurance or face a fine. Her proposal received backup from several Democrats in red states who face tough reelection fights in 2014, like Arkansas Sen. Mark Pryor and Alaska Sen. Mark Begich.  Sen. Joe Manchin, D-W.V., went a step further, requesting a one-year delay in the IRS fine for individuals who haven\u0027t purchased insurance.  Former Republican National Committee Chairman Haley Barbour pointedly accused tea party-fueled refusal to support spending measures during the shutdown foolhardy. Though Branstad wasn\u0027t as direct, he has shown little patience for Congress over the past month, especially the drama surrounding Cruz, and has called for broadening the party to make it more welcoming to voters who have turned away from the GOP.  It was Cruz\u0027s third visit to Iowa, which is expected to hold the leadoff GOP nominating caucuses ahead of the 2016 presidential election.  ",
  "category": "POLITIC"
}