{
  "url": "http://www.cbsnews.com/8301-250_162-57609229/healthcare.gov-investigations-leave-democrats-in-uneasy-spot/",
  "title": "HealthCare.gov investigations leave Democrats in uneasy spot",
  "data": " Updated Oct. 25, 1:50 p.m. with a new statement from CGI Republicans in Congress this week ratcheted up the pressure they\u0027re putting on the Obama administration to explain why the Obamacare website HealthCare.gov is so flawed, and in many instances, Democrats echoed their complaints. They\u0027ve also, however, warned their GOP colleagues against taking the complaints too far.   \n\n\n\n\n\nPlay Video\nObamacare website contractors point fingers at White House\n\nThe ongoing investigations have left Democrats in the uneasy position of criticizing the implementation of President Obama\u0027s signature law. This week left them acknowledging the major problems with HealthCare.gov, which serves 36 states, while at the same time complaining about partisan attacks.   In an open letter published this week, two Democrats on the House Oversight Committee chastised the committee\u0027s chairman Rep. Darrell Issa, R-Calif., for creating an \"unsubstantiated narrative that White House officials were making technical decisions [about HealthCare.gov] based on political motivations.\"  \"Unfortunately, this has become an unfortunate pattern with this Committee,\" wrote Rep. Elijah Cummings, D-Md., the top Democrat on the committee, and Rep. Gerry Connolly, D-Va. \"In the Committee\u0027s past investigations involving Operation Fast and Furious, the attacks in Benghazi, and the IRS review of applicants for tax-exempt status, your approach has been to leap directly to accusations against the White House and top Administration officials with no basis in fact.\" \n HealthCare.gov architects: Govt\u0027s pre-launch testing insufficient In depth: Obamacare kicks off   One of the private contractors who testified before Congress on Thursday did seem to contradict Issa\u0027s suggestions that the White House tried to politically influence the website\u0027s construction.   \"To my knowledge, the White House has not given us direct instructions,\" Cheryl Campbell, senior vice president of CGI Federal, told Rep. George Butterfield, D-N.C., in a House Energy and Commerce Committee hearing. Campbell\u0027s firm helped build the website and recently briefed the House Oversight Committee about its construction. Issa this week noted that in the briefing, CGI officials repeatedly referred to \"what the White House wants.\"  Campbell, however, said of her colleagues\u0027 statements, \"I think they may have been taken out of context.\"  Cummings and Connolly charged that Issa this week failed to tell the whole story about the CGI briefing. However, CGI later issued a statement saying, \"Ms. Campbell\u0027s testimony was in no way meant to imply that misleading information emanated from Congressman Issa\u0027s office.\"   During Thursday\u0027s five-hour hearing, other Democrats similarly complained that Republicans are overblowing the problems.   \"Here we go again, another cynical effort to delay, defund or repeal\" the health care law, Rep. Frank Pallone, D-N.J., said. \"I\u0027d like to think this hearing is above board or legitimate, but it\u0027s not.\"  \n\n\n\n\n\nPlay Video\nDems on Obamacare website woes: Fix it, don\u0027t nix it\n\n\n\n\n\n\n\nPlay Video\nUpton: Why were we told Obamacare exchanges were ready?\n\n  Pallone and two other Democrats on the committee used the slogan \"fix it, not nix it\" to acknowledge the site\u0027s problems while attacking the GOP\u0027s intent on taking down the entire health care law.   Still, a number of Democrats have joined Republicans in harshly criticizing the Obama administration and the private contractors it hired for the shoddily-built website.   Rep. Anna Eshoo, D-Calif., a Democrat who represents Silicon Valley, said it was a \"lame excuse\" to blame the website\u0027s problems on too many visitors -- a line the administration has repeatedly used. \"Amazon and eBay don\u0027t crash the week before Christmas,\" Eshoo said.  Rep. Diana DeGette, D-Colo., complained that there are still reports of \"significant problems\" with the site, more than three weeks after its launch. \"These problems need to be fixed, and they need to be fixed fast,\" she said.  Democrats also largely agree with Republicans that someone needs to be held accountable for the website\u0027s problems. Rep. Rick Nolan, D-Minn., told the Associated Press that Mr. Obama needs to \"man up\" and fire someone over the botched website rollout.   The administration, meanwhile, continues to be evasive about the website\u0027s issues. On a conference call with reporters Thursday, Health and Human Services (HHS) officials declined to specify which problems they\u0027re working on fixing, or whether HHS Secretary Kathleen Sebelius knew about the site\u0027s major issues before its launch. HHS has said that nearly 700,000 people have submitted applications through the new health care exchange system, but the department won\u0027t say how many of those people have actually purchased insurance.    At Thursday\u0027s hearing, it became clear that the Centers for Medicare \u0026 Medicaid Services (CMS), an agency within HHS, was responsible for some bad decisions, such as the decision to deny HealthCare.gov visitors the ability to browse the website without logging onto the site.   \"I think we were surprised as anybody else that they had turned it off,\" Energy and Commerce Committee Chairman Fred Upton, R-Mich., said after the hearing. \"And we\u0027re gonna find out who that person was and why.\"  With questions like that unanswered, Democrats would be hard-pressed to object to the continued investigations into the website\u0027s construction. The Energy and Commerce Committee is holding another hearing next week at which Sebelius is expected to testify, and the House Ways and Means Committee is holding a hearing next week as well. Along with Issa\u0027s Oversight Committee, Republicans on the Senate Health, Education, Labor and Pensions (HELP) Committee and the Senate Finance Committee are also investigating the matter.   But along with the serious policy questions comes a heavy dose of politics.   \"If the we site glitches are just the tip of the iceberg,\" Rep. Greg Walden, R-Oreg., chairman of the National Republican Congressional Committee, told the New York Times. \"It\u0027s only a matter of time before the law sinks and takes with it those Democrats who wrote it, voted for it and are proud of it.\"  Republican congressional candidates are taking advantage of the renewed focus on the health care law. For instance, Colorado Republican Senate candidate Amy Stephens on Thursday called on Sen. Mark Udall, D-Colo., to join an effort to delay the individual mandate penalty.   \"It is wrong for Mark Udall and the Obama Administration to impose the disastrous individual mandate tax on middle class workers given the massive technical difficulties exposed during the failed launch of ObamaCare,\" Stephens said.   ",
  "category": "POLITIC"
}