{
  "url": "http://www.cbsnews.com/8301-250_162-57609219/is-alleged-nsa-snooping-on-u.s-allies-out-of-the-ordinary/",
  "title": "Is alleged NSA snooping on U.S. allies out of the ordinary?",
  "data": " After allegations surfaced this week that the National Security Agency had monitored the telephone conversations of German Chancellor Angela Merkel, the Germans summoned all of the diplomatic high dudgeon they could muster. \n\n\n\n\n\nPlay Video\nNSA spying: Accused of monitoring phone of chancellor of Germany\n\n\n\n\n\n\n\nPlay Video\nW.H.: U.S. \"is not monitoring\" German chancellor\u0027s phone\n\nA spokesman for Merkel, Steffan Seibert, said she \"views such practices, if the indications are confirmed...as completely unacceptable.\" \"There must not be such surveillance of a head of government\u0027s communication,\" he added. \"That would be a serious breach of trust. Such practices must be stopped immediately.\" But given the rigorous demands of intelligence gathering and the spy-craft practices with which most governments - including Germany - are familiar, should anyone really be surprised if the allegations turn out to be true? Former Secretary of State Madeline Albright, for one, didn\u0027t see anything out of the ordinary in the alleged phone-tapping. \"Let me just say this, this is not a surprise to people. Countries spy on each other,\" the veteran diplomat said Thursday at a conference sponsored by the Center for American Progress in Washington.  She recalled an incident, during her time atop the nation\u0027s diplomatic apparatus, when she was approached by the French ambassador and pressed on the details of a conversation she thought was private: \"And I will very much remember when I was at the United Nations, the French ambassador coming up to me saying, \u0027Why did you say that to somebody about why do you want women in the government?\u0027 And I said, \u0027Excuse me?\u0027\" \"They had an intercept of something, so it isn\u0027t exactly as if this is new,\" she said. CBS News Senior National Security Analyst Juan Zarate, who served as deputy national security adviser under former President George W. Bush, agreed, saying it may be politically inconvenient for such snooping to become public knowledge, but nobody is under any illusion about the sort of espionage that happens every day between governments, even close allies. \"It\u0027s what governments do - they spy on each other - so I don\u0027t think, at least [among] those who watch the intelligence and counter-intelligence space, there\u0027s any surprise here,\" he said. \"I think the big issue is that...It\u0027s becoming a political issue in many of these countries.\" Zarate argued that, for all the diplomatic discord sown by the exposure of some surveillance practices, they remain a necessary tool in the U.S. intelligence arsenal. \"In a sense, we want our spy agencies to be spying - that\u0027s what they do,\" he said. \"Spy craft is about trying to learn information that you wouldn\u0027t otherwise gather, and you get it from friends and enemies and competitors.\" And he noted that foreign governments waxing irate should be careful not to throw stones in glass houses. \"The other dimension...that\u0027s now sort of emerging is the reality that our friends and allies spy on us as well,\" he said. Of course, it would be impolitic for the U.S. to simply tell Germany, \"Don\u0027t be naive,\" or \"get over it.\" And so it fell to White House press secretary Jay Carney to staunch the bleeding by publicly acknowledging the rift created by the allegations and vowing that the U.S. \"is not monitoring and will not monitor\" Merkel\u0027s phone conversations. \"There is no question,\" Carney said on Thursday, that \"these revelations have caused tensions in some of our relationships, and those relationships are very important to the United States and to the American people, to our economy and to our security. And that is why we have taken them seriously.\" Notably absent from the White House response: An ironclad denial that the U.S. had ever monitored Merkel\u0027s phone conversations in the past. But even as the White House struggles to contain the controversy involving Merkel, a fresh report emerged on Thursday alleging that the administration monitored the phone conversations of 35 world leaders, raising the possibility that the diplomatic damage wrought by U.S. snooping practices may grow, rather than contract, at least in the near-term. The Guardian newspaper, citing the latest in a series of rolling disclosures from NSA leaker Edward Snowden, reported that an official in another U.S. government department had provided the phone numbers to the NSA, which immediately flagged them for monitoring. In a poetic twist, the memo that revealed the monitoring also noted that officials obtained \"little reportable intelligence\" from their surveillance of phone conversations.   ",
  "category": "POLITIC"
}