{
  "url": "http://www.cbsnews.com/8301-250_162-57609241/va-gubernatorial-candidates-spar-over-gun-laws-at-debate/",
  "title": "Va. gubernatorial candidates spar over gun laws at debate",
  "data": " BLACKSBURG, Va. Republican Ken Cuccinelli defended the rights of gun owners during Thursday\u0027s gubernatorial debate with Democrat Terry McAuliffe, saying tougher laws would not have prevented the massacre on the Virginia Tech campus that left 33 dead. \t McAuliffe, who has seen his lead grow over Cuccinelli in polls, said government has a role in keeping people safe and tougher laws, such as expanded background checks, could help. \"Some people should not own guns,\" McAuliffe said. \t The pair met with less than two weeks before Nov. 5\u0027s election that could be a test whether a deeply conservative candidate like Cuccinelli can win statewide here. Cuccinelli, the tea party-backed attorney general, has seen McAuliffe\u0027s lead grow in recent weeks as the Republican brand was damaged in the wake of the partial government shutdown in Washington and an all-out negative shift in wall-to-wall campaign advertisements. \t The two candidates traded familiar criticism over their economic proposals, education policies and their records, but the specter of the massacre on this campus was a dramatic illustration of the deep differences between Cuccinelli and McAuliffe. \t Virginia Tech senior Seung-Hui Cho killed 32 people and wounded another 17 on campus in 2007. Cho later killed himself. \t Cuccinelli, whom the National Rifle Association is supporting, said tougher gun laws were not the answer. \t \"It\u0027s nearly impossible to find the Cho before it happens,\" Cuccinelli said. He said the focus should be on mental health services. \t But that doesn\u0027t mean inaction on guns is acceptable, McAuliffe countered. \t \"You cannot look at these things and not understand that we need to do everything that we possibly can to make sure our communities are safe,\" said McAuliffe, who visited the on-campus memorial before the debate. \t \"I am standing on a stage at Virginia Tech where we experienced one of the most horrific events with a gun in American history. It\u0027s time to stand up,\" he added. \t Gun rights emerged this week as a late addition to the campaign. One of New York Mayor Michael Bloomberg\u0027s groups is set to spend more than $1 million on television ads in the final two weeks criticizing Cuccinelli\u0027s positions on gun rights. \t Meanwhile, the NRA has given McAuliffe its worst possible rating and has allocated $500,000 for the race. \t \"I don\u0027t care what grade I got from the NRA,\" McAuliffe said. \"I never want to see another Newtown or Aurora or Virginia Tech ever again.\" \t Keeping with the well-trod criticism of each other, Cuccinelli called McAuliffe, a former Democratic National Committee chairman, a Washington insider who was running for office so he could reward political cronies. McAuliffe responded that Cuccinelli is running so he can impose an \"extreme\" agenda on Richmond that has no basis in reality. \t \"His plan is like believing that he came here on a unicorn tonight,\" McAuliffe said. \t Cuccinelli brushed it off: \"Some people run to do something. Some people run to be something.\" \t The statements mirror the onslaught of television advertising. Most of it is negative, and the ads against Cuccinelli dominate by a 2-to-1 margin. \t Yet the fierce criticism and negative tone of the campaign has come at a cost. An NBC News poll last week found only 43 percent of voters had a favorable view of McAuliffe. More than half - 52 percent - had a negative view of Cuccinelli. \t Libertarian candidate Robert Sarvis was excluded from the debate. He will appear in Richmond on Saturday at a forum that also includes McAuliffe and Cuccinelli. \t  ",
  "category": "POLITIC"
}