{
  "url": "http://www.cbsnews.com/8301-505263_162-57609255/brett-favre-admits-serious-memory-loss-in-radio-interview/",
  "title": "Brett Favre admits serious memory loss in radio interview",
  "data": " (CBS News) Concussions on the playing field may be taking a dramatic toll on another football legend. This week, the St. Louis Rams reportedly asked if quarterback Brett Favre would come out of retirement. Favre said no -- and then he revealed that he\u0027s actually scared to suit up.   Favre\u0027s toughness on the football field was so legendary, he was often referred to as a linebacker playing quarterback, CBS Sports\u0027 James Brown, host of \"The NFL Today,\" reported on \"CBS This Morning.\" Favre took great pride in being a hard-nosed ballplayer, but that also made him an easy target.  For 20 years, Favre took more than his fair share of hits in the National Football League, including a career-ending shot that left him unconscious.  In a radio interview Thursday, the 44-year-old admitted he now fears he\u0027s paying the price for all those hits: serious memory loss. He said in the interview, \"I don\u0027t remember my daughter playing soccer, youth soccer, one summer. I don\u0027t remember that.\"  Favre played in a record 297 regular season games in a row, but set a more ominous mark --sacked 525 times, suffering an unknown number of concussions. Favre said, \"When I first started playing, those first 10 years, they didn\u0027t keep a log like they do now, so there\u0027s no telling.\"  Dr. Robert Glatter, a former New York Jets sideline physician, says Farve\u0027s symptoms are typical. He explained, \"Often the CT scans or the initial scans we do after a suspected head injury, which is severe, may be normal, but there\u0027s functional changes -- changes involving memory.\"  Just this year, the NFL agreed to pay out $765 million in a landmark concussion settlement with 4,500 retired players.  Critics argue the league got off easy. But last month on \"CBS This Morning,\" NFL commissioner Roger Goodell fired back, saying, \"What we were able to do was all compromise in our admissions. There was no admission of guilt, there was no recognition that anything was caused by football, but the reality is we want to help our players.\"  Favre played the majority of his career before the rules protected quarterbacks, and before head-to-head hits were outlawed. Favre said, \"I think after 20 years, God only knows the toll that will be taken as time goes by.\"  Favre said he considered having tests done on his brain to look for any signs of concussions, but he hasn\u0027t done that yet because he says even if doctors find something, there isn\u0027t much in terms of treatment. \nBrown added on \"CTM,\" \"While this fraternity of players oftentimes joke about things because nothing is sacred in the locker room, in light of the new research -- and a number of players saying the same things -- believe me a lot of players are concerned. And no one knows the ex-players better than their wives, and many wives are most concerned and many praying very fervently because they are seeing subtle changes.\"  ",
  "category": "HEALTH"
}