{
  "url": "http://www.cbsnews.com/8301-204_162-57609184/guiding-stars-nutritional-ratings-lead-to-healthier-choices-study/",
  "title": "Guiding Stars nutritional ratings lead to healthier choices: Study",
  "data": " PORTLAND, Maine A nutritional rating system using gold stars affixed to price labels on grocery store shelves appears to have shifted buying habits, potentially providing another tool to educate consumers on how to eat healthier, according to a new study. \t The independent study examining a proprietary gold star system used in Maine-based Hannaford Supermarkets suggested it steered shoppers away from items with no stars toward healthier foods that merited gold stars. \t \"Our results suggest that point-of-sale nutrition information programs may be effective in providing easy-to-find nutrition information that is otherwise nonexistent, difficult to obtain or difficult to understand,\" the researchers wrote in the study, published last week in the journal Food Policy. \t It\u0027s the most rigorous scientific study focusing on Guiding Stars, which was instituted in 2006 in Hannaford stores and is now licensed for use in more than 1,800 stores in the U.S. and Canada. \t Researchers from the U.S. Department of Agriculture, the Food and Drug Administration and the University of Florida focused on the cereal aisle, where it can be challenging to make healthy choices amid conflicting health claims and a multitude of sugary offerings targeting children. \t They compared data from 134 Hannaford grocery stores in the Northeast against an equal number of similar stores and found that sales of no-star cereals dropped 2.58 percent more at Hannaford stores compared with the control group, while cereals getting one, two or three stars at Hannaford saw modest but measurable gains of 0.5 percent to 1 percent during the first 20 months of the program. \t \"Although the percentages are small, if you think in terms of the actual quantities or boxes of cereal sold in the national market, this could have some important implications on the nation\u0027s health,\" said Jordan Lin, an author of the study and scientist at the FDA. \t Hannaford, consumers and others have touted the rating system as simple and easy to understand. \t \"My daughter, Emily, she\u0027ll count the stars. The more stars, the better the food,\" Angela Buck said this week while shopping with her 3-year-old daughter in a Hannaford store in Colonie, N.Y. \t Besides Guiding Stars, the United Kingdom experimented with a traffic light system that uses the colors red, yellow and green to highlight calories, fat, saturated fats, sugar and salt on labels; the NuVal system ranks food on a scale of one to 100; and Grocery Manufacturers of America and Food Marketing Institute have created a Facts Up Front system. \t Unlike nutrition labels on the products themselves, these programs aim to put easier-to-understand nutritional information in consumers\u0027 faces, on shelves or in aisles. \t Some nutrition advocates want the federal government to step in to avoid confusion caused by competing systems. FDA officials said in 2009 that they were working on federal standards for front-of-package calorie labels, but those labels are still in the works. \t For the study, researchers zeroed in on Hannaford and Guiding Stars because of the availability of the data. It used data that was provided by Guiding Stars Licensing Co. and from Nielsen ScanTrack to compare the Hannaford and the control group. \t Julie Greene, healthy living manager at Hannaford, said the Guiding Stars program has been a hit with consumers, helping them navigate confusing claims on packaging that highlight a product\u0027s nutritional attributes while masking less-healthy ingredients. \t The cereal aisle, in particular, can be a confusing place. \"It can be very overwhelming. Every cereal box is a virtual billboard of health claims,\" she said. \t Surprisingly, there was less pushback than anticipated from food manufacturers. \t Instead of rebelling against Guiding Stars, many manufacturers have been reformulating their products to become healthier because that\u0027s what consumers are demanding, she said. Another way to make better nutritional choices while grocery shopping may be to never shop on an empty stomach. A May study in JAMA Internal Medicine showed that people who bought groceries while hungry tended to make more high-calorie purchases.  ",
  "category": "HEALTH"
}