{
  "url": "http://www.cbsnews.com/8301-33816_162-57609448/morning-rounds-inside-first-of-its-kind-hair-restoration-method/",
  "title": "Morning Rounds: Inside first-of-its-kind hair-restoration method",
  "data": " (CBS News) CBS News chief medical correspondent Dr. Jon LaPook and CBS News contributor Dr. Holly Phillips joined \"CBS This Morning: Saturday\" to discuss the major medical stories of the week.  A cure for baldness has long eluded scientists, but a group of researchers say they have created a first-of-its-kind hair-restoration method that may actually get a person to grow new hair. This could be especially helpful for women, burn victims and other hair-loss patients who can\u0027t be helped with traditional hair-loss methods.  \"It\u0027s really amazing because, right now, the transplantation of hair is really just a relocation,\" said LaPook. \"You take hair, generally from the back of the scalp to the front, but you\u0027re limited by the number of follicles. Well, what a very clever group at Columbia University Medical Center did ... is that they went to the cells at the base of the hair, and they took them outside, put them in a petri dish and multiplied them and created a lot more of the cells that then make the follicles, and then they were able to put them back into human, bald skin that was grafted onto the back of mice; four to six weeks later - hair.\"  The hair was like \"baby hair,\" LaPook said. \"But they think over time they\u0027ll figure out a way to get it. They also don\u0027t know after the first hair falls out, will another one grow back, but it\u0027s really fascinating.\"  For more on this story: First-of-its-kind hair restoration method may grow follicles in bald spots  Another big story from this week is about a child born with HIV still in remission after 18 months of treatment, according to the New England Journal of Medicine.   Phillips said it\u0027s too soon to use the term \"cure\" in this case. \"We don\u0027t know if this little girl is going to stay HIV-free for the rest of her life, but it certainly looks that way, and that\u0027s why this is such a big deal,\" Phillips said. \"Basically it showed if you treat HIV right away, ideally within the first few hours of being infected, the medicines can eradicate the virus to the degree that it\u0027s permanently erased from our cells, so that\u0027s what we\u0027re hoping will stay that way in this little girl, and it can have a huge impact.\"  Worldwide, Phillips pointed out, 400,000 babies are born every year with HIV, though the number is lower in the U.S. than in other places because mothers are treated for HIV during their pregnancies, which cuts down on transmissions.   For more medical news on coffee\u0027s potential benefits at lowering the risk of liver cancer as well as news on the HPV vaccine and one boy\u0027s remarkable journey to hear with a brain-stem implant, watch the full \"CTM\" appearance above.  Check out more from Morning Rounds with Dr. LaPook  ",
  "category": "HEALTH"
}