{
  "url": "http://www.cbsnews.com/8301-204_162-57609158/non-senior-stroke-rate-climbs-25-percent-over-past-two-decades/",
  "title": "Non-senior stroke rate climbs 25 percent over past two decades",
  "data": " LONDON More than 30 percent of strokes occur in adults between the ages 20 and 64 years old. It\u0027s a \"startling\" 25 percent rise over rates reported 20 years ago, according to the authors of a new study. The authors of this first global analysis of the problem say strokes are increasingly striking younger adults, and the incidence of the disabling condition worldwide could more than double by 2030. \n\n\n\n\n\nPlay Video\nVitamin B supplements may stave off strokes\n\n\n\n\n\n\n\nPlay Video\nMinor strokes may shave five quality years off life\n\n More than 85 percent of strokes are caused by a clot blocking an artery that supplies blood to the brain, known as ischemic stroke. Other types of stroke include hemorrhagic stroke, which is caused by a blood vessel bursting in the brain, or transient ischemic attacks or \"mini strokes,\" which cause the symptoms of a stroke but don\u0027t leave lasting damage. When having a stroke, patients often experience symptoms including a droopy face, the inability to lift their arms and garbled speech. If not treated quickly, patients can be left with long-term side effects, including speech and memory problems, paralysis and the loss of some vision. While a stroke occurs in all age groups, previous research shows the risk doubles for each decade between the ages of 55 and 85 years, according to the National Institute of Neurological Disorders and Stroke. \"The worldwide stroke burden is growing very fast and there is now an urgent need for culturally acceptable and affordable stroke prevention, management and rehabilitation strategies to be developed and implemented worldwide,\" study leader Professor Valery Feigin, director of the National Institute for Stroke and Applied Neurosciences at AUT University in New Zealand, said in a statement. Though the chances of a stroke jumps dramatically with age, the growing number of younger people with worrying risk factors such as bulging waistlines typical of the ongoing obesity epidemic, diabetes and high blood pressure means they are becoming increasingly susceptible. Worldwide, stroke is the second-leading cause of death after heart disease and is also a big contributor to disability. Scientists combed through more than 100 studies from 1990 to 2010 studying stroke patients across the world and also used modeling techniques when there wasn\u0027t enough data. They found the incidence of stroke has jumped by a quarter in people aged 20 to 64 and that those patients make up almost one-third of the total number of strokes.Thirty-one percent of strokes occurred in adults ages 20 to 64 in 2010, according to the new study, up from 25 percent occurring in that age group in 1990. Researchers said most strokes still occur in the elderly and that the numbers of people suffering strokes are still increasing as the world\u0027s population ages. \"Some of the increase we will see in strokes is unavoidable because it has to do with people aging, but that doesn\u0027t mean we should give up,\" said Majid Ezzati of Imperial College London, one of the study\u0027s authors. Ezzati said countries should focus on reducing smoking rates further, aggressively controlling blood pressure and improving eating habits. Ezzati said developing countries such as Iran and South Africa that have set up national systems to monitor maternal and child health are a good model for similar initiatives that could help keep stroke risk factors, such as high blood pressure, in check. Ezzati and colleagues found the death rate from strokes dropped 37 percent in developed countries and 20 percent in developing countries, largely because of better diagnosis and treatment. Stroke prevalence was highest in East Asia, North America, Europe and Australia. It was lowest in Africa and the Middle East -- though researchers said people in those regions may be dying of other ailments before they get old enough to have a stroke. The research was paid for by the Bill \u0026 Melinda Gates Foundation and published online Thursday in the journal Lancet. In the U.S., doctors have already noted an alarming increase in strokes among young and middle-aged Americans, while the number has been dropping in older people. \n\n\n\n\n\nPlay Video\nWhy are stroke victims getting younger?\n\n Last Oct., a study looking at more than 1 million adults found 13 percent of stroke victims in 1993 were between the ages of 20 and 54, but in 2005 when researchers crunched the numbers, 19 percent of strokes occurred in people of that age group. \"Young people think stroke is only a problem of the elderly, but we need to educate them,\" said Dr. Yannick Bejot of the University Hospital of Dijon in France, who co-wrote an accompanying commentary. He added that using illegal drugs such as marijuana and cocaine also boosts the chance of a stroke. \"If young people understood how debilitating a stroke is, maybe they would change their behavior,\" he said.   ",
  "category": "HEALTH"
}