{
  "url": "http://www.cbsnews.com/8301-204_162-57609309/paying-$10000-for-kidney-donation-may-reduce-medical-costs-increase-patient-life-quality/",
  "title": "Paying $10,000 for kidney donation may reduce medical costs, increase patient life quality",
  "data": " The mere suggestion of paying for an organ donation is controversial. However, a new study shows that if people were offered $10,000 for a kidney, it may actually be more cost-effective than the current organ donation system, lead to longer lives for the patients and cut down on the growing need for donor kidneys. \"Such a program could be cost saving because of the extra number of kidney transplants and, consequently, lower dialysis costs. Further, by increasing the number of people receiving a kidney transplant, this program could improve net health by increasing the quality and quantity of life for patients with end-stage renal disease,\" study co-author Lianne Barnieh, a post-doctoral fellow at the University of Calgary in Alberta, Canada, said in a press release.   According to the National Kidney Foundation, about 18 people die every day waiting for an organ transplant in the U.S., and more than 2,000 new names are added to the national kidney waiting list each month. As of Oct. 18, the Organ Procurement and Transplantation Network reported that 98,271 people in the U.S. are currently waiting for a kidney donation.  Patients who receive new kidneys have more than a 69 percent five-year survival rate according to government estimates.  People are born with two kidneys but can sustain necessary bodily functions with one, so there is a possibility for living organ donation. But, whether or not people should be allowed to sell their own organs has been subject to legal and ethical debates.  Researchers looked at a hypothetical model where governments or a third party would pay living kidney donors $10,000 for their organ. They determined that if the method raised the number of living donations by a very conservative 5 percent, it would result in incremental cost savings of $340 and a gain of 0.11 quality-adjusted life years over a patient\u0027s lifetime compared to the current system. If the rate went up 10 percent, the savings would be $1,640 per patient, and they would get an additional 0.21 quality-adjusted life years. Raising the rate to 20 percent would equal $4,030 less in medical spending and 0.39 more quality-adjusted life years. \"Utilization of these organs represents an opportunity for shortening wait time for patients while providing good outcomes and an extremely low level of risk for transmission of infections,\" co-author Moya Gallagher, a nurse at New York-Presbyterian Hospital/Columbia University Medical Center in New York, said to Medical Xpress. The study was published in the Clinical Journal of the American Society of Nephrology in October 2013. In an accompanying editorial published in the same issue, Dr. Peter Reese, assistant professor of medicine and epidemiology at Penn Medicine in Philadelphia, and Matthew B. Allen, also from the University of Pennsylvania, suggested that it is time to conduct a study which would look into a limited trial of offering incentives for organ donation. \"Current trends regarding the use of financial incentives in medicine suggest that the time is ripe for new consideration of payments for living kidney donation,\" they wrote.   ",
  "category": "HEALTH"
}