{
  "url": "http://www.cbsnews.com/8301-204_162-57609359/pure-hydrocodone-stronger-than-vicodin-approved-by-fda/",
  "title": "Pure hydrocodone, stronger than Vicodin, approved by FDA",
  "data": " WASHINGTONThe Food and Drug Administration has approved a stronger, single-ingredient version of the painkiller hydrocodone, the widely-abused prescription medicine for chronic pain.  The agency said in a statement Friday it approved the pill Zohydro ER for patients with pain that requires, daily, around-the-clock treatment that cannot be addressed with other drugs.  The approval comes as a surprise since the agency\u0027s own panel of outside advisers gave an overwhelmingly negative review of the product last year. The FDA\u0027s panel of pain specialists voted 11-2 against approving the drug last December, questioning the need for a new form of one of most widely-abused prescription painkillers in the United States.  Zohydro ER is manufactured by San Diego-based Zogenix, Inc.  In Dec. 2011, experts expressed concern about the drug when it was in final stages of development.  \"I have a big concern that this could be the next OxyContin,\" said April Rovero, president of the National Coalition Against Prescription Drug Abuse, said at the time. \"We just don\u0027t need this on the market.\"Painkiller 10 times stronger than Vicodin worries addiction experts  The FDA announcement also comes just one day after the agency said it would recommend stronger controls on combination drugs containing hydrocodone, such as Vicodin, which is combined with acetaminophen.  \"For the millions of American patients experiencing an acute medical need or living with chronic pain, opioids, when prescribed appropriately, can allow patients to manage their pain as well as significantly improve their quality of life,\" Dr. Janet Woodcock, director for the Center for Drug Evaluation and Research at the FDA, said in a statement Thursday. \"However, in recent years, the FDA has become increasingly concerned about the abuse and misuse of opioid products, which have sadly reached epidemic proportions in certain parts of the United States.\"  Drugs like Vicodin would be moved from its current classification as a Schedule III drug to a more restricted Schedule II category, which means the drug has a high potential for abuse and can lead to severe physical or psychological dependence.  Under the shift, the pills can only be prescribed in 90-day amounts as opposed to current rules where patients can get up to five refills in some states. Nurses and physician assistants will no longer be able to prescribe hydrocodone combination pills. There are also stringent record-keeping, reporting, and security requirements for Schedule II controlled substances.  The newly-approved Zohydro ER falls under this II drug classification. The drug may be an alternative to combination medications, because acetaminophen in high doses has been linked to liver problems.  The most common side effects are constipation, nausea, drowsiness, fatigue, headache, dizziness, dry mouth, vomiting and itching.The FDA is requiring post-market studies of Zohydro ER to assess the risks of misuse, abuse, increased sensitivity to pain (hyperalgesia), addiction, overdose and death associated with long-term use beyond 12 weeks.  In 2011, U.S. doctors wrote more than 131 million prescriptions for hydrocodone, making it the most prescribed drug in the country, according to government figures. Hydrocodone pills also consistently rank among most-abused medicines in the U.S., according to the DEA.  The drug belongs to a family of medicines known as opiates or opioids because they are chemically similar to opium. They include morphine, heroin, oxycodone, codeine and methadone.  ",
  "category": "HEALTH"
}