{
  "url": "http://www.cbssports.com/golf/eye-on-golf/24137493/the-10-best-traditions-in-golf",
  "title": "The 10 best traditions in golf",
  "data": "  This photo of Tiger Woods at the Masters encompasses nearly half this list. (USATSI) More Golf: Leaderboard | Rankings | Schedule | Equipment | FedEx CupIt\u0027s the offseason in golf (kind of) which means Rory McIlroy is in China, and that\u0027s about it. There\u0027s not a lot going on stateside (unless you want to stay up until 3 a.m. watching the CIMB Classic) so I wanted to put together some fun topics for offseason discussion.First up: The best traditions in golf. Feel free to drop f-bombs on me on Twitter disagree in the comments section.1. Green Jacket presentation: What? You thought I was going to say something other than this?2. US Open on Father\u0027s Day: This has produced some waterworks moments over the years, the most recent Justin Rose pointing to the sky to his father and giving us this quote:\"Yes, the look up to the heavens was absolutely for my dad; Father\u0027s Day was not lost on me today,\" Rose said. \"You don\u0027t have opportunities to really dedicate a win to someone you love. And today was about him and being Father\u0027s Day.\"3. Ryder Cup format: Everything about it is perfect. The passionate fans, the great courses, the scoring -- all of it, I wouldn\u0027t change a single thing. Also, the two-year wait is perfect.I hate that we have to wait four years between the Olympics but there\u0027s no denying that the Games mean more because of it. Same thing here. If they played the Ryder Cup every year, it wouldn\u0027t mean nearly as much, though I\u0027m not sure I could go 48 months between events either. Two years is just right.4. Ceremonial tee shot at Augusta: In 2012 I went to the Masters with a buddy and our wives and I remember speed-walking (remember, you can\u0027t run) at a rate that would have qualified for the London Olympics to get to the first tee to see Gary Player, Arnold Palmer and Jack Nicklaus. The coolest.5. British Open course rotation: I love that you know the nine course the British Open will always be played on. The Old Course, Turnberry, Carnoustie, Muirfield, Royal Troon, Royal St. George\u0027s, Royal Lytham and St. Annes, Royal Birkdale, Royal Liverpool.That\u0027s it, that\u0027s the list. Gary Van Sickle of Golf.com even once noted that he thinks the US Open should move to a smaller course rotation like the British Open.6. Emphasis on amateur golf: The is a general thing, I know, but I love how the US Amateur Championship is formatted and that they still play 36 holes to decide the champ. I also love that the Mid-Amateur champ and both finalists from the US Amateur make the Masters and the winner gets the US Open as well.It would be like the best players in college basketball getting invited to play in the NBA Finals. That would obviously never happen but it\u0027s pretty great that it does in golf.7. Masters Par 3 tournament: I know it\u0027s a little bit goofy but I don\u0027t think there\u0027s much cooler about the game than the wives and kids of these pros getting to caddie for them at the hallowed grounds of Augusta. One of my favorites.8. Ivor Robson: Need I say more?9. Everything else about the Masters I haven\u0027t mentioned: It\u0027s hard to do this list without letting the Masters just totally dominate it (I could a top 25 list on Augusta on its own).But the Sunday pin positions (and that we always know where they\u0027ll be), the cheap (and good) food, the badges, Amen Corner, the previous year\u0027s champ getting that No. 1 badge to wear the following year, the caddie jumpers, skipping the ball on No. 16 in practice rounds, Sergio Garcia\u0027s annual meltdown -- all of it is just spectacular.10. Sunday colors: Whether you like Tiger Woods or not, you always know what you\u0027re getting on Sunday with him. In fact, in the rare instances where there has been a rain delay or something else odd, social media has a collective meltdown over whether or not Tiger is going to wear red during his final round (he always does).Also, did you know Jack Nicklaus wore yellow on Sundays and why he did it?For more golf news, rumors and analysis, follow @EyeOnGolf and @KylePorterCBS on Twitter or Google+ and like us on Facebook.",
  "category": "GOLF"
}