{
  "url": "http://www.cbssports.com/golf/eye-on-golf/24116655/tiger-woods-might-consider-legal-action-against-golf-writer",
  "title": "Tiger Woods might consider legal action against golf writer",
  "data": "  Tiger Woods\u0027 offseason is off to a hot start. (USATSI) More Golf: Leaderboard | Rankings | Schedule | Expert Picks | Equipment | FedEx CupWell this Tiger Woods-Brandel Chamblee story certainly escalated rather quickly.Last week Chamblee ripped Woods on Golf.com and essentially called him a cheater for his questionable ball drop at the Masters and ensuing run-ins with various rules issues at the Players Championship and BMW Championship.At the end of the week Woods\u0027 agent Mark Steinberg took up for Woods and suggested that Tiger and his team would be proactive about the incident.\"There\u0027s nothing you can call a golfer worse than a cheater,\" Steinberg said. \"This is the most deplorable thing I have seen. I\u0027m not one for hyperbole, but this is absolutely disgusting. Calling him a cheater? I\u0027ll be shocked, stunned if something is not done about this. Something has to be done.\"There are certainly things that just don\u0027t go without response. It\u0027s atrocious. I\u0027m not sure if there isn\u0027t legal action to be taken. I have to give some thought to legal action.\"I\u0027m not really sure what the legal action would be here. Chamblee didn\u0027t actually say the words \"Tiger Woods is a cheater\" but he sure insinuated them as heavily as one could insinuate something.Steinberg went on to call Chamblee a troll and was, um, critical of his work.\"This is, \u0027Hey, look at me,\u0027 in its lowest form. Brandel Chamblee\u0027s comments are shameful, baseless and completely out of line. In his rulings, Tiger voiced his position, accepted his penalty and moved on. There was no intention to deceive anyone. Chamblee\u0027s uninformed and malicious opinions, passed on as facts, and his desperate attempt to garner attention is deplorable.\"Hooray, offseason!Also, a standing ovation to Geoff Shackelford for his hilarious work on what a Chamblee-Woods trial would look like.For more golf news, rumors and analysis, follow @EyeOnGolf and @KylePorterCBS on Twitter or Google+ and like us on Facebook.",
  "category": "GOLF"
}