{
  "url": "http://www.cbssports.com/golf/eye-on-golf/24116814/top-10-american-golfers-under-30",
  "title": "Top 10 American golfers under 30",
  "data": "  I would giggle like Webb Simpson, too, if I were that good. (Getty Images) More Golf: Leaderboard | Rankings | Schedule | Expert Picks | Equipment | FedEx CupAfter Webb Simpson easily staved off Ryo Ishikawa and Jason Bohn to win the Shriners Hospitals for Children Open on Sunday in Las Vegas, I started thinking about Simpson\u0027s career.American golf is in an interesting place right now. The sun is setting (and will be for a while) on the careers of Tiger Woods and Phil Mickelson. Several young golfers are jockeying for position to take their spots as the perennial Nos. 1 and 2 golfers in the US.Simpson is definitely part of that conversation but probably not at the forefront of it. You can throw out guys like Jason Dufner (he\u0027s almost older than Tiger!) and Matt Kuchar (ditto). I want to focus on the under-30 guys. The guys who have a really long landing strip for the remainder of their time on the PGA Tour.To my surprise there were actually 21 Americans under the age of 30 on the Official World Golf Ranking top 100 list. Here\u0027s my list of the 10 best, ranked.1. Dustin Johnson (29): Johnson has as many wins (nine) as Nos. 2 and 3 on this list combined. Throw in his six top 10s at the majors and he\u0027s an easy No. 1.2. Webb Simpson (28): One of only two golfers on this list with a major in hand (Keegan Bradley is the other). With his win in Vegas on Sunday he pulled ahead of Bradley in the wins department (four to three). Since both have a major, I have to give Simpson the edge.3. Keegan Bradley (27): I think when we look back at this list in 30 years (if the Internet still exists) that either Bradley or Jordan Spieth will have the most accomplished career.  4. Jordan Spieth (20): We can argue about whether or not he has accomplished more than Fowler (probably not) all day but he\u0027s certainly a better golfer right now. His career arc at age 20 is Tiger-esque.5. Rickie Fowler (24): I want to say that his career has been disappointing to this point but then I remember that he\u0027s just 24 (he has been on tour for four years!). I think the difficult part with Fowler is that his expectations were so high. Example: If Spieth has just one win four years from now, that\u0027s going to be pretty disappointing, isn\u0027t it?Fowler represents the line between the stars on this list and everybody else.6. Billy Horschel (26): 2013 was his breakout year with one win and a No. 13 finish on the money list. He has a chance to jump Fowler and maybe Spieth in 2014 with another big win.7. Gary Woodland (29): It\u0027s weird to rank a guy who won on tour this year so low but he won the Reno-Tahoe Open while the big guns played Bridgestone. He has two wins under his belt and made it to the Tour Championship. He only played one major (PGA Championship) and finished 74th. I think he\u0027s a shade below Horschel.8. Harris English (24): He has the best swing of anybody on this list. I still can\u0027t get over that he, Russell Henley and PGA Tour newcomer Hudson Swafford were all on the game team at Georgia.9. Roberto Castro (28): Probably the most unheralded guy on this list. He finished T12 at the PGA Championship and second to Bill Haas at the AT\u0026T National. Also scored a top 30 on the money list and made it to the Tour Championship. A name you might not know but should probably get familiar with.10. Russell Henley (24): Struggled a little after his win early in Hawaii. Only had two other top 10s and his best major finish was 73rd at the British Open.Best of the rest: Michael Thompson (28); Patrick Reed (23), Peter Uihlein (24); Brooks Koepka (23); Scott Stallings (28); John Huh (23); Luke Guthrie (23).For more golf news, rumors and analysis, follow @EyeOnGolf and @KylePorterCBS on Twitter or Google+ and like us on Facebook.",
  "category": "GOLF"
}