{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24137511/bison-dele-to-jerry-the-king-lawler-journey-down-the-rabbit-hole",
  "title": "Bison Dele to Jerry \u0027The King\u0027 Lawler: Journey down the rabbit hole",
  "data": "  Bison Dele to Jerry Lawler is easier than you might imagine the journey would be. (USATSI)Ladies and gentlemen, I\u0027d like to announce that this is the final rabbit hole post... before the regular season begins. Ha! You probably thought you were getting out of thumbing through these on Fridays when you were skirting your responsibilities at work but you\u0027re not that lucky. These will continue to happen every Friday throughout the year. It\u0027s not like either of us have anything better to do right now anyway, right? Today\u0027s journey down the NBA rabbit hole takes us from a wonderful story about a man who renamed himself Bison Dele through some fantastic point guards and to the world of wrestling. You ready to take the trek? Let\u0027s do this:First stop: An incredible read on Brian Williams, a.k.a. Bison DeleI\u0027ve been engrossed in few things that I\u0027ve read this year like I was when I looked at Chris Ballard\u0027s long form look into the life of former NBA player Brian Williams. Some of you younger kids may remember a guy named Bison Dele; they\u0027re the same person. Dele was an unbelievably talented big man that had one of the strangest journeys you can imagine for an NBA player, let alone a human being. Which is what makes it so interesting in hindsight. Pull up the NBC footage and you can see the 28-year-old Williams on the stage behind Jordan, those pale green eyes staring over MJ\u0027s shoulder as the Bulls celebrate. This was Williams\u0027s first title, but you wouldn\u0027t know it. During what should have been the highlight of his professional career he looked distant, unsmiling, almost disembodied.Friends recalled that look two years later when, after Williams changed his name to Bison Dele to honor his Cherokee and African heritage, he walked away from the remaining five years and $36.45 million of his contract with the Pistons. No one could believe it. Who walks away from $36 million?The scene Ballard paints about the championship celebration in which Williams seems to be staring off into the distance, not really celebrating his first NBA title can be seen here (4:48 mark):If you started the video from the beginning, you probably noticed this thing from Michael Jordan as he\u0027s celebrating a fifth NBA championship.Not 6, not 7, not 8...Back to Ballard on Williams, he was just a different type of guy that almost seemed tortured by not being able to explore the world and experience as many different things in life as possible. You start to get an understanding of why NBA basketball wouldn\u0027t be enough to quench his thirst for life:NBA teammates remember Williams as a strange bird. He kept his distance, reading on plane rides while others played cards. In a league where money trumps all, he asked the Pistons to split his playoff share among ballboys, janitors and trainers. He once teared up while reading a biography of Miles Davis and told teammate Tom Tolbert that he wished he had the passion for basketball that Davis had for music. Another time, Williams\u0027s Detroit teammate Grant Hill asked him what book he was reading in the locker room. “The Tarahumara,” said Williams, looking up from the academic text on the remote Mexican tribe. After practice in Denver once, the team found Williams in McNichols Center, where the ice had been laid down for an upcoming hockey game, joyfully gliding around on size-17 skates.“He was perceived as an athlete first but he had an artist\u0027s heart,” says Tommy Sheppard, then the media-relations director for the Nuggets and now the Wizards\u0027 senior vice president of basketball operations. “I learned something from him which I\u0027ve kept with me to this day: Don\u0027t let your job define who you are.” Because Williams was so smart and charismatic, Sheppard says, people were often jealous of him. Back then, Sheppard had a description for Williams\u0027 approach to life: “He walked between the raindrops.”There is so much more to this story than the few excerpts I\u0027ve provided for you and it\u0027s really worth your time to power down the cell phone, turn off the television, and dig into this incredible piece of writing. I wouldn\u0027t go crazy and stop reading this post! Much like Latrell Sprewell, we all have kids to feed here (note: I don\u0027t have kids) but when you\u0027re done with your journey here, you should escape from distractions and really sink your teeth into Ballard\u0027s fine work.If you\u0027re interested in a Bison Dele mix, go here. If you\u0027re interested in a Brian Williams mix to Mobb Deep\u0027s \"Shook Ones, Pt. II\" then here you go (a little NSFW because of \"edited\" language that you can still make out the words):Those Arizona point guards of yesteryearBrian Williams was one of the key players for those late 80s, early 90s Arizona Wildcats teams. They were loaded with NBA talent. Brian Williams, Sean Rooks, Chris Mills, Khalid Reeves, and Ed Stokes bridged the gap between those Steve Kerr-Sean Elliott years and Damon Stoudamire\u0027s time in the program. Before Williams attended Arizona, he spent a year at Maryland. Before Maryland, he was in the 1987 McDonald\u0027s All-American dunk contest:At the 3:09 mark of the video, we see Williams make his only appearance. I can\u0027t tell if he\u0027s trying to jump over his teammate or if he\u0027s just trying to put him on a poster during the dunk contest.Thinking of those Arizona Wildcats teams, it\u0027s hard not to think of the series of top point guards this program had:  People seem to only think of Steve Kerr as a spot-up shooter, but back in his college days he did a lot of typical point guard duties. He wasn\u0027t going to remind anybody of Mark Price or Kenny Anderson, but he certainly had a lot more to his game than just waiting for someone to pass him the ball. 25 years later, he\u0027s a five-time NBA champion. Not bad for a kid without a scholarship offer coming out of high school:It\u0027s weird how his voice has not changed one bit. He also doesn\u0027t look that much older than he does now. It\u0027s possible Steve Kerr doesn\u0027t age, like a vacuum-sealed pack of gummy bears.Jason Gardner is a forgotten college point guardThe video of Arizona point guards gave me a reminder that there was a time in which I thought Jason Gardner was a sure-fire NBA point guard. I wasn\u0027t positive he\u0027d be a definite starting point guard in the NBA, but I was almost certain he\u0027d be one of the better backup point guards we could see in the league. When he wasn\u0027t drafted in 2003, I was shocked. Gardner was a player after my own heart; he loved to jack up 3-point attempts. He took 1,446 shots in four years at Arizona and 875 of them were 3-pointers. Unfortunately, there really aren\u0027t any dedicated mixtapes for Gardner\u0027s time at Arizona. There\u0027s this one (music NSFW) for the 2000-2001 Arizona team (featuring Gardner, Gilbert Arenas, Richard Jefferson, and Loren Woods). My favorite highlight from Gardner\u0027s time in college was this alley-oop pass. That\u0027s Gilbert Arenas with the lob to Jason Gardner, who then throws the lob to Richard Jefferson.Looking up Gardner highlights got me wondering what happened to him. Looking back, he was a 5\u002710\" point guard that many probably thought was too small for the NBA. I wonder with someone like Isaiah Thomas being so successful today, he\u0027d have a better shot for being a spark plug off the bench. Regardless, Gardner spent his career overseas and even had this memorable highlight while playing for Oldenburg in Germany.We need Duke Tango out here screaming, \"Oh baby! Ooooooooooooh baby!\"Damon Stoudamire was a wrecking ball early onDamon Stoudamire was probably my favorite Arizona point guard to come out of there in the last 20 years. Back in his Toronto Raptors days, he won the Rookie of the Year award over guys like Kevin Garnett, Rasheed Wallace, Joe Smith, Antonio McDyess, Jerry Stackhouse, and Bryant Reeves. He ran away with the award averaging 19.0 points and 9.3 assists in rookie season. Arvydas Sabonis finished second on voting, although he was 31 years old at the time.There\u0027s another solid mixtape for Stoudamire here. But that one didn\u0027t have Lil Scrappy rapping, \"I\u0027m so gangsta; I eat cereal out the milk,\" so you\u0027re welcome. Stoudamire\u0027s game was pretty incredible and people were blown away at such a small guy being able to create so many shots for himself. He had a lethal hesitation move that left defenders pretty helpless as they waited for what was coming next. He was like a pitcher switching up the delivery time of his pitches to throw off a potential base stealer on first.One of the greatest box score lines in NBA history was the time Stoudamire scored 54 points for the Portland Trail Blazers. 54 points on 32 shots. As impressive as it is, it\u0027s even crazier to think he had just one assist, no rebounds, no steals, and three turnovers in that game. He just caught the ball and hoisted up a shot; he didn\u0027t really do anything else. Be still Nick Young\u0027s heart.How did he end up in Portland? Initially, the Raptors tried to trade Stoudamire to the Houston Rockets, but it didn\u0027t go through.The trade would have been Stoudamire, Walt Williams, and Zan Tabak to the Rockets in exchange for Mario Elie, Matt Maloney, and the Rockets\u0027 1998 first round pick (ended up being Michael Dickerson). From TexNews.com:At Toronto\u0027s morning practice, Stoudamire, the 1996 rookie of the year, refused to discuss a possible deal.\"I don\u0027t have any thoughts about it,\" coach Darrell Walker told The Canadian Press. \"Management\u0027s got to do what management\u0027s got to do.\"He added: \"Nobody wants to lose Damon Stoudamire and Walt Williams, but I have nothing to do with it. I\u0027m going to coach the guys that come here.\"Way to throw Zan Tabak under the bus there, Darrell Walker.What\u0027s interesting is Dickerson was later involved in another point guard looking to get out of Canada when Steve Francis was traded by the Vancouver Grizzlies. Eventually a deal to Portland got done and Stoudamire seemed pretty happy:Glen Grunwald really added to the Raptors\u0027 title chances by bringing in Kenny Anderson, Gary Trent, Alvin Williams, and two first round picks that were used on Mirsad Turkcan and Bryce Drew (both later traded to the Rockets for Kevin Willis). Thankfully, Glen Grunwald isn\u0027t around running a team anymore. When guys like that are trying to build title conten... OH I\u0027M SO SORRY, KNICKS FANS!(FYI: If you\u0027re interested in a 33-minute video of Damon Stoudamire from his senior year at Arizona, this is the link for you.)Mighty MouseDamon Stoudamire had a Mighty Mouse tattoo, which helped earn him the nickname \"Mighty Mouse\" when he was making his way through NBA defenses. It led to a pretty incredible commercial in which the Mighty Mouse cartoon was flying about as Stoudamire highlights played. Seriously, Nike had the best commercials, probably still do.Start looking up Mighty Mouse news and you\u0027ll come across the fact that they\u0027re making a movie that\u0027s supposed to be out in 2013:The LA Times reports that Paramount Pictures, via its Nickelodeon Movies off-shoot, is keen to get the little fella in a full-length feature film, following the success of Alvin and the Chipmunks and its so-called ‘Squeakquel\u0027.Cousins Brian and Mark Gunn (whose only major writing credit includes an untitled sequel to Journey to the Center of the Earth) have had a crack at a script, but Paramount is apparently keen to see what a new writer can come up with.A brainchild of Isadore ‘Izzy\u0027 Klein, the character was originally Super Fly (meaning he was a super-powered housefly and not a fictional cocaine-dealer from the early \u002770s), but morphed to Super Mouse after Terrytoons boss Paul Terry decided a mouse was more appealing.Considering we\u0027ve got roughly two months left in 2013 and there isn\u0027t any more information other than this post from three years ago, I\u0027m going to guess there was a snag in production. At least from that link you get a cool little history lesson about Mighty Mouse.Can\u0027t think of Mighty Mouse without Andy KaufmanI can\u0027t think of Mighty Mouse without thinking immediately about Andy Kaufman because apparently I\u0027m a 50-year old man trapped in a 31-year old man\u0027s body.This was part of the genius of Kaufman, as depicted in that Jim Carrey movie from years ago. He would take the littlest, most inconsequential thing and find a way to make people laugh at it. I have no idea if it was actually funny, but he sold it in a way that let his projected nervousness and awkwardness take over the moment. Jerry Lawler vs. Andy KaufmanYou probably can\u0027t think of Andy Kaufman without thinking of the time he wrestled Jerry \"The King\" Lawler, whilst repeatedly getting into it with him on David Letterman\u0027s show (Company man note: You can watch \"The Late Show with David Letterman\" weeknights on your local CBS affiliates; check local listings for exact times). I just had an epiphany. The Memphis Grizzlies fans hate the Los Angeles Clippers after meeting against them in the last two playoffs. When they first squared off in 2012, I had a bevy of Grizzlies fans making fun of how \"Hollywood\" the Clippers were and how they were actually tough like the Grizzlies. I found it weird that there was so much resentment between two teams that didn\u0027t really have much of a history against each other.Now it\u0027s all coming together. Kaufman was screaming about the locals in Memphis decades ago, implanting seeds of resentment toward Hollywood and Los Angeles long before these teams ever became playoff foes. The Andy Kaufman legacy continues to live on.Jerry Lawler rides a fireworkThis video is exactly what the sub headline says it is. I don\u0027t think it needs any more of a setup than that for you to click play.Have a great weekend, everybody. ",
  "category": "SPORT"
}