{
  "url": "http://www.cbssports.com/general/eye-on-sports/23381943/no-1-serena-no-7-federer-ease-into-third-round-at-us-open",
  "title": "No. 1 Serena, No. 7 Federer ease into third round at US Open",
  "data": "  Serena Williams is one match away from a showdown with Sloane Stephens. (USATSI) With no rain to delay the match any further, No. 1 Serena Williams had little trouble dispatching 77th-ranked Galina Voskoboeva in straight sets, 6-3, 6-0 on Thursday to advance to the third round of the US Open. More US OpenComplete coverage from Flushing Meadows It wasn\u0027t quite as dominating a performance from the defending champion as she displayed in her first-round win (6-0, 6-1), but Williams won the final eight games on Thursday afternoon, quickly dispelling any chance of a massive upset at Arthur Ashe stadium.\"Galina played really well, especially in the first set, she was hitting winners, but overall I think I did pretty well. I\u0027m gonna have to think about it and see what I can do better, but it was OK,\" she said following the match. Like most of Serena\u0027s opponents, Voskoboeva struggled to combat the four-time Open winner\u0027s power. Serena averaged over 100 MPH on her first serves, topping out at 120 MPH at one point. The most telling stat, though, was Williams\u0027s efficiency in break points, where she converted on 5-of-7 opportunities.Williams moves on to face Yaroslava Shvedova of Kazakhstan in the third round. With a win, she\u0027ll have done her part to meet No. 15 Sloane Stephens, a fellow American, whom she lost to earlier this year at the Australian Open.That match could present one of the few obstacles impeding her chance at a repeat title.   Roger Federer won his second-round match in just over an hour and a half. (USATSI) Roger Federer eases into third roundIf five-time Open champion Roger Federer was peeved about his No. 7 seed – his lowest ranking at the tournament in more than a decade – he wasn\u0027t showing it on Thursday in Flushing Meadows, New York. Instead, the Swiss great was in complete control, showing his patented consistency, as he took down Argentina\u0027s Carlos Berlocq in straight sets 6-3, 6-2, 6-1. It was the second time Federer had beaten the 48th-ranked Argentine head-to-head.For comparison\u0027s sake, No. 6 Juan Martin Del Potro struggled through his opening-round match on Wednesday, eventually beating Guillermo Garcia-Lopez in four sets, three of which each ran longer than an hour. Federer, in contrast, has polished off his first two rounds in a tidy three hours and eight minutes total.Federer improved his career record to 66-8 at the US Open (tied for fifth all-time) on the strength of six aces and 37 winners, while Berlocq managed just one and 17, respectively. “I do feel very much at home here,” Federer said of the year\u0027s final Grand Slam major. “I\u0027ve had some amazing experiences here on this court and in this city. I love to play here.” Federer, of course, won the Open five-straight years from 2004-2008.He\u0027ll move on to face the winner of No. 26 Sam Querrey, an American, or France\u0027s Adrian Mannarino. Not to look too far ahead, but Federer sits two matches away from a quarterfinal meeting against No. 2 Rafael Nadal. “I didn\u0027t even know he was in my quarter … no I\u0027m kidding,” Federer said after Thursday\u0027s win. “I\u0027m not one of those guys that doesn\u0027t look at the draw. I\u0027m very well aware of what\u0027s going on. Right now, I\u0027m trying to focus round by round. The biggest mistake I can do now is focus on Rafa right now and then you lose the next round.”   Victoria Azarenka rolled into the third round on Thursday. (USATSI) No. 2 Azarenka advances to third roundIt wasn\u0027t nearly as clean or dominant as the 6-0, 6-0 win that No. 2 seed Victoria Azarenka earned in her first round triumph at the US Open, but she reaffirmed on Thursday why she\u0027s still the most serious candidate to dethrone defending champ Serena Williams. Azarenka won the first five games against Canada\u0027s Aleksandra Wozniak (stretching her winning streak to 17-straight games) before the 323rd-ranked player stole the next three games, temporarily unsettling last year\u0027s runner-up. But Azarenka regrouped and took the first set 6-3 before closing out Thursday\u0027s second-round match with a 6-1 victory at Louis Armstrong Stadium. The most glaring difference between the two was that Wozniak hit into 35 unforced errors, 16 more than the two-time major winner.Azarenka will take on France\u0027s Alize Cornet, the No. 26 seed, in the third round. ",
  "category": "SPORT"
}