{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24132631/derrick-rose-has-no-restrictions-or-limitations-for-the-season",
  "title": "Derrick Rose has no restrictions or limitations for the season",
  "data": "  Derrick Rose has no restrictions. (USATSI) Derrick Rose has looked simply fantastic during the preseason. Outside of one little hiccup with some knee soreness, he has looked like his old self with the athleticism, the explosiveness, the strength and the finishing ability at the rim. And because of it, the Bulls are taking the training wheels off. Via ESPN Chicago, Bulls vice president John Paxson said the team has no plans to limit or monitor Rose\u0027s minutes.\"We\u0027ve turned the page,\" Paxson said on \"The Waddle \u0026 Silvy Show\" on ESPN Chicago 1000. \"Unless he would come up with something that would concern us, but we have no concerns right now. You look at his preseason, and I think [coach] Tom [Thibodeau] has done a really nice job of kind of amping up his minutes. He\u0027s played six games. In reality he is only averaging about 27 minutes a game in this preseason and he has looked terrific. Right now there is no reason to think that there will be any restrictions, and we\u0027re not anticipating that at all.[...]\"Look, Derrick wants to play. He\u0027s been out for an entire year,\" Paxson said. \"He\u0027s showing no signs that would make us think along those lines. Tom has a good gauge of these things and we\u0027re all confident that we\u0027re beyond that. He\u0027s got to push himself. Let\u0027s face it, he spent a lot of time and effort into rehabbing this knee. ... He\u0027s not coming to us to put any limitations on him. As an organization we don\u0027t want him playing 48 minutes a night -- that\u0027s not going to happen, of course -- but in that 35- to 38-minute range, that\u0027s what he was going to do anyway, and I don\u0027t see that changing.\"In 2011-12 -- the last full season for Rose -- he averaged 35.3 minutes. The season before that, when he won MVP, he averaged 37.4 minutes. So playing between 35 and 38 minutes a game is pretty much the norm for Rose, but he is of course coming back from an ACL injury that caused him to miss last season in its entirety. Rose has held up well in the preseason, scoring 19.7 points a game, but has upped that to 27.3 over the past three.\"He has been fearless,\" Paxson said. \"The way he has attacked the basket, his ability preinjury to change speed in real tight spaces like he showed [against the Thunder on Wednesday] with some of those crossovers and sidesteps past defenders, those are things that he had prior to the injury, and he has obviously shown that and more here in the preseason. The fact that he feels the confidence in this knee that you can just see out there on the floor, that\u0027s a great sign for him.\"The fearlessness is an excellent sign for the Bulls, because so much of Rose\u0027s hesitation to return last season was based around evident mental struggles of playing with confidence in his knee. But Rose isn\u0027t playing with any kind of worry or anxiety and is as aggressive as ever. Which means Derrick Rose isn\u0027t just back. He\u0027s back.",
  "category": "NBA"
}