{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24137324/steve-nash-still-limited-in-practice-team-concerned-about-his-status",
  "title": "Steve Nash still limited in practice, team concerned about his status",
  "data": "  There are concerns about Steve Nash\u0027s health. (USATSI) You\u0027re starting to truly worry that the window for Lakers guard Steve Nash may have closed. Nash missed much of last season with first a leg fracture and then complications of his degenerative back condition. He\u0027s 39, and like many players, leaving behind the strange magic the Suns trainers practice seems to have impacted his durability. It\u0027s an issue the Lakers are concerned about, ESPNLA.com reports, and in fact, Nash hadn\u0027t gone through a full practice until Thursday \"Steve hasn\u0027t been able to complete a practice yet, so that\u0027s the bigger issue,\" Gasol said of Nash, who is averaging just 3.5 points and 3.5 assists in 16.7 minutes per game in the preseason, sitting out one of the exhibition games altogether. \"I\u0027m a little bit concerned because I want him to be healthy, I want him to play. I want him to play and I want him to do well. I want him to help us. I hope that he can.\"(Coach Mike) D\u0027Antoni said Nash was able to make it through a full practice Thursday but cautioned that he could hold Nash out of the preseason finale Friday in Anaheim.\"It\u0027s a different stage in my career,\" Nash said. \"I used to be able to get out, run up and down and feel like a world-beater every day, and now I have to try and get myself into some sort of form to try and execute for my team. It\u0027s a different frame of mind. It\u0027s a different challenge, but like I said, I\u0027m up for it. I\u0027m positive about it, I feel optimistic, I\u0027m inspired by my teammates and I\u0027m going to keep pushing through.\"via Nash\u0027s status starting to cause concern - Los Angeles Lakers Blog - ESPN Los Angeles.None of this makes you feel good about how consistently Nash is going to be able to play, at all, for the Lakers. This is not a question of minutes, this is whether he\u0027ll be able to go game-by-game. D\u0027Antoni has already said Nash will sit \"on and off\" this season.Nash will do everything he can, but with a back condition that everyone has known was going to be more and more of a problem for him, and at age 39, there comes a breaking point. Maybe it\u0027s not this season. But you can see it from here. And that\u0027s bad news for the Lakers, who need him in order to contend for a playoff spot this season. ",
  "category": "NBA"
}