{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24132917/eob-nba-division-previews-central-division",
  "title": "2013-14 EOB NBA Division Previews: Central Division",
  "data": " The Central Division gets back one of its biggest stars in Derrick Rose. (USATSI)Our team-by-team win predictions | Podcast: East over/unders | West over/undersEast previews: Atlantic | Central  West Previews: Southwest | NorthwestCream of the Crop: Do I think the Chicago Bulls are definitively better than the Indiana Pacers? No, I can\u0027t say that for sure, yet. I need to see it. And not just in an \"anything can happen\" way. I have a strong suspicion that by season\u0027s end, the Bulls and Pacers will look like equal foes, and it may take a 2-3 second-round matchup to settle who\u0027s the real king of \"ugly ball.\"But the Bulls have Rose, and the Bulls are a team that racks up regular season wins like that dude that runs the shuffleboard table every weekend scamming tourists. Tom Thibodeau has coached Derrick Rose for a full season twice, and in those two seasons, they won at a 62-game pace each time (one was the lockout-shortened season). They run the regular-season win-total score up, far more effectively than Indy does.So the Bulls go up here. I started off in August thinking this team wasn\u0027t as talented as the 2011 team that made an Eastern Conference Championship run. Now, I\u0027m not so sure. They have better offensive weapons and the same defensive presence. Health will be the question, not just with Rose but Joakim Noah and Luol Deng and the rest. But the Bulls are back, and they should be feared as such.Sitting Pretty: All season long, I felt that the Indiana Pacers were the second-best team in the East last year. The whole year. They got off to a rough start in part due to Roy Hibbert\u0027s wrist injury and trying to adjust without Danny Granger. But when they got settled, man, they just hammered teams. The Knicks stole the headlines, the Pacers became the better team.And yet I picked the Knicks over the Pacers in the second round last year. I can forgive myself for Nuggets over Warriors (who saw Andrew Bogut getting healthy?) and Nets over Bulls (it was a coin flip series), but man, Knicks-Pacers I\u0027m still kicking myself over. Because make no mistake. This Pacers team is worthy of the hype they never get and a far more dangerous playoff team than they are during the 82.Roy Hibbert, Paul George, David West (Assassin\u0027s Creed!), George Hill, Danny Granger, Luis Scola, Lance Stephenson, Ian Mahinmi, their roster is loaded with guys who step up when called upon. Their defense is ferocious, and their offense surprisingly found itself in the last two rounds. Maybe Indy won\u0027t win the Central. But you had better believe that in the gaggle of sub-contenders outside of Miami, they are as tough as anyone else.On The Cliff: I cannot contain my excitement about the Pistons. They are going to be such a wonderful combination of genuinely good and hilariously goofy.Josh Smith became so overrated on account of how underrated he was that a backlash formed and now he is underrated again. Brandon Jennings has a lot of flaws, I mean, a lot of flaws, but he\u0027s also never played somewhere he didn\u0027t feel like he had to do everything.Can people please remember how good Greg Monroe is, offensively? Please?Andre Drummond is a beast.Their backup point guard is only seven years younger than Ice Cube. Their starting shooting guard has one of the longest names in the league. They have a guy named Gigi for crying out loud.They could spiral into oblivion, rise up over the horizon and taste sweet playoff air, and then nosedive into the canyon again. Get your popcorn people.Waiting in the Tall Grass: Kyrie Irving is due.I mean, that guy has a monster season coming to him. He didn\u0027t get to have the team around him to allow him an early playoff run. Instead he\u0027s suffered the indignity of a team with too little talent and massive injuries. But that could all change.There\u0027s a reason why executives are so high on Irving. Why writers are so high on him. He has that ability to take over a game the way few players can. And he has a vicious killer instinct. You put that guy in playoff atmosphere? Look out. He\u0027s just got to get there.Andrew Bynum is apparently going to play, or something. We\u0027ll see; I can\u0027t believe it until it happens and even then I\u0027ll have to check to make sure it\u0027s not a 2K Sports simulation. Varejao was going to be an All-Star last year before the basketball gods resumed their torture of his body.And Anthony Bennett looks really great except for having asthma and sleep apnea and being out of shape from shoulder surgery.But the talent is there. If they can just get a little luck, just a bit, just a sliver, they can snag the 7th or 8th seed. And then Irving gets a shot at the playoffs and we all get the show we\u0027ve been waiting for.Dead Meat: The Bucks. They\u0027re the Bucks. You know the deal. They\u0027re OK. Brandon Knight has moments of being good when DeAndre Jordan isn\u0027t killing him and Kyrie Irving isn\u0027t crossing him over. O.J. Mayo can score if his coach can put up with him. Giannis Antetokounmpo looks really interesting, Larry Sanders (LARRY SANDERS!) is good, and Ersan Ilyasova is underrated.They probably won\u0027t be terrible, they just won\u0027t be worth saying anything meaningful about. But there are worst teams to catch for those February Tuesday games on league pass. They\u0027re not so much dead meat as heavily sedated.Division MVP: Derrick Rose.I hate not putting David West or Roy Hibbert on here. The Pacers really don\u0027t get enough attention, and a lot of that is because big market superstars soak up too much.But come on.Rose looks back, like way, way back and better than ever before. He has a team to support him and draw attention. He may have learned from his experience to avoid contact a little more. He\u0027s a better player now than then, from the looks of it.Hibbert and West and Paul George are all fantastic players who help make the Pacers a beast. But no one in this division takes over a game like Derrick Rose when healthy. He\u0027s just too... oh, you know.Division ROY: Lot of good candidates here, no joke.Anthony Bennett looks lik he\u0027s wheezing if he runs more than five minutes at a time, but the extra bulk actually helped him bully some players in preseason. He\u0027s got great touch and a back-to-the-basket game. If he becomes the go-to scoring forward and Varejao moves to the bench (if Bynum gets healthy) that makes the Cavs crazy good and deep in the frontcourt with Tristan Thompson. Will he get enough touches, though?Kentavious Caldwell-Pope (KCP) has shown lightning shooter\u0027s touch. The question of touches is of course still the biggest question just like with Bennett, even more so on that team. But if he\u0027s knocking down kick-outs as the defense swarms Jennings and plays to the pick and roll with Andre Drummond? KCP could be wide open and light up teams.Giannis Antetokounmpo came in, and because none of us can pronounce his name, kind of passed into \"whatever mode.\" The kid has shown so much more diversity in his game than I expected. No telling how it plays out for him, but the skill is there for him to fill up the stat sheet.Outside shots: Sergey Karasev, Tony Snell, Gigi Datome, Solomon HillProjected finish:1. Chicago Bulls 58-242. Indiana Pacers 53-293. Cleveland Cavaliers 40-424. Detroit Pistons 38-445. Milwaukee Bucks 30-52",
  "category": "SPORT"
}