{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24137461/eob-nba-division-previews-northwest-division",
  "title": "2013-14 EOB NBA Division Previews: Northwest Division",
  "data": "  Kevin Durant will need to be really, really good this year for OKC. (Getty Images) Our team-by-team win predictions | Podcast: East over/unders | West over/undersEast previews: Atlantic | Central  West Previews: Southwest | NorthwestCream of the Crop: Oklahoma City Thunder. They\u0027ve owned this division the last three years. And they will continue to own it. Yes, they lost their third-leading scorer for a second straight season. Yes, Russell Westbrook is coming off knee surgery and will miss the first 4-6 weeks of the season. Yes, there are questions about their bench. But none of those things will prevent them from winning their division, and probably by a wide margin. The question is: Can they wrap up the Northwest by late March? Here\u0027s the thing with the Thunder this season: Kevin Durant just turned 25. And he\u0027s getting anxious. Last season, he went into otherwordly levels of efficieny, shooting 50-40-90 while nearly leading the league in scoring. Where is he going next? He\u0027s shown the ability to become more of a playmaker and he\u0027ll need to be with the absence of Westbrook. The Thunder have the world\u0027s second best player, and when you hold that crown to LeBron James, it\u0027s like being the world\u0027s best player in most other eras. The Thunder will need production from some unknowns like Jeremy Lamb and maybe rookie Steven Adams. But Reggie Jackson proved to be a more than capable player in Westbrook\u0027s place in the postseason, and if he continues to blossom, they may have another bench star in the making. Sitting Pretty: Denver Nuggets. After the Thunder, it\u0027s kind of a mess. I have no idea what to make of the Nuggets. This is a team that won 57 games last season and lost their best defensive player, their coach, their GM and their best scorer is coming off an ACL injury.Last season, they were a trendy upset pick in the West, but after bowing out to the Warriors and the upheaval of the offseason, perception has changed about them. They\u0027ve now become the \"if\" team in the division. If Ty Lawson can be the man, if JaVale McGee can start realizing his potential, if Kenneth Faried can continue to grow, if Danilo Gallinari can come back strong, if J.J. Hickson can help inside -- if the answers to those questions are yes, then the Nuggets can win 50 games. If the transition from George Karl to Brian Shaw doesn\u0027t go smoothly and Lawson isn\u0027t capable of running the show in a halfcourt style and McGee flames out and Faried doesn\u0027t excel in this system and Gallinari isn\u0027t the same -- then it could be trouble. So as you\u0027ll see, I\u0027ve got them picked for 39 wins, which puts them fourth in the division. But at the same time, they could prove to be a playoff lock by December. I\u0027m so confused.On The Cliff: Portland Trail Blazers. It\u0027s hard not to look at the Blazers and see them improving drastically this season. This was a team that while they finished 33-49, they were 25-25 on Feb. 8 and squarely in the playoff conversation. On March 22, they were 33-36 and still in it. But they lost 16 straight to finish the season which probably was a product of their historically horrific bench finally catching up to them. They\u0027ve taken steps to rectify the second unit, adding C.J. McCollum in the draft, Dorell Wright and Mo Williams in free agency, and Thomas Robinson and Robin Lopez via a trade. They have the Rookie of the Year Damian Lillard coming back to improve on his stellar debut season, they have an All-Star power forward in LaMarcus Aldridge and they have an outstanding 3-and-D guy in Nicolas Batum. The pieces appear to be there, but it\u0027s hard to know how players will respond in their second seasons and there are trade rumblings around Aldridge. The Blazers could win 50 games and reach a seed as high as six. Or they could fizzle and finish 10 games under .500. Hard to figure right now.Waiting in the Tall Grass: Minnesota Timberwolves. Does anyone remember how the Timberwolves were kind of good during the 2011-12 season, and before Ricky Rubio\u0027s knee injury, were in the playoff conversation? They were even competitive last season despite going 31-51, even with Kevin Love\u0027s injury problems and Rubio slowly regaining form. Now Love is healthy, Rubio looks fantastic, they added a terrific wing scorer in Kevin Martin, Nikola Pekovic is turning into an elite big and they\u0027ve got J.J. Barea as their jitterbug bench pop. Isn\u0027t this a playoff team? The problem with the Wolves is that they haven\u0027t been able to prove anything yet. While Love can be one of the five most productive players in the league, he hasn\u0027t really won yet. Same goes for Rubio and Pekovic. Rick Adelman is one of the best in the business so having him in charge counts for something and while the Wolves look dangerous, they may not be entirely there yet.Dead Meat: Utah Jazz. It\u0027s going to be a rough season in Utah. The front office finally pulled the plug on the Al Jefferson-Paul Millsap frontcourt, relieving the log jam that\u0027s held up Derrick Favors and Enes Kanter\u0027s development. The Jazz are going with a youth movement type of thing and while there are nice pieces in place -- like Gordon Hayward and Alec Burks -- their bench is atrocious and they don\u0027t currently have a point guard because of Trey Burke\u0027s injury. It will be a struggle for Utah to win 30, unless Favors and Kanter are better than expected and Hayward shows he can be a featured player. And even still, that probably only means 35. Division MVP: Kevin Durant. You know, if you wanted to get cute with this, you could say Russell Westbrook. You know, considering how the Thunder stumbled in his absence last postseason and how that clearly illustrated Westbrook\u0027s importance to the team. But that\u0027s making the assumption they wouldn\u0027t have struggled the same way without Durant if the roles were reversed. So we\u0027re going with \"Pick the best player\" rule, and that\u0027s Durant. Do you want me to gush? Because I can. Nah, I\u0027ll just leave it at this: He\u0027s pretty good. Division ROY: Trey Burke. The Northwest has unfortunately already been bitten by the injury bug with both Burke and Portland\u0027s C.J. McCollum set to miss the beginning of the season. But Burke will have the most significant role and was a trendy pick by a lot of people to win the actual Rookie of the Year, before he was injured. He\u0027s not going to miss that much of the season and assuming he can get his feet under him, he could have a pretty nice season. Dark horse candidate? Steven Adams. He\u0027s looked outstanding in the preseason and while it\u0027s unlikely he\u0027ll supplant Kendrick Perkins as the starter in OKC, he could see 20-25 minutes a game anyway. And at the rate he was scoring and pulling in rebounds, that could be good enough for an 8-and-8 average, which would be pretty impressive.  Projected finish:1. Oklahoma City Thunder 56-262. Minnesota Timberwolves 44-383. Portland Trail Blazers 43-394. Denver Nuggets 39-435. Utah Jazz 27-55",
  "category": "SPORT"
}