{
  "url": "http://www.cbssports.com/golf/eye-on-golf/24102959/best-golfers-of-2013-who-didnt-win-a-tournament",
  "title": "Best golfers of 2013 who didn\u0027t win a tournament",
  "data": "  Steve Stricker easily had the best 2013 of all golfers who didn\u0027t win. (USATSI) More Golf: Leaderboard | Rankings | Schedule | Expert Picks | Equipment | FedEx CupHere is a list of golfers who won tournaments in 2013:Derek ErnstRussell HenleyMichael ThompsonScott BrownKen DukeJohn MerrickNone of these is exactly a household name. Good golfers, for sure, but nobody who is going to make a Ryder Cup team any time soon.I think sometimes we like to look at the PGA Tour season and point at the 40 or so tournament winners and say, \"These are all the guys who had great years.\"The reality is that tons of elite golfers post top fives and top 10s all season and, for whatever reason, never seal the deal on a win. I wanted to take a look at the 10 best golfers of the 2013 PGA Tour season who didn\u0027t hoist trophies.1. Steve Stricker: The fight for the top spot on this list wasn\u0027t even close. Stricker had eight top 10s, four (!) second-place finishes and made more money than two of the four major winners. He did all of this despite only playing 13 times all season. Other than Tiger Woods, Stricker easily had the most efficient season on Tour.2. Keegan Bradley: Of the 12 golfers on the US Presidents Cup team, only Stricker, Bradley, Webb Simpson and Hunter Mahan didn\u0027t win this season and Bradley was the next best behind Stricker. He finished second at Bridgestone (where Tiger rolled) and, despite shooting a 60 at the Byron Nelson, finished tied for second there behind Sang Moon Bae. Bradley was the one who it surprised me most that he didn\u0027t walk away with a W. I would wager a lot of money he\u0027ll get one this season.3. Jason Day: Day made $3.6 million and somehow, for the fifth time in six seasons, didn\u0027t win on the PGA Tour. His situation confounds me. He\u0027s not known as a fader or a choker or anything like that but he just can\u0027t seem to get over the hump. His lone win remains the 2010 Byron Nelson Championship.Most Memorable ShotsJim Furyk\u0027s 59 at BMW Championship 4. Jim Furyk: Furyk did have one of the 10 most memorable shots of 2013 when he sank his putt for 59 at the BMW Championship. But the best the 16-time winner could muster was a second place (albeit at the PGA Championship).5. Hunter Mahan: He probably wouldn\u0027t be on this list if his newborn baby would have stayed inside the womb a few more days but he eschewed a potential Canadian Open win in favor of being there for her birth (the right choice, by the way).The closest he got all year was a second-place finish at the World Golf Championship. He finished top 10 at the US Open and British Open though, thus the top-five spot here.6. Lee Westwood: Westwood had a really solid season. Six top 10s in 18 starts, including three top 15s at the majors. His season will be remembered for not winning a British Open he led after three rounds but he was strong all year.7. Graham DeLaet: I think I picked DeLaet, like, 14 times in my Expert Picks by the end of the season. He had a stretch where he had three top threes in eight events and ended the year with nearly $3 million without winning once. His time is coming soon ... but it will likely be a week I don\u0027t pick him.8. Sergio Garcia: It certainly was an eventful season for Garcia. Between his meltdown at the Players Championship and his thing with Tiger, I think people forgot that he was actaully really solid this season. He finished top 10 in six of his 17 events and four of his first eight. Was a club away at the Players from having an outstanding season.9. Webb Simpson: Not a great year for Simpson at the majors (he finished no better than T25) but he lost in a playoff to Graeme McDowell at the RBC Heritage and finished a solid fourth at the Tour Championship.10. Nick Watney: Is he the most forgotten star in golf? Finished T13 at the Masters and, even though he had a rough patch in the middle (missed the cut at the other three majors), still finished with two top 10s in the playoffs and 24th on the money list.For more golf news, rumors and analysis, follow @EyeOnGolf and @KylePorterCBS on Twitter or Google+ and like us on Facebook.",
  "category": "SPORT"
}