{
  "url": "http://www.cbssports.com/nfl/eye-on-football/24137678/nfl-week-8-picks-jaguars-in-a-better-shape-than-buccaneers",
  "title": "2013 NFL Week 8 Picks: Jaguars in better shape than Buccaneers",
  "data": "The few Buccaneers fans who remain are eager to get rid of the coach and start over again. (USATSI)The Buccaneers are a bigger dumpster fire than the Jaguars. There. I said it. Hand me a couple billion dollars and I\u0027m immediately buying an NFL franchise. And if I\u0027m picking between purchasing the Jaguars or the Bucs, I\u0027m going Jags. They\u0027re simply in better shape right now overall.Straight up (now tell me) the Bucs win. At 0-7 their record is equal to the Jags. That\u0027s a little superficial, and all it really tells us is that both teams are terrible. Tampa Bay clearly had much, much higher expectations coming into 2013. We could\u0027ve seen 0-7 for the Jags -- they\u0027ll be 0-8 after the 49ers eviscerate them overseas -- but no one saw this submergence into mediocrity coming for Tampa.That\u0027s what makes things worse in Tampa. They\u0027ve invested a ton into high-priced free agents and other acquisitions. Vincent Jackson is 30 and has three years left on a deal that will pay him nearly $10 million each of the next three years. He\u0027s a great wideout but he\u0027s getting older while not getting cheaper. Carl Nicks, who also had his contract restructured this past offeason, is 28, on the hook for three more years at $7 million-plus per season and has played in nine games since joining the Bucs.NFL Expert PicksWeek 8 predictionsJustin Blackmon and Luke Joeckel have their flaws (off-field issues and injury, ones that are strikingly similar to Jackson and Nicks) but give me the cheaper, younger talent all day long.The Bucs aren\u0027t bereft of youth. Lavonte David and Johnthan Banks are good young defensive players. But the whole idea of grabbing a defensive line in back-to-back drafts is still stinging Tampa. Gerald McCoy is a great player when he\u0027s healthy. Da\u0027Quan Bowers is a bust, Adrian Clayborn hasn\u0027t lived up to the hype and Brian Price is already gone.Darrelle Revis is basically on a bunch of one-year, $13 million deals. The Bucs could dump him -- or trade him -- but they\u0027ve already lost the first-round pick they gave to the Jets. If you\u0027re a rebuilding team (and if you\u0027re 0-7 and starting a rookie quarterback, you are rebuilding, regardless of what you say) would you rather have a talented first-round defensive tackle like Sheldon Richardson on the cheap or a high-priced cornerback like Revis? Just saying.The Jaguars have embraced their plunge into the deep end. New GM Dave Caldwell -- another big plus for Jacksonville if you\u0027re picking between the teams -- is trotting out young players like Dwayne Gratz and Johnathan Cyprien on defense to develop them. It\u0027s hurting now but it\u0027ll help later. They\u0027re putting the previous regime\u0027s biggest mistake -- quarterback Blaine Gabbert -- into the furnace when he\u0027s healthy enough to start over Chad Henne and letting him carry them to the promised land that is the top of the 2014 NFL Draft, where a franchise quarterback awaits.Jacksonville has a youthful fanbase that embraces the team and a smart, analytical approach to building a roster. The Bucs beat the Jaguars in attendence in 2009. But in 2010, 2011, 2012 and thus far in 2013, Jacksonville has easily outdrawn its fellow Floridians. (Why don\u0027t more people mention this when the discussion of a team heading to London picks up?)Tampa fans might be creative enough to show up in Hazmat suits for games in \"prime time\" but the reality is they\u0027re an apathetic fanbase. Who is to say they\u0027ll show up if the team\u0027s winning? Ask the Rays how that works out.The Bucs will likely be missing a third-round pick next year as a result of the Revis deal. Jacksonville is gobbling up as many picks as possible. The Jaguars won\u0027t be good overnight. The previous regime sunk that franchise to a bad place with dumb draft picks and mind-boggling free-agent signings.They\u0027re a long way off from being a great team. But they\u0027re not dealing with a MRSA outbreak in the locker room and they\u0027re not facing one of the uglier NFL public-relations crises we\u0027ve seen in a while, in the form of Greg Schiano. Where\u0027s this team turning for a coach? They\u0027ve tried the young assistant route with Raheem Morris and failed. After whiffing on Chip Kelly they went with Schiano and it has been a disaster.Gus Bradley isn\u0027t a guaranteed home run but he had his kids playing hard in Denver when they were dogs by a historical margin. That\u0027s more than the Buccaneers can say for their effort Thursday night against the Panthers.Neither team\u0027s an attractive option and it might not be an opinion you\u0027ll hear echoed often, but right now the Buccaneers are in worse shape than Jacksonville.49ERS (-16½) at Jaguars*: HAVING SAID ALL THAT, there\u0027s no way I\u0027m taking the Jaguars. They\u0027re terrible! (Also I divorced them against the spread, in case you forgot.)DOLPHINS (+6½) at Patriots: The line shift from 7½ to 6½ -- it happened Thursday morning -- is going to make me hate this game for not switching. But what really stood out to me in the Patriots\u0027 loss to the Jets was how much they\u0027re not very good on defense with Vince Wilfork, Jerod Mayo and Aqib Talib all injured. (Duh?) Even if Talib can play, I don\u0027t think the Pats will pressure Ryan Tannehill the way Buffalo did, which sounds weird but is true. Lamar Miller should find a little running room too. Closer game than people are expecting.COWBOYS (+3½) at Lions: MASSIVE game for two teams that are in serious playoff contention. The Lions are coming off a brutal loss to the Bengals and the Cowboys defense is starting to play well. There\u0027s Calvin Johnson vs. Dez Bryant. There\u0027s Tony Romo vs. Matthew Stafford. As Pete Prisco noted on our preview, we might set the record for most sidearm throws in a single NFL game with this matchup. I don\u0027t love the Cowboys but I like the idea of it being a close game that sticks within three points so I\u0027ll ride with Romo. The real bet here is the over. Hammer it.Browns at CHIEFS (-7½): If this is the Broncos at 7-0 and hosting Jason Campbell in his first start of the season while going against a Browns defense that is moving in the wrong direction, this line is like 17½ points. The Chiefs don\u0027t have the Broncos\u0027 offense by any means, but they have a much, much, MUCH better defense. The Browns can block pretty well, what with Joe Thomas on the line, but Thomas can\u0027t match up against all three of Dontari Poe, Justin Houston and Tamba Hali. I\u0027ll set the over/under on sacks for Campbell at 7½ and max the over, please.Giants at EAGLES (-5½): This line is fascinating to me. It\u0027s predicated on the Eagles looking terrible with Nick Foles last week and the Giants winning. But Philly with Michael Vick -- even a not-totally-healthy Vick -- is more than a touchdown better than the Giants. Eli Manning and Co. looked awful against the Vikings on Monday night, have a short week, were hammered by this same division opponent the last time out and didn\u0027t stop anyone last week. Josh Freeman stopped himself.Bills at SAINTS (-10½): Did you know? There are more Duke quarterbacks who have started an NFL game than there are North Carolina quarterback starts in the NFL. That\u0027s just what happens when you have a powerhouse program that fires out superstars like Thaddeus Lewis. I don\u0027t care what he has looked like in two games, though. Drew Brees is coming off a bye, might have Jimmy Graham back and the Bills are on back-to-back road games.Steelers at RAIDERS (+2½): There\u0027s nothing logical behind this pick. The Raiders aren\u0027t good and can\u0027t block. Terrelle Pryor is pretty simple to figure out and Dick LeBeau is a master at confusing quarterbacks; he can absolutely perplex a rookie quarterback. This is a potential statement game for the Steelers, who could creep back into playoff contention with a road win. But something doesn\u0027t feel right. Maybe they win, but they don\u0027t win by much.JETS (+6½) at Bengals: The Geno Smith Roller Coaster Theory is fascinating. Thus far this season, New York has basically been a yo-yo as the Jets have gone win-loss-win-loss-win-loss ... win. So they\u0027re due for a loss, right? Well, maybe. Smith\u0027s play has been erratic the past two games, with him completing less than 60 percent of his passes. I\u0027m not saying he has to bounce back to being really good just because he had strong games the previous two before that, but, OK, maybe I am saying that. New York won\u0027t be able to run as well but with Leon Hall down they\u0027ll get some shot plays off to guys like Jeremy Kerley and Stephen Hill.Falcons at CARDINALS (-2½): Maybe the toughest game to pick this week. Carson Palmer looked like a statue dipped in cooking oil last Thursday against the Seahawks and teams are stinking the week after they play Seattle. But the Falcons have no one and Arizona will be smart enough to stick Patrick Peterson on Harry Douglas and force Matt Ryan to look for a bracketed Tony Gonzalez, right? RIGHT?REDSKINS (+13½) at Broncos: With a name like BRAVEHEARTS, how can you go wrong. FREEEEEEEDOM. Also Dan Snyder could\u0027ve avoided this whole racist-nickname fiasco if he had just changed the Washington logo to a potato a few weeks ago. The reality is the Colts gave a nice blueprint for beating the Broncos, but the Redskins don\u0027t have the personnel to actually pull it off (no offense to DeAngelo Hall and David Amerson). They do have the offense to keep up, for a while, with Peyton Manning.PACKERS (-8½) at Vikings: This is the case of \"Never Bet Against Aaron Rodgers in a Prime Time Game Against a Hated Division Opponent\" trumping \"Never Bet Against Adrian Peterson in a Prime Time Game Against a Hated Division Opponent.\" Do you know what Rodgers\u0027 splits are against the Vikings for his career? 11 starts, seven wins, 70.7 completion percentage, 24 touchdowns and four interceptions. And this Vikings secondary is AWFUL. Shredfest.SEAHAWKS (-10½) at Rams: Kellen Clemens is starting for the Rams. That is all. Enjoy your weekend.Last Week: 5-10This Week: 1-0Season: 53-55",
  "category": "NFL"
}