{
  "url": "http://www.cbssports.com/nfl/eye-on-football/24138048/do-bucs-still-believe-in-coaching-staff-revis-says-i-dont-know",
  "title": "Do Bucs still believe in coaching staff? Revis says \u0027I don\u0027t know\u0027",
  "data": "  Darrelle Revis isn\u0027t sure if the players still believe in Greg Schiano\u0027s coaching staff. (USATSI) One day after a 31-13 loss to the Carolina Panthers, Buccaneers coach Greg Schiano said that he doesn\u0027t believe he\u0027s lost the locker room. Schiano might still have the locker room, but that doesn\u0027t mean the players in the locker room still believe in him. After the game on Thursday, cornerback Darrelle Revis was asked if he thought the team collectively \u0027still believes in the scheme and the coaching staff.\u0027 \"I don\u0027t know. I don\u0027t know,\" Revis said, via JoeBucsFan.com. \"You know, we got a game plan every week. We gotta stick to the game plan. We gotta abide by the game plan and what we\u0027re trying to do to win. I don\u0027t think guys are literally going out there and trying to do their own thing. You know, in every game there are mistakes up and down the board. You know, the word that we have to get to and we have to focus on is consistency. That\u0027s all. And at this point, that\u0027s a hard word for us to try to do, to try to do that, to be consistent.\"\u0027I don\u0027t know\u0027 isn\u0027t exactly a ringing endorsement endorsement form Revis.The Buccaneers are now 0-7 for the seventh time in NFL history, tying the Colts and Bengals for the most 0-7 starts. Things don\u0027t figure to get much better for Tampa Bay in Week 9. The Bucs will head to Seattle where the Seahawks haven\u0027t lost since 2011.The Schiano pressure-cooker is only going to get hotter. Billboards asking ownership to \u0027Fire Schiano\u0027 are popping up in Tampa, a Backstreet Boy wants Schiano fired and this week, a player said playing for Schiano is \u0027like being in Cuba.\u0027 With public pressure mounting and the Bucs not winning, it\u0027s hard to see Schiano lasting through the end of the season. ",
  "category": "NFL"
}