{
  "url": "http://www.cbssports.com/nfl/writer/jason-la-canfora/24137364/nfl-week-8-best-bets-eyeing-big-spreads-and-skins-cover-at-denver",
  "title": "NFL Week 8 Best Bets: Eyeing big spreads, and Skins cover at Denver",
  "data": "I hate writing this. Or, perhaps more to the point, I hate myself for writing this. My disappointment with myself grows each week. I cannot get over the hump.I\u0027m not even owning Sunday night anymore. And steer clear of my 4 p.m. ET picks in particular. For whatever reason that\u0027s my undoing. I\u0027m killing Thursday night, but we do this best bets feature after that game is played, so even that isn\u0027t really helping!This week, I\u0027m going to go with three huge spreads in what looks like a week of mismatches on paper. Of course, no one ever really ever knows how this stuff will play out. But overall this should be a week where cream rises and we get some separation between the haves and have nots.NFL Expert PicksWeek 8 predictionsWashington (+12½) at Denver: The Denver defense has some issues. While we may think the Broncos are still putting up 50 points every week, the reality is they\u0027re not. And they are turning it over some now. And the loss of stud LT Ryan Clady is showing up. And their secondary can\u0027t really stop anyone.I still believe they win a shootout here, but Robert Griffin III finally looks like RG3 and the Skins can finally run the degree of read-option stuff that made them a good offense in the first place. Without it they\u0027re pedestrian at best. They should score points here with Griffin causing problems out in space. I think Washington keeps it close.Seattle (-10½) at St. Louis: I don\u0027t see the Rams competing much without Sam Bradford, and they were quite hit or miss with him. The offense has yet to evolve and I expect the Seahawks defense to perhaps outscore the Rams\u0027 offense here with Kellen Clemens under center and a lack of a proven run game.The Rams don\u0027t score touchdowns on the ground and they concede yards in bunches and the Seahawks might have Percy Harvin to boot. Not good.San Francisco (-16½) vs. Jacksonville in London: The Jaguars\u0027 travel schedule has been brutal -- more brutal than the 49ers, even, and they simply don\u0027t compete most weeks. Sure they got up for the Broncos and kept it closer than expected, but that\u0027s looking like their Super Bowl right now.This is the last game before the trade deadline, several Jags veterans are on the block, the bye is looming and the 49ers are one of the hottest teams in the league. San Francisco\u0027s multitude of running options alone could probably put this out of reach. It\u0027s also a chance for Colin Kaepernick to pad his passing stats. The 49ers should be able to physically overpower Jacksonville. I would hardly call this a true home game for the Jags.Green Bay (-9) at Minnesota: The Vikings have no discernable strength right now. This is a team prone to giving up points in droves and cannot score with any pace or regularity. Flip-flopping QBs and a struggling run game will be a problem. Sure, the Packers have lost their share of pass catchers but I don\u0027t think it will matter here.",
  "category": "NFL"
}