{
  "url": "http://www.cbssports.com/general/blog/rob-rang/24143516/nfl-scouts-know-bruins-linebackers-more-than-just-anthony-barr",
  "title": "NFL scouts know Bruins\u0027 linebackers more than just Anthony Barr",
  "data": "  Anthony Barr is the featured pass rusher for UCLA, a RB converted into a defensive terror. (USATSI) By now, most respectable college football fans know all about Anthony Barr.A 6-foot-4, 235-pound running back until Jim Mora took over the reins at UCLA last year, Barr exploded for 21.5 tackles for loss, including 13.5 sacks a season ago. This year, he\u0027s proven his breakout campaign was no fluke, emerging as the country\u0027s best senior NFL prospect. Barr\u0027s rise up the charts has almost been as explosive as his burst off the snap.Barr used this burst to sack Oregon\u0027s Marcus Mariota twice in the first half; the first of which resulted in a fumble from the Heisman hopeful. He recovered a second fumble off of a poor shotgun snap to Mariota midway through the third quarter to preserve a 14-14 tie. Barr also drew a holding penalty from Oregon left tackle Tyler Johnstone, ultimately forcing the Ducks to devote two blockers to slowing him down.Once they did, however, Oregon exploded, scoring three touchdowns in the fourth quarter to turn a tight game into just another blowout in Eugene.While Barr may be well known, few outside of NFL scouts and hardcore Pac-12 fans realize the talent possessed by the rest of the Bruins\u0027 linebacker corps.Barr is the featured pass rusher in UCLA\u0027s 3-4 scheme but freshman Myles Jack at the \"other\" outside linebacker position is also an extraordinary athlete with obvious NFL potential. The 6-foot-1, 225-pound defender showed great range and open-field tackling ability in this contest. He also showed the ability to make the momentum-changing play, teaming with junior inside linebacker Eric Kendricks to force a fumble by Oregon wideout Keanon Lowe on the game\u0027s second snap.Projecting a true freshman as a future pro is always risky business but as the NFL increasingly turns to the pass, hybrid defenders like the athletic and instinctive freshman are becoming more and more valued.The lure of the NFL could prove too much for Kendricks, a six-foot, 228-pound clone of his older brother, former Cal standout and current Philadelphia Eagles\u0027 linebacker Mychal Kendricks.Aggressive and instinctive, Kendricks led the Pac-12 with 150 tackles in 2012 and entered the Oregon game second in the conference in stops so far this season. Like his older brother, Eric lacks the traditional size associated with inside linebackers but there is no questioning his physicality or open field tackling skills.Senior Jordan Zumwalt lacks the name recognition of his peers but the 6-foot-3, 235-pounder has developed into a steady run-stuffer over the past two seasons. Zumwalt emerged as a starter last year, recording a career-high 71 tackles, including eight tackles for loss. While clearly not as athletic as his peers, Zumwalt\u0027s length and strength helped him fight through blocks effectively and make forceful stops near the line of scrimmage.As was frequently mentioned by ABC\u0027s broadcast crew of Brent Musburger and Kirk Herbstreit, the Bruins entered Saturday night\u0027s Pac-12 showdown with Oregon starting three freshmen along the offensive line. This fact - and a second consecutive poor showing from redshirt sophomore quarterback Brett Hundley - made UCLA an easy underdog in Eugene.The Bruins kept things closer than expected for much of the game because their defense did a nice job of containing Oregon\u0027s skill-position stars. That credit lies with the Bruins\u0027 \u0027backers, as formidable a foursome as you\u0027ll find in the country.",
  "category": "NFL"
}