{
  "url": "http://www.cbssports.com/nfl/draft/blog/rob-rang/24143214/smooth-sammy-watkins-an-easy-nfl-projection",
  "title": "Smooth Sammy Watkins an easy projection at WR for NFL scouts",
  "data": "  Sammy Watkins projects as an ideal flanker in the NFL, in the same mold as Pierre Garcon. (USATSI) Every fan of the sport knows that there is a difference between timed speed and football speed. Football is rarely a game of straight-lines, making fluidity and general athleticism much more critical than just a 40-yard dash time.In much this same way, some receivers possess a natural ability to pluck the ball, tuck it away and accelerate in one smooth motion that makes them even greater than the sum of their parts. Sammy Watkins is one such receiver.Prospect RankingsWatkins top wide receiver The Clemson Tigers leaned heavily on Watkins early in their matchup with Maryland, with Tajh Boyd targeting him 12 times in the first half. He caught 10 of those passes for 127 yards to help stake Clemson to a 16-7 halftime lead. By comparison, Boyd\u0027s nine other completions of the first half nettedthe Tigers just 60 yards.Watkins\u0027 production (14 catches for 163 yards) was critical to the Tigers\u0027 success in part because Boyd was hampered by a sore leg. As Maryland worried less about Boyd\u0027s threat as a runner they tightened against the pass, alternately blitzing and dropping back extra defenders into coverage. As a result, the senior quarterback struggled again with accuracy from the pocket, just as he did a week ago against Florida State.As the game went on and it became increasingly obvious that Clemson was reliant on Watkins to make a big play, Maryland worked to take him out of the game. He caught only four passes in the second half with bracket coverage and linebackers dropping off into his zone frequently forcing Boyd to look elsewhere.Watkins didn\u0027t help his own cause as he fumbled his 13th touch of the game, a quick receiver screen in which he failed to protect the ball with both hands. The loss of technique led to a lost football when Watkins simultaneously absorbed hits from two different Maryland defenders.The 6-foot-1, 205-pound junior is NFLDraftScout.com\u0027s top-rated receiver. Quick, strong and possessing the explosive speed to burn corners who challenge him in bump and run coverage, Watkins projects as an ideal flanker in much the same mold as Pierre Garcon (6-0, 212). Of course, Watkins\u0027 dominance in college football has come against elite competition, whereas Garcon had to work his way into a starring role after playing collegiately at Mount Union.Watkins explodes off the line of scrimmage and out of his breaks, easily separating from defenders. Most impressive, however, is the fluidity with which he catches the ball and gets upfield. There, his vision and maneuverability make him a threat to score from anywhere.",
  "category": "NFL"
}