{
  "url": "http://www.cbsnews.com/8301-250_162-57609186/maryland-gov-candidate-admits-mistake-in-underage-drinking-flap/",
  "title": "Maryland Gov. candidate admits \"mistake\" in underage drinking flap",
  "data": " Maryland attorney general Doug Gansler, a Democrat who is currently running for governor, came under fire this week after a photo surfaced of him at a party where many underage young people were drinking.  According to the Baltimore Sun, Gansler said he was only briefly dropping in on the party at a Delaware beach house to talk with his son, who was attending the bash, before leaving. He said he did not recall whether anyone was drinking, but he added that he did not believe it was his responsibility to intervene if they were.  \"Assume for purposes of discussion that there was widespread drinking at this party,\" he explained. \"How is that relevant to me? ...The question is, do I have any moral authority over other people\u0027s children at beach week in another state? I say no.\"  Gansler was among a group of parents who chipped in to rent a beach house for their sons to celebrate their recent graduation from high school. The parents set up guidelines that forbade the boys from driving or drinking hard alcohol, but if some of the raucous accounts from the party are any indication, there was no shortage of alcohol consumption.  In an interview with the Sun, Gansler insisted his son was not drinking, and he brushed aside suggestions that he should have stepped in to stop the revelry. \"My responsibility is only to my child,\" he explained. \"Everybody has their own moral compass. Mine is to raise my own child.\"  But after the controversy persisted for several days, Gansler was singing a different tune, admitting in a Thursday press conference that he erred.  \"Perhaps I should have assumed there was drinking in the home, and I got that wrong,\" he said, acknowledging that his failure to investigate the underage drinking \"was a mistake I made.\"  Still, he denied that the flap would have any impact on his decision to continue his gubernatorial bid. \"We\u0027re in it,\" he insisted. \"We\u0027re going to win it.\"  In a twist sure to spark accusations of hypocrisy, Gansler even appeared in a 2012 video for the Century Council, an organization that combats teen drinking and drunk driving, urging parents to take a hard line against underage alcohol consumption. \"Parents, you\u0027re the leading influence on your teen\u0027s decision not to drink,\" the attorney general said in the video. \"It\u0027s never too early to talk with your kids about smart ways to say no.\"  Critics say Gansler should be penalized for his lapse in judgment. \"It\u0027s totally inappropriate for an adult, especially for an elected official whose job is to uphold the laws of the state or any state,\" Michael Gimbel, an independent consultant and the former alcohol abuse prevention official for Baltimore County, told the Sun. \"For any parent to do this is irresponsible. But for an attorney general who fought for these laws on the books is even worse.\"  The party photo and the ensuing uproar are only the latest complication faced by Gansler in his bid to become the next governor of Maryland. Earlier in October, the Washington Post reported that Gansler was criticized by the state troopers who drove him around the state for urging them to break traffic laws.  Md. AG: Report I drove recklessly doesn\u0027t reflect reality \n The Post cited written accounts from Maryland State Police officers claiming that Gansler ordered the troopers to activate lights and sirens, exceed the speed limit, run red lights, and bypass traffic jams by driving on the shoulder of the road.  \"This extremely irresponsible behavior is non-stop and occurs on a daily basis,\" Lt. Charles Ardolini, commander of the state police executive protection section, explained in a 2011 memo, according to the Post. \"Attorney General Gansler has consistently acted in a way that disregards public safety, Troopers safety and even the law.\"  Gansler, however, said he was only \"backseat driving,\" and his spokesman noted that Gansler had no direct authority over the officers, who were free to ignore his advice.  \"I deeply respect the troopers and job they do protecting me and the public,\" Gansler said. \"A few of the 18 troopers who have provided me protection felt my backseat driving made them uncomfortable - for that I apologize.\"  Gansler is running against Lieutenant Governor Anthony Brown and state legislator Heather Mizeur in the Democratic primary election, which will be held on June 24, 2014. If he secures the nomination, he will face the Republican candidate in a November 4 general election.  ",
  "category": "POLITIC"
}