{
  "url": "http://www.cbssports.com/nfl/eye-on-football/24137347/remember-when-controversy-erupts-when-oilers-hired-bum-phillips",
  "title": "Remember When: Bud Adams hires Bum Phillips; Sid Gillman quits",
  "data": "   As a new head coach in Houston, Bum Phillips had to make sure he had the power. (Getty Images) Before the 1974 season began, the Houston Oilers were the laughingstock of football. The once-proud organization that had won the first two American Football League championships in 1960 and 1961 had fallen into such disrepair that they had won one game in 1972 and one game in 1973.Or as Sports Illustrated described the squad then: \"A football team apparently designed for one big belly laugh and one small victory per season.\"Life was so bad that when Oilers owner Bud Adams hired legendary coach Sid Gillman to take over as the team\u0027s general manager, Gillman slowly proceeded to usurp all the power from then-head coach Bill Peterson. One day, Peterson announced to the team that Gillman would take over the running of the offense. And then Peterson walked over to a corner of the room and sat in a fetal position.But this is a story about Bum Phillips and Bud Adams -- who died three days apart earlier this month (here\u0027s Phillips\u0027 obituary, and here\u0027s how we remembered Adams) -- and how the latter\u0027s hiring of the former helped springboard the team to three-straight playoff appearances in the late 1970s and turned a disaster of a team into Luv Ya Blue.After the team finished 1-13 in 1973, Gillman called Phillips -- who had worked for Gillman as the Chargers defensive coordinator in the late 1960s and, by then, was an Oklahoma State assistant coach -- and asked him to come to Houston in 1975 to be the head coach (Gillman would return to his GM-only job after he led the team to a monumental 7-7 record in 1974 that won him the AFC coach of the year award).Phillips accepted, and soon after, a controversial conspiracy erupted.Gillman had given a Phillips a contract that contained a clause saying that Gillman had final approval of Phillips\u0027 player-personnel moves, but, as the story goes, Phillips went to Adams one day when Gillman was out of town and had that clause removed. Then, after receiving Adams\u0027 support, Phillips barred Gillman from attending practice and from the locker room.It should be noted here that Gillman was well-known as an administrator who would intervene in a practice or a meeting if he could. Just ask Peterson. Besides the first time Gillman and Phillips worked together, Gillman completely overruled Phillips and scrapped his 3-4 defense in San Diego. Phillips, in his first head coaching job, couldn\u0027t let Gillman the GM have that control.\"Bum wasn\u0027t going to be like Bill Peterson,\" Oilers quarterback Dan Pastorini told me in 2011. \"He had to have full control or nothing. He figured if Sid caught [the removal of the clause] in his contract, he would be fired. If Sid didn\u0027t catch it, he would have full control.\"When Gillman discovered what had happened, he appealed to Adams. But Adams sided with Phillips, and when he determined that the Oilers coach had more control and power than the Oilers GM, Gillman resigned.In later years, Gillman blamed the breakup on Adams -- at least publicly. But I can tell you from first-hand experience that Gillman\u0027s family still feels injured by Phillips as well. \"He gave [Phillips] everything,\" Gillman\u0027s son, Tom, told me. \"He gave him a good shot at his back.\"When I later talked to Phillips on the phone and asked him about the supposed betrayal, here\u0027s how he described it: \" I had control of the team. I had the right to draft, waive, trade. I had the control I needed. That\u0027s what [Gillman] gave me. I told Sid that\u0027s what I wanted, and he said that was fine. We didn\u0027t have any disagreement over that. Evidently, the disagreement was with Bud.As for going behind Gillman\u0027s back, Phillips said, “There was a whole lot of stories running around, I guess. Believe me, I\u0027m telling you what happened. I worked for [Gillman] for six years, and I enjoyed it for six years. If he wanted to draft somebody that I didn\u0027t want to draft, we wouldn\u0027t have drafted him. I had no problem with knowing my responsibilities.”Without Gillman in the picture, the Oilers improved to 10-4 in 1975, and from 1978-80, the team went 32-16. Here was how the Beaver County Times told the story.Eventually, Adams fired Phillips after the 1980 season, reportedly for Phillips\u0027 refusal to hire an offensive coordinator. Still, this came after Houston went 11-5, and it took the Oilers more than a half-decade to recover from the coaching change.Either way, the legacies of Phillips and Adams in the city of Houston and -- in the NFL beyond -- will endure for many years to come. Even if the beginning of the relationship led to the GM\u0027s resignation.Follow Josh Katzowitz on Google+",
  "category": "NFL"
}