{
  "url": "http://www.cbssports.com/nfl/eye-on-football/24137954/stephen-jones-tony-romo-is-like-lebron-james-just-needs-a-ring",
  "title": "Stephen Jones: Tony Romo is like LeBron James, just needs a ring",
  "data": "  Tony Romo\u0027s smile would probably be bigger if he had a Lombardi Trophy and a ring. (USATSI) Cowboys quarterback Tony Romo made his 100th career start in Week 7 and through 100 games, Romo has more passing yards and completions than any quarterback ever through their first 100 career-starts. What Romo doesn\u0027t have though is a Super Bowl ring and Cowboys executive vice president Stephen Jones thinks that\u0027s the main reason Romo\u0027s not getting the respect he deserves. Jones specifically brought up LeBron James as an example of a great athlete who didn\u0027t get the recognition he deserved until he finally won an NBA title.   \"You look at just the history of athletes in general, whether it is a LeBron James or anybody, there\u0027s a lot of criticism until you put those championship rings on their fingers,\" Jones told SiriusXM NFL Radio. \"I think Tony will get his and when he does I think history is going to look upon him, look at his career, and say that, hey, he was one hell of a quarterback.\"Jones thinks the pressure is extra high for Romo in Dallas because the Cowboys franchise-history includes five Super Bowl wins.\"I completely understand here in Dallas there is a high bar when you look at some of the quarterbacks that we\u0027ve had here and the championships that they\u0027ve won, I think Tony would be the first to tell you that he\u0027s disappointed that his success in the postseason and winning a Super Bowl hasn\u0027t been better,\" Jones said. \"But if you look at how he\u0027s performed year in and year and year out, I saw some very interesting statistics on him after the first 100 games and I think he ranks with just about anybody in terms of his first 100 NFL football games.\"Through his first 100 starts, Romo has thrown for 27,485 yards. That\u0027s more yards than Peyton Manning (26,008) and Dan Marino (27,274) threw for in their first 100 starts. Romo\u0027s also thrown 189 touchdown passes in that same 100-game span, trailing only Marino (214) and Brett Favre (194).  However, Cowboys fans probably won\u0027t be happy until Romo delivers a Super Bowl title for Dallas. The next time LeBron attends a Cowboys game, maybe Romo can ask him how to deal with everyone disliking you because you don\u0027t have a ring. Of course, taking advice from LeBron might not be a good idea because he ditched his original team to win a title and Cowboys fans probably don\u0027t want Romo to do that. ",
  "category": "NFL"
}