{
  "url": "http://www.cbsnews.com/8301-250_162-57609429/consultants-arrival-brings-hope-to-w.h-in-obamacare-website-repair/",
  "title": "Consultant\u0027s arrival brings hope to W.H. in Obamacare website repair",
  "data": " WASHINGTON After a week of unrelentingly negative news coverage and consumer dissatisfaction with the healthcare.gov web site, the White House believes it has turned an important corner by identifying a date when the web site will be fixed.  Jeffrey Zients, whom President Obama named this week as his top consultant on the web site triage project, announced Friday the system would be fully functional by the end of November.   Senior officials said Obama was briefed by Zients on this target date and given approval to release it publicly, a sign of Obama\u0027s high-degree of confidence in Zients\u0027 ability to deliver. In private deliberations, Obama had made it clear to senior White House officials he wanted no discussion of target dates for the web site until he could be certain that date could be met. \n\n\n\n\n\n\nPlay Video\nFor Obamacare web repairs, time is of the essence\n\n\n\"Jeff\u0027s ability to create structure and a process and accountability has a lot of us feeling much better about all this than we did a week ago,\" a senior official said. \"We set expectations unreasonably high before and we are paying the price for that. We do not want to do that again.\"  In fact, Obama sent signals he wanted a week of padding around any announced date for the web site to be declared fully operational -- meaning he wanted it working completely for at least a week before anyone in the White House circled a date on the calendar.   On Friday Zients -- previously Obama\u0027s chief performance officer and deputy director of the Office of Management and Budget -- put that date on the calendar.   \"Each week, the site will get better as we make the necessary fixes,\" Zients said on a conference call with reporters. \"And by the end of November, healthcare.gov will work smoothly for the vast majority of users. Healthcare.gov is fixable.\"  Either Zients or Marilyn Tavener, the head of the Centers for Medicare and Medicaid Services, briefs Obama each day on the progress achieved in fixing the web site\u0027s myriad problems. Starting this week, Obama began receiving at the end of every day a detailed report charting, among other things, improvements to the web site\u0027s ability to log-on customers, keep them on the site without losing data and accurately transferring data to insurance companies. Obama asked for reports to contain details on the system\u0027s ability to widen the \"aperture\" - meaning increasing the number of customers who could successfully navigate the web site\u0027s requirements to logon, compare plans and complete the enrollment process.  \n\n\n\n\n\n\nPlay Video\nObama taps trusted aide to fix health insurance website\n\n\nSenior officials also expressed confidence that if Zients and others can fix the web site by the end of November the White House will be able to quell calls from some Senate Democrats to extend the enrollment period for obtaining insurance. Sen. Jeanne Shaheen, D-N.H., is currently leading those efforts.  The White House prefers to keep the law\u0027s March 31 deadline for enrollment because it knows, based on its analysis of enrollment patterns after Massachusetts enacted its healthcare law, that most customers will enroll near the end of the sign-up process. As one official said, consumers need deadlines and moving the federal law\u0027s deadlines will only lengthen the sign-up process.  It\u0027s equally true that insurance companies want to keep the March 31 deadline because they are eager to acquire customers and the premiums they pay to finance insurance coverage the law requires for new and existing consumers -- a topic discussed Wednesday when more than a dozen health insurance CEOs met with White House Chief of Staff Denis McDonough, senior adviser Valerie Jarrett and Health and Human Services Secretary Kathleen Sebelius. \n\n\n\n\n\n\nPlay Video\nHealthcare.gov often lists wrong price information\n\n\nFor White House veterans, this week has reminded them of the intensely negative publicity, scrutiny and skepticism that surrounded the administration\u0027s initially plodding response to the Gulf oil spill. In those difficult days, Obama and senior officials realized nothing could be communicated about cleanup efforts or economic intervention to assist affected states until, as several officials phrased it then, someone \"plugged the damn hole\" spewing oil into the Gulf.   Now, officials here privately concede, the White House cannot convey anything memorable about the new healthcare law until someone \"fixes the damn web site.\"  The great difference with the web site, unlike the drilling platform that exploded in the Gulf, is the administration created the healthcare law and the web site.  \"We built, we own it and it\u0027s all ours,\" said one official. \"We can\u0027t escape it and we will have to face all the criticism until we get it right.\"  ",
  "category": "POLITIC"
}