{
  "url": "http://www.cbsnews.com/8301-18563_162-57609210/did-white-house-obamacare-guidance-stop-ahead-of-2012-election/",
  "title": "Did White House Obamacare guidance stop ahead of 2012 election?",
  "data": " (CBS News) WASHINGTON -- CBS News has been digging into the cause of the delays in preparing the website for the government\u0027s health insurance market and has learned was a major interruption in the months before President Obama\u0027s re-election. At the height of the 2012 presidential election campaign, it was crunch time for the Obama administration to release key instructions so contractors could work toward the October 2013 deadline.   But a Health and Human Services official who was closely involved tells CBS News that in late summer, the administration stopped issuing proposed rules for the Affordable Health Care Act until after the election.   The result was what many viewed as a serious delay as contractors, states and insurance companies awaited crucial guidance to move forward.  \n\nA woman looks at the HealthCare.gov insurance exchange internet site October 1, 2013 in Washington, DC. US President Barack Obama\u0027s Affordable Care Act, or Obamacare as it is commonly called, passed in March 2010, went into effect Tuesday at 8am EST. Heavy Internet traffic and system problems plagued the launch of the new health insurance exchanges Tuesday morning. Consumers attempting to log on were met with an error message early Tuesday due to an overload of Internet traffic. AFP PHOTO / Karen BLEIER (Photo credit should read KAREN BLEIER/AFP/Getty Images)\n/\n\nKAREN BLEIER\n\n  \"Some of (the rules) were ready to go back in June or July,\" says one insider. \"Suddenly, everything was on hold.\"   CBS News reviewed the HHS website and found between 2010 and August 31, 2012, 109 proposed regulations and guidance were issued.   Then from September 1 until late November there were none. The flurry resumed after the election.   HealthCare.gov architects: Govt\u0027s pre-launch testing insufficient Administration enlists former CEO to help fix HealthCare.gov Amid HealthCare.gov problems, Democrats stay upbeat On Thursday, a White House spokesman told us issuing regulations was the sole responsibility of HHS. Their timetables were their own and not influenced by the White House or the re-election campaign.   Whoever decided on the delay, one government source says it meant insurance companies didn\u0027t have information they needed to design their plans and calculate premiums.   Another says that the main website builder, contractor CGI, didn\u0027t get all its final technical requirements until May.   That includes the crucial \"user interface,\" which dictates what people see when they visit the website and how they navigate around.   Without final instructions, the source says, CGI started down a path only to later discover it was the wrong path. CGI had to throw out and start over on about a third of its work.   Some experts say the web site should\u0027ve been tested for four to six months prior to the launch rather than just days. But some of the final technical requirements weren\u0027t even issued six months before the launch.    ",
  "category": "POLITIC"
}