{
  "url": "http://www.cbsnews.com/8301-250_162-57609316/healthcare.govs-problems-technical-and-political-run-deep/",
  "title": "HealthCare.gov\u0027s problems - technical and political - run deep",
  "data": " Nearly a month after its rollout, the Obama administration is still grappling with major problems on HealthCare.gov, the federal website through which Americans in 36 states can purchase insurance on the new Obamacare marketplaces.   \"It\u0027s certainly not perfect but getting better by the day,\" Health and Human Services Secretary Kathleen Sebelius said Thursday in Phoenix.   The administration is now promising that the site\u0027s problems will be, for the most part, resolved by the end of November. Yet even if the technical glitches on HealthCare.gov are resolved, this week revealed that the new insurance marketplaces the site serves still need to overcome huge hurdles, both technically and politically, to succeed.\n Medicaid vs. Private Insurance: Recipe for Disaster?    \n\n\n\n\n\nPlay Video\nObamacare: Medicaid enrollment outpacing private insurance could cause serious issues\n\nCBS News\u0027 Jan Crawford reports that a CBS News analysis shows that in many of the 15 state-based health insurance exchanges more people are enrolling in Medicaid rather than buying private health insurance. And if that trend continues, there\u0027s concern there won\u0027t be enough healthy people buying health insurance for the system to work.  As the Obamacare website struggles, the administration is emphasizing state-level success. President Obama said Monday, \"There\u0027s great demand at the state level as well. Because there are a bunch of states running their own marketplaces.\"  But left unsaid in the president\u0027s remarks: the newly insured in some of those states are overwhelmingly low-income people signing up for Medicaid at no cost to them.  Matt Salo, executive director of the National Association of Medicaid Directors, said, \"We\u0027re seeing a huge spike in terms of Medicaid enrollments.\"  He says the numbers have surprised him and state officials.  Did Election Delay HealthCare.gov Development?     \n\n\n\n\n\nPlay Video\nDid White House delay Obamacare rules ahead of election?\n\nCBS News\u0027 Sharyl Attkisson has been digging into the cause of the delays in preparing the website for the government\u0027s health insurance market and has learned was a major interruption in the months before President Obama\u0027s re-election. At the height of the 2012 presidential election campaign, it was crunch time for the Obama administration to release key instructions so contractors could work toward the October 2013 deadline.  But a Health and Human Services official who was closely involved tells CBS News that in late summer, the administration stopped issuing proposed rules for the Affordable Health Care Act until after the election.  The result was what many viewed as a serious delay as contractors, states and insurance companies awaited crucial guidance to move forward.    Insurance Companies Dropping Customers    \n\n\n\n\n\nPlay Video\nObamacare rules mean some insurance plans are cancelled\n\nThe president\u0027s health care law raises the standards for insurance policies, which many consider to be a good thing. But hundreds of thousands of Americans whose policies don\u0027t meet the new standards are being told that their health plans are being cancelled, CBS News\u0027 Carter Evans reports.  Gerry Kominski, director of public health policy at UCLA said: \"About half of the 14 million people who buy insurance on their own are not going to be able to keep the policies that they had previously.\"  He says higher premiums help insurers pay for new requirements including accepting patients with pre-existing conditions and providing preventative care like check-ups and vaccines.  \"You\u0027re paying more for a better product and for more protection -- and you won\u0027t understand the value of that until you need it,\" he said.  Democrats Find Themselves in Uneasy Spot \n\n\n\n\n\nPlay Video\nObamacare website contractors point fingers at White House\n\nRepublicans in Congress this week ratcheted up the pressure they\u0027re putting on the Obama administration to explain why the Obamacare website HealthCare.gov is so flawed, and in many instances, Democrats echoed their complaints. They\u0027ve also, however, warned their GOP colleagues against taking the complaints too far.  The ongoing investigations have left Democrats in the uneasy position of criticizing the implementation of President Obama\u0027s signature law. This week left them acknowledging the major problems with HealthCare.gov, which serves 36 states, while at the same time complaining about partisan attacks.  In an open letter published this week, two Democrats on the House Oversight Committee chastised the committee\u0027s chairman Rep. Darrell Issa, R-Calif., for creating an \"unsubstantiated narrative that White House officials were making technical decisions [about HealthCare.gov] based on political motivations.\"  \"Unfortunately, this has become an unfortunate pattern with this Committee,\" wrote Rep. Elijah Cummings, D-Md., the top Democrat on the committee, and Rep. Gerry Connolly, D-Va. \"In the Committee\u0027s past investigations involving Operation Fast and Furious, the attacks in Benghazi, and the IRS review of applicants for tax-exempt status, your approach has been to leap directly to accusations against the White House and top Administration officials with no basis in fact.\"  ",
  "category": "POLITIC"
}