{
  "url": "http://www.cbsnews.com/8301-18563_162-57609411/healthcare.gov-emergency-doctor-outlines-triage-plan/",
  "title": "HealthCare.gov emergency doctor outlines triage plan",
  "data": " (CBS News) WASHINGTON -- It all sounded pretty good the day HealthCare.gov went online: President Obama said people were flocking to the site. And any \"glitches,\" as he called them, would be fixed and they\u0027d have the site running more quickly in just a few hours.  On Friday -- 24 days later -- the man the president brought in to rescue his health insurance program acknowledged the painfully obvious: that the problems have been far worse than we were told. Jeffrey Zeints said they\u0027ll take weeks -- if not longer -- to fix. Plus, he\u0027s shaking up the team overseeing the repairs.  \n\nJeffrey Zients, acting director and deputy director for management at the Office of Management and Budget, testifies before the Senate Budget Committee on the president\u0027s fiscal year 2014 budget proposal on April 11, 2013 in Washington, DC. \n/\n\nPhoto by T.J. Kirkpatrick/Getty Images\n\n  The government has brought in consultant Zients to spearhead repairs of HealthCare.gov. On Friday, what he told reporters on a conference call was a game changer: the website\u0027s problems amount to way more than a glitch.   \"It\u0027ll take a lot of work and there are a lot of problems that need to be addressed, he said. \"There is a punch list of fixes and we\u0027re going to punch them out one by one.\"  That assessment goes much deeper than the idea Health and Human Services Secretary Kathleen Sebelius promoted: that the main problem was unexpected volume.   \"We were just wildly incorrect,\" she said. \"The number so far exceeded that. And now there are very specific diagnostics in place.\"  Zients says there are two categories of issues with the website: performance, which is speed, response time and reliability; and function, the bugs that prevent the software from working properly.  The government also announced it\u0027s removing the Centers for Medicare and Medicaid Services as overseers of repairs. That job is going to QSSI, one of the tech companies that helped build HealthCare.gov.   \"And by the end of November, HealthCare.gov will work smoothly for the vast majority of users,\" said Zients.  \n\n\nA woman looks at the HealthCare.gov insurance exchange internet site October 1, 2013 in Washington, DC. \n/\n\nKAREN BLEIER/AFP/Getty Images\n\n \nThat end of November date could be make or break for affordable care, according to one former Obamacare official who didn\u0027t want to be identified. He said the government has weeks -- not months -- to fix the website before the entire business model gets thrown off.  Joel Ario agrees that fixes must come fast. He was director of the HHS Office of Exchanges.   \"The longer they go, the more people get impatient about it,\" he said. \"But for the period we\u0027re in now, I think we\u0027re very much in a zone where the administration has about a month here to get it right.\"  The government said that as few as 3 in 10 people who try can complete the application process. But it said 9 in 10 people are at least able to create an account. However, I tried three times to create an account and the system would not let me do it.  ",
  "category": "POLITIC"
}