{
  "url": "http://www.cbsnews.com/8301-250_162-57609345/should-doug-gansler-have-done-more-about-underage-drinking-party/",
  "title": "Should Doug Gansler have done more about underage drinking party?",
  "data": " Critics piled on Maryland Attorney General Doug Gansler this week after a photo surfaced of him at a party in a Delaware beach house, surrounded by underage young people drinking alcohol.  Gansler, a Democrat who\u0027s also running for governor, said he was only stopping by the party to check on his son, who was attending. But the attorney general didn\u0027t help his case by initially denying it was his responsibility to stop the underage drinking, before eventually conceding that he made a \"mistake\" in neglecting to curb the raucous party. \n\n\n\n\n\n\nPlay Video\nGansler addresses underage drinking flap\n\n\n\"There could be Kool-Aid in the red cups,\" he said at a Thursday press conference, taking an awkward stab at damage control. \"But there\u0027s probably beer in the red cups.\"  \"In hindsight, I probably should have assumed there was drinking and talked to the chaperones about what they thought was appropriate,\" he explained.  The equivocating explanation did little to quell the mounting outrage. Mothers Against Drunk Driving, a high-profile national group, released a statement saying the organization was \"disheartened\" to hear that Gansler \"may have attended an underage drinking party.\"  \"As a member of the executive committee of the National Association of Attorneys General and former chair of the organization\u0027s Youth Access to Alcohol Committee, he serves as a leader on this issue,\" the statement explained.  Indeed, Gansler has carved out a public role for himself as a crusader against underage drinking and drunk driving. In 2002, he was awarded the MADD \"Hero Award\" for his advocacy against drunk driving. He also appeared in a 2012 video for the Century Council, an organization that combats teen drinking. \"Parents, you\u0027re the leading influence on your teen\u0027s decision not to drink,\" he said in the video. \"It\u0027s never too early to talk with your kids about smart ways to say no.\"\n\n Despite the disappointment and umbrage from some quarters, Gansler is also drawing defenders. Some have cited the ground rules laid down by the chaperones of the party to argue that Gansler and the other parents who chipped in to rent the beach house made a good-faith effort at responsible parenting.  The parents, for example, arranged for two fathers to chaperone the party on each night, according to planning documents obtained by the Baltimore Sun. They explicitly barred the boys from driving, having girls behind closed doors, or drinking hard alcohol.  Gansler has said he did not help write the rules, but he was at a meeting during which the parents discussed them.  And the regimen they set up, some say, is exactly the kind of realistic but responsible parenting that others would be well-served to emulate.  \"If his explanation is accurate, the plain fact is that Gansler and the other parents who helped organize their kids\u0027 trip to the Eastern Shore were being entirely sensible,\" wrote Slate\u0027s Dan Kois. \"A group of parents rented a house for their sons the week after high school graduation--Beach Week, in Maryland schools parlance--and laid out an extremely well-thought-out set of rules for the boys.\"  \"There is of course a 100 percent chance that teenagers at Beach Week are going to drink and be idiots,\" Kois explained. \"As a parent, there are three ways to handle this situation: You can, understandably, forbid your children from attending at all. On the other side of the scale, you can just send your children off to Ocean City and hope their common sense will keep them out of trouble. Or you can make the tactical decision to oversee the festivities and keep things from getting out of hand: keep kids off the road, keep them out of each other\u0027s pants, and keep them from doing shots. Would that all parents of teens were so \u0027permissive\u0027!\"  The Baltimore Sun\u0027s editorial team offered a similarly nuanced take. \"Perhaps it would have been wise as a gubernatorial candidate for Mr. Gansler to forbid his son from going to beach week altogether, but any parent of a teen-ager will tell you that\u0027s easier said than done,\" the paper said. \"In the context of what many, many Maryland parents do, though, the approach Mr. Gansler and the other parents took is relatively reasonable.\"  \"Mr. Gansler may no longer be a perfect messenger on the subject of underage drinking, but he has the potential to be a very human one,\" the paper added.  ",
  "category": "POLITIC"
}