{
  "url": "http://www.cbsnews.com/8301-250_162-57609083/why-would-anyone-run-for-congress-these-days/",
  "title": "Why would anyone run for Congress these days?",
  "data": " When Rep. Bill Young -- who passed away last week -- announced earlier this month that he planned to retire, national Republicans wasted little time before calling Jack Latvala about running for the seat in Florida\u0027s competitive 13th District.  A longtime state senator who represents more than two-thirds of the U.S. House district in Clearwater, Latvala had the look of a sure-fire front-runner who could hold the seat for the Republican Party.  But Latvala didn\u0027t return the recruiters\u0027 phone call.  \"I make an impact on things in Tallahassee on a daily basis,\" he told RealClearPolitics. \"I couldn\u0027t make much of an impact in Washington.\"  Bill Cole, a Republican state senator from West Virginia, is another state-level rising star who has said \"thanks, but no thanks\" to a shot at the big time in Washington. He recently received an in-person pitch to consider running for Congress against vulnerable Democratic Rep. Nick Rahall in the state\u0027s 3rd District. Members of the National Republican Campaign Committee showed up at his capitol office in Charleston and gave him the \"rock star\" treatment, he says, promising that the seat would be the Republicans\u0027 top target in the entire country.  But Cole wasn\u0027t interested, citing family concerns. He will instead chair the campaign of another state senator, Evan Jenkins, who recently switched parties to run against Rahall.  \"I felt I could be a bigger fish in a smaller pond, and truly make a difference in Charleston,\" he told RCP. \n\n\n\n\n\n\nPlay Video\nWhy would anyone run for Congress?\n\n\n\n\n\n\n\n\nPlay Video\nPublic overwhelmingly disapproves of Congress during shutdown\n\n\nLatvala cited other reasons for passing on the opportunity to succeed Young, who died Oct. 18 at age 82: the national Republican Party\u0027s poor standing in public opinion polls and his own lack of interest in being just one of 435 representatives in the House.  He also offered a more basic explanation for staying put in Florida: \"I don\u0027t think I\u0027d have fun in Washington. I know it might be politically incorrect to say that they\u0027re beyond help up there, but it certainly doesn\u0027t look encouraging.\"  It\u0027s not just top Republican recruits who are turning down their national campaign committees\u0027 overtures to run for Congress. In the aftermath of the government shutdown and with a year to go until the 2014 midterms, high-level officials from both parties have voiced private -- and, at times, public -- concern that the quality of prospective candidates is dwindling.  National Democrats argue that the current political climate is better for their recruiting efforts -- especially in House races -- since the GOP\u0027s poll numbers are particularly abysmal and people are tired of divided government. But they, too, aren\u0027t immune from highly sought-after recruits saying they\u0027d rather do just about anything else than serve in one of the nation\u0027s least respected institutions.  While the job may remain prestigious to a certain extent, being a member of Congress is far from the best way to become an admired figure in one\u0027s community. Arizona Sen. John McCain likes to joke that the only people in support of Congress these days are blood relatives and paid staffers, and polls show that he\u0027s not far off the mark: In the latest RealClearPolitics polling average, just 9.2 percent of survey respondents approve of Congress, while 84.2 percent disapprove.  Perhaps as striking, an ABC News/Washington Post poll released on Tuesday showed Americans\u0027 support of their own U.S. representative to be underwater (43 percent approval to 47 percent disapproval) for the first time on record.  Poll: Post-shutdown, Congress disapproval at all-time high Time stands still in Washington, D.C. \n Asked in a brief interview why anyone with other attractive options would want to join his legislative body, Ohio Sen. Rob Portman joked, \"It\u0027s a bad time to ask\" before settling on the oft-repeated refrain that doing so presents \"an opportunity to serve.\"  Former Rep. Tom Davis of Virginia, who chaired the NRCC from 1998 to 2002, said appealing to that sense of service helps persuade some candidates to hop off the fence, but not always.\n\n\n\n\n\n\nPlay Video\nSchieffer: Time stands still in Washington, D.C.\n\n\n Davis recalled his efforts to convince Rhode Island attorney Jeffrey Pine to run. He took him to several dinners and even to the Major League All-Star Game at Fenway Park, and tried to sway him with polling that showed him beating the incumbent. \"Finally, he said, \u0027I have a good marriage and a pretty good life,\u0027\" and declined.  Taylor Griffin has had a pretty good life, as well. After completing high-level stints as an aide to George W. Bush, a Treasury Department official, and crisis manager for the McCain/Palin campaign in Alaska, business was booming at Hamilton Place Strategies -- the Washington, D.C.-based consulting firm that Griffin co-founded three years ago.  An earnest and affable bachelor who lacks the forced charisma and wheeler-dealer persona common among his ilk, Griffin, 38, was set to enter his prime in the upper echelons of the lucrative political consulting business. Then one day, someone suggested that he consider trying to join a group less popular among Americans than colonoscopies, cockroaches, root canals, and even the much-maligned rock band Nickelback: the U.S. Congress.  More comfortable pulling the levers of power behind the scenes than standing in the spotlight, Griffin needed neither an ego boost nor an opportunity to hobnob with the Beltway elite, with whom he was already well acquainted. He was also well aware of how intractable Washington politics has become, and how little one of 435 members of one half of one branch of government could expect to accomplish.  Nonetheless, Griffin sold his stake in the business and filed his candidacy earlier this month to challenge incumbent Republican Rep. Walter Jones in North Carolina\u0027s 3rd District, where he had grown up. Though he describes his time on the campaign trail thus far in glowing terms, it is clear that Griffin has not completely shaken his mixed feelings about this life decision.  \"Electoral politics is a brutal, soul-sucking experience for a candidate,\" he said in an interview with RCP in between campaign stops across the coastal district. \"But what it came down to was the question of whether or not I had a particular set of skills that could do something to help what I love most in the world, which is my home.\"  The sentiment is a noble-minded one, but with partisan gridlock as intractable as at any time in recent U.S. political history and the public\u0027s regard for the legislative branch of government hovering in margin-of-error territory, the question remains: Why would Griffin -- or anyone else, for that matter -- want to put themselves through this?        no previous page     next    1/2  ",
  "category": "POLITIC"
}