{
  "url": "http://www.cbsnews.com/8301-207_162-57609382/kate-winslet-brings-a-chill-to-divergent/",
  "title": "Kate Winslet brings a chill to \"Divergent\"",
  "data": "   The upcoming teen sci-fi thriller \"Divergent\" is currently in post-production, and the big-budget film, based on a wildly popular young adult book of the same name, is poised to dominate the youth demo when it comes out.  However, it\u0027s not just the bevy of teenage stars that set this film up for success. Bringing gravitas and commanding stoicism to the tale are seasoned pros Ray Stevenson and the beautiful Kate Winslet.  PICS: Check out Hollywood\u0027s hottest movie posters  The movie is a futuristic look at a dystopian society in which people are divided into five factions, each based on some lauded human virtue. Specifically intelligence, bravery, honesty, selflessness and peacefulness.  As it turns out, the hero of the film, a young girl named Tris, played by Shailene Woodley, is \"divergent,\" meaning she doesn\u0027t fit into any one faction, making her a threat to the way society is organized.  Winslet plays Jeanine Matthews, the no-nonsense and fascistic leader of the Erudite faction, the faction based on intelligence. She is a vicious and conniving political monster and serves as the cold and calculating antagonist of the film.  RELATED: New \"Divergent\" trailer: Tris is in trouble  Just looking at her in these scenes you get a real sense of the power she brings to the character and the moralistic weight she brings to the film.  Check out the video for a sneak peak at some of Winslet\u0027s intense moments from \"Divergent,\" and hear from the cast of the film, including Miles Teller, Zoe Kravitz, Shailene Woodley and Ray Stevenson, on what it was like shooting the movie, and what makes this story stand out from the other young adult fiction films we\u0027ve all seen in recent years.  \"Divergent\" is set to hit theaters Friday, March 21, 2014.  ",
  "category": "ENTERTAINMENT"
}