{
  "url": "http://www.cbsnews.com/8301-505267_162-57609056/bill-daley-firing-secretary-kathleen-sebelius-like-firing-captain-smith-on-the-titanic-after-it-hit-the-iceberg/",
  "title": "Bill Daley: Firing Secretary Kathleen Sebelius \"like firing Captain Smith on the Titanic after it hit the iceberg\"",
  "data": " (CBS News) Health and Human Services Secretary Kathleen Sebelius is in hot water over the rollout of the Affordable Care Act, but according to Bill Daley, President Obama\u0027s former chief of staff and a CBS News contributor, firing her over the problems with the Obamacare website would do little for the country now.   \"To me, that\u0027s kind of like firing Captain Smith on the Titanic after it hit the iceberg,\" he said. \"It\u0027s not going to do much right now. I think they\u0027ve got to get it fixed. I think they\u0027ve got to get it straightened out. And then there\u0027s the question, obviously, whether there needs to be new leadership at that department, not only with the secretary but other things going forward. I think she is in a tough situation right now, but the bottom line is they\u0027ve got to get this working.\"  Daley added that Sebelius is being held accountable because the rollout was under her watch.   \"It\u0027s a big embarrassment,\" he said. \"It will be corrected. It will take time. I think you\u0027ll see the hearings today and next week to some degree, probably, turn into the typical sort of political sideshow, but the real question is what happened here and how did a program that is so vital to the country get screwed up this way at the beginning?\"  The issues with Obamacare may also threaten the president\u0027s other initiatives, but Daley said the president has to focus on moving forward. He said, \"The president has to, as he will today, move on to immigration and other issues because he can\u0027t just get stuck on this issue for the next number of weeks.\"  Turning to another issue facing the president - the NSA surveillance scandal and new allegations from world leaders such as German Chancellor Angela Merkel about spying - Daley acknowledged the allegations are damaging for the president and the United States\u0027 relationship with those countries. \"It makes for a very difficult situation with some of our best allies, obviously,\" he said. \"I think the White House has said directly that they did not target, obviously, the chancellor. She is a, not only an ally, but a friend of the president\u0027s.\"  \"CBS This Morning\" co-host Norah O\u0027Donnell pointed out, \"But what Jay Carney said is they are not currently (spying on her) nor will they in the future.\"  Daley said, \"But targeting is different from sweeping up lots of information that we do.\"  \"CTM\" co-host Charlie Rose asked, \"You don\u0027t believe they tapped the phone of the chancellor?\"   \"I don\u0027t know for a fact, but there\u0027s no question she is an ally, a friend,\" Daley said. \"But it is very damaging. There is no question that some of our best friends in the world are now wondering whether or not we were not only tapping their leaders but we were using the information in negotiations and discussions, which is very difficult going forward.\"   For more with Daley, watch his full interview above.  ",
  "category": "POLITIC"
}