{
  "url": "http://www.cbsnews.com/8301-201_162-57609242/foreign-cooperation-with-u.s-could-be-exposed-officials-fear/",
  "title": "Foreign cooperation with U.S. could be exposed, officials fear",
  "data": " WASHINGTON Two Western diplomats say U.S. officials have briefed them on documents obtained by former National Security Agency contractor Edward Snowden that might expose the intelligence operations of their respective countries and their level of cooperation with the U.S. \t Word of the briefings by the Office of the Director of National Intelligence comes amid questions swirling around overseas surveillance by the National Security Agency, which has angered allies on two continents and caused concern domestically over the scope of the intelligence-gathering. \t The two Western diplomats said officials from ODNI have continued to brief them regularly on what documents the director of national intelligence believes Snowden obtained. \t The diplomats spoke on condition of anonymity because they were not authorized to discuss the intelligence briefings publicly. \n\n\n\n\n\n\nPlay Video\nSnowden leak \"most serious leak\" in U.S. intel history, fmr. CIA official says\n\n\nMike Morell, recently retired as the CIA\u0027s Deputy Director after 33 years, told CBS News senior correspondent John Miller in an upcoming \"60 Minutes\" interview that the damage that was done by Snowden was historic.  \"I do not believe he was a whistleblower. I do not believe he is a hero,\" Morell told Miller. \"This is the most serious compromise of classified information in the history of the U.S. intelligence community.\"  Morell cited the disclosure of the CIA\u0027s so-called \"black budget\" memo as perhaps the most damaging of Snowden\u0027s leaks.  \"The real damage of leaking that document was that certainly (adversaries) could focus their counter-intelligence efforts on those places where we\u0027re being successful and not have to worry so much on those places where we\u0027re not being so successful,\" Morell said. \t The Washington Post, which first reported on the matter Thursday evening, said some of the documents Snowden took contain sensitive material about collection programs against adversaries such as Iran, Russia and China. Some refer to operations that in some cases involve countries not publicly allied with the United States. \t The Post said the process of informing officials about the risk of disclosure is delicate because in some cases, one part of the cooperating government may know about the collaboration, but others may not. \t Meanwhile, the government of Germany said Friday that German officials will travel to the U.S. \"shortly\" for talks about spying allegations, including whether Chancellor Angela Merkel\u0027s cellphone was monitored by the NSA. \t The heads of Germany\u0027s foreign and domestic intelligence agencies will participate in the talks with the White House and NSA, government spokesman Georg Streiter said - though he later said the exact composition of the team had yet to be determined. \t He did not give a specific date for the trip, saying it was being arranged on \"relatively short notice.\" \t Lisa Monaco, assistant to the president for homeland security, wrote in a USA Today op-ed published Friday that \"no one disputes the need for careful, thorough intelligence gathering. Nor is it a secret that we collect information about what is happening around the world to help protect our citizens, our allies and our homeland. So does every intelligence service in the world.\" \t \"Today\u0027s world is highly interconnected, and the flow of large amounts of data is unprecedented,\" Monaco wrote. \"That\u0027s why the president has directed us to review our surveillance capabilities, including with respect to our foreign partners. We want to ensure we are collecting information because we need it and not just because we can.\" \t \"An ongoing review is the right approach because at the end of the day you want to make sure your resources are being used where you need them the most,\" Sen. Marco Rubio, R-Fla., said on CNN Friday. \t \"These leaders are responding to domestic pressures in their own country,\" said Rubio, a member of the Senate Intelligence Committee. \" ... Everyone spies on everybody. That\u0027s just a fact. Whether they want to acknowledge that publicly or not, every country has different capabilities but at the end of the day, if you are a U.S. government official traveling abroad, you are aware anything you have on your cell phone, iPad, could be monitored by foreign intelligence agencies, including that of your own allies.\" \t \"A lot of what you\u0027re seeing is for the domestic consumption of their own public,\" the senator said. \"But at the end of the day, everyone knew there was gambling going on in Casablanca..\"    ",
  "category": "POLITIC"
}