{
  "url": "http://www.cbsnews.com/8301-250_162-57609341/healthcare.gov-will-work-smoothly-by-end-of-nov-hhs-says/",
  "title": "HealthCare.gov \"will work smoothly\" by end of Nov., HHS says",
  "data": " Acknowledging several dozen major problems with HealthCare.gov, the Health and Human Services Department on Friday promised that the federal Obamacare site will be vastly improved within a month.  \"By the end of November HealthCare.gov will work smoothly for the vast majority of users,\" Jeff Zients told reporters on a conference call. President Obama announced earlier this week that Zients would lead the \"tech surge\" that\u0027s focused on improving the site, which serves 36 states.  \"It\u0027ll take a lot of work and there are a lot of problems that need to be addressed, but let me be clear: HealthCare.gov is fixable,\" Zients said.  Obamacare: Medicaid enrollment outpacing private insurance Did White House Obamacare guidance stop ahead of 2012 election? HealthCare.gov architects: Govt\u0027s pre-launch testing insufficient  The problems with the site fall into two categories, Zients said: performance problems that visitors would notice such as the site\u0027s speed and response time, and functional problems such as bugs that prevent the site\u0027s software from working properly. There are \"dozens of items on both sides,\" he said.  HHS is hiring QSSI, one of the private firms that helped build the site, to serve in a \"general contractor\" role to oversee the process of fixing the site. Julie Bataille, a spokeswoman for the Centers for Medicare \u0026 Medicaid Services (CMS) said the HHS is modifying an existing contract with QSSI to pay them for their new role.  QSSI helped build the data hub, a routing system through which HealthCare.gov and other, state-run Obamacare sites verify an applicant\u0027s information with agencies like the Social Security Administration and the IRS. The data hub is running smoothly, HHS says. QSSI also helped build a tool used in the HealthCare.gov\u0027s registration process. That tool did not work smoothly when the site launched, but QSSI told Congress on Thursday it\u0027s now performing well.  While the president has promised to put the best and the brightest on the task of fixing HealthCare.gov, the administration has declined to say who else besides Zients and QSSI is on the job. Bataille told reporters Friday, \"We want these people heads down, 24/7, focused on the work we brought them in to do.\"  Zients and Bataille maintained that significant progress has already been made since the site launched on Oct. 1. For instance, Zients said, few people at first could even create an account on HealthCare.gov, but visitors are now able to create an account over 90 percent of the time.  Health policy experts told CBSNews.com that the administration has until around Thanksgiving to fix the site before it could create serious enrollment issues, which would siginficantly undermine the new market.  While the administration works on fixing the site, it\u0027s coming under considerable heat from Congress. The private contractors who helped build the site, including QSSI, took pointed questions from both Democrats and Republicans on the House Energy and Commerce Committee in a five-hour hearing. The hearing was just the first in a series of hearings that will scrutinize the botched website rollout. HHS Secretary Kathleen Sebelius is slated to testify before the House Energy and Commerce Committee next week. \n\n\n\n\n\nPlay Video\nObamacare: Medicaid enrollment outpacing private insurance could cause serious issues\n\n Sebelius couldn\u0027t testify this week because she\u0027s been traveling the country to promote the law. She visited Austin, Texas, on Friday, where she promised to review the performance of contractors who helped build the site. On Thursday, she visited a health center in Phoenix, Arizona, where she pushed back against the several Republicans calling on her to resign.  \"The majority of people calling for me to resign I would say are people who I don\u0027t work for and do not want this program to work in the first place,\" she said. \"I have had frequent conversations with the president and I\u0027ve admitted to him that my role is to get the program up and running and we will do just that.\"  Republicans have seized on the remarks to further attack Sebelius.  \"It is amazing that the Obama Administration doesn\u0027t understand that their bosses are the American people,\" Republican National Committee Chairman Reince Priebus said in a statement. \"Maybe that is why the administration continues to push this train wreck of a healthcare law and refused to heed years of warning signs that ObamaCare was the wrong prescription to fix America\u0027s healthcare problems.\"  Given the continued problems with the site, some members of Congress want the administration to extend the open enrollment period for Obamacare, which is currently slated to last through March 31. On Friday, a group of 10 Democrats led by Sen. Jeanne Shaheen, D-N.H., sent a letter to Sebelius asking her to extend the period.  \"Extending this period will give consumers critical time in which to become familiar with the website and choose a plan that is best for them. Individuals should not be penalized for lack of coverage if they are unable to purchase health insurance due to technical problems,\" said the letter, signed by Shaheen and Sens. Mark Begich, D-Alaska; Mark Pryor, D-Ark.; Mary Landrieu, D-La.; Kay Hagan, D-N.C.; Dianne Feinstein, D-Calif.; Mark Udall, D-Colo.; Tom Udall, D-N.M.; Michael Bennet, D-Colo.; and Martin Heinrich, D-N.M.  ",
  "category": "POLITIC"
}