{
  "url": "http://www.cbsnews.com/8301-250_162-57609109/obama-to-house-gop-pass-immigration-reform-this-year/",
  "title": "Obama to House GOP: Pass immigration reform this year",
  "data": " In an attempt to re-start movement on the rest of his domestic agenda, President Obama on Thursday called on the House of Representatives to move legislation to reform the immigration system before the end of the year. \"This is not just an idea whose time has come, this is an idea whose time has been around for years now,\" Mr. Obama said. \"It\u0027s good for our economy, it\u0027s good for our national security, it\u0027s good for our people, and we should do it this year.\"His speech came at the same time as the House Energy and Commerce Committee held a hearing on the flawed rollout of the Affordable Care Act exchanges. The last major legislative action on an immigration bill was passage of the Border Security, Economic Opportunity, and Immigration Modernization Act, the Senate\u0027s comprehensive legislation, back in June. The bill beefed up security along the southern border, provided a provisional legal status and eventual pathway to citizenship for people living in the country illegally, and outlined reforms for the existing visa programs.  Crafted by a bipartisan group in the Democratically-controlled Senate, that is Mr. Obama\u0027s preferred reform bill. But it didn\u0027t take long for House Speaker John Boehner, R-Ohio, to declare the bill a non-starter for House Republicans and to promise the lower chamber would produce its own bill. At a press conference earlier this week, Boehner said, \"I still think immigration reform is an important subject that needs to be addressed. And I\u0027m hopeful.\" After Mr. Obama\u0027s speech, Boehner spokesman Brendan Buck added, \"\"The Speaker agrees that America has a broken immigration system and we need reform that would boost our economy. He\u0027s also been clear that the House will not consider any massive, Obamacare-style legislation that no one understands. Instead, the House is committed to a common sense, step-by-step approach that gives Americans confidence that reform is done the right way. We hope that the president will work with us - not against us - as we pursue this deliberate approach.\" \nAre the tides turning for immigration reform in the House?\nHouse Democrats arrested during immigration protest  How exactly the House will move forward is unclear. But House Judiciary Committee Chairman Bob Goodlatte, R-Va., has advanced a series of single-issue bills that have no Democratic support, and House Democrats introduced a version of the Senate bill that includes a border-security plan with bipartisan support in the House. A bipartisan working group that had been crafting a comprehensive bill for the House collapsed last month. Republicans are also likely to argue that Mr. Obama poisoned the well with the government shutdown. Rep. Raul Labrador, R-Idaho, who was once a member of the bipartisan group, now says that it would be \"crazy\" and \"a very big mistake\" for Republicans to negotiate with the president on immigration reform. To those who \"who are primed to think \u0027well if Obama\u0027s for it, I\u0027m against it,\u0027\" Mr. Obama said, \"I would remind everybody that my Republican predecessor was for [immigration reform] when he proposed reforms like this almost a decade ago.\" \"I\u0027m not running for office again. I just believe this is the right thing to do....everybody wins here if we work to get this done,\" Mr. Obama added, arguing that good policy made for good politics, even for the Republicans. And there are some Republicans who appear to be focusing on further legislation despite the larger budget battles being waged. \"Congressman Issa is currently working on a proposal that would offer temporary status for some qualifying aliens already present,\" an Issa spokesman told CBSNews.com. Broadly, the legislation would grant temporary legal status to some immigrants in the U.S. illegally and allow six years for those who meet certain criteria to apply for a work or family visa without returning to their home countries. Those who could not find an existing channel to gain a visa within the six-year time frame -- or prove they would not be an economic burden on the U.S. - will have to return to their home countries. It\u0027s the first bill from Republicans that deals with the estimated 11 million immigrants living in the U.S. without permission from the government. Other bills deal with existing visa programs and border security legislation, which falls short of the kind of broad package Democrats and the administration say is necessary to fix the broken immigration system. Passing anything through the House, though, will be difficult. Some Republicans remain opposed to anything that offers even legal status to people who entered the country illegally or overstayed legal visas and are now living in the U.S. without papers. No aides were able to say when the bills that have passed out of the various committees might receive a vote. And Democrats have insisted they will not accept anything short of legislation that offers an eventual pathway to citizenship.  \"Anyone still standing in the way of this bipartisan reform should at least have to explain why. A clear majority of the American people think it\u0027s the right thing to do,\" Mr. Obama said. A July CBS News poll that asked about immigration found that 78 percent of people surveyed were in favor of providing a path to citizenship for illegal immigrants in the U.S. if they meet certain requirements, including a waiting period, paying fines and back taxes, passing criminal background checks and learning English - roughly the outlines of the Senate bill requirements. The stakes are high for the president, too. Immigration activists have grown frustrated with the administration\u0027s record-level deportations - 392,000 people in 2011, according to the Pew Research Center -- and are calling on the president to freeze the policy.  But Mr. Obama told Telemundo last month that to do that \"would be ignoring the law in a way that would be very difficult to defend legally.\"    ",
  "category": "POLITIC"
}