{
  "url": "http://www.cbsnews.com/8301-250_162-57609277/paul-ryan-harry-reid-agree-no-major-budget-deal-foreseen/",
  "title": "Paul Ryan, Harry Reid agree: No major budget deal foreseen",
  "data": " On this, GOP budget guru Rep. Paul Ryan and top Senate Democrat Harry Reid can agree: There won\u0027t be a \"grand bargain\" on the budget.  Instead, the Wisconsin Republican and the Nevada Democrat both say the best Washington can do in this bitterly partisan era of divided government is a small-ball bargain that tries to take the edge off of automatic budget cuts known as sequestration.  Official Capitol Hill negotiations start next week, but Ryan and Reid both weighed in Thursday to tamp down any expectations that the talks might forge a large-scale agreement where several previous high-level talks have failed.  Long-standing, entrenched differences over taxes make a large-scale budget pact virtually impossible, according to lawmakers, their aides and observers who will be monitoring the talks.   Obama to House GOP: Pass immigration reform this year Poll: Post-shutdown, Congress disapproval at all-time high \n Republicans say they simply won\u0027t agree to any further taxes atop the 10-year, $600 billion-plus tax increase on upper-income earners that President Barack Obama and Democrats muscled through Congress in January. Without higher taxes, Democrats say they won\u0027t yield to cuts in benefit programs like Medicare.  \"If we focus on some big, grand bargain then we\u0027re going to focus on our differences, and both sides are going to require that the other side compromises some core principle and then we\u0027ll get nothing done,\" Ryan, who chairs the House Budget Committee, said in an interview Thursday. \"So we aren\u0027t focusing on a grand bargain because I don\u0027t think in this divided government you\u0027ll get one.\"  In an interview Thursday with Nevada public radio station KNPR, Reid, the Senate majority leader, agreed that a large-scale grand bargain wasn\u0027t in the cards.  \"They have their mind set on doing nothing, nothing more on revenue, and until they get off that kick, there\u0027s not going to be a grand bargain,\" Reid said. \"We\u0027re just going to have to do something to work our way through sequestration.\"  Ryan, his party\u0027s vice presidential nominee a year ago, and Senate Budget Committee Chairwoman Patty Murray, D-Wash., are two of the key congressional figures in the talks. They both say they\u0027re seeking common ground between the sharply different Republican and Democratic budgets.  Common ground, however, is a much different concept than compromise. It involves finding ideas upon which they can agree rather than compromising principles such as Republican opposition to tax increases or the unwillingness by many Democrats to consider cutting future Social Security benefits by decreasing the annual cost-of-living adjustments.  Instead of a broad agreement encompassing tax hikes and structural curbs on the growth of benefit programs like Medicare and Medicaid, Ryan says he\u0027s seeking a \"smaller, more achievable objective.\"  The talks, he said, also will focus on alleviating another upcoming round of automatic spending cuts and replacing them with longer-term cuts.  Sequestration mostly hits so-called discretionary spending, the money approved by Congress each year to run agency operations. Ryan wants to cut autopilot-like spending on entitlement programs like Medicare to ease sequestration\u0027s effects on both the Pentagon and domestic programs.  \"I think we all agree that there\u0027s a smarter way to cut spending\" than sequestration, Ryan said. \"If I can reform entitlement programs where the savings compound annually ... that is more valuable for reducing the debt than a one-time spending cut in discretionary spending.\"  The automatic spending cuts are required because a 2011 deficit-reduction supercommittee failed to reach an agreement. The cuts would carve $91 billion from the day-to-day budgets of the Pentagon and domestic agencies in 2014 compared with the spending caps set by a 2011 budget deal. The Pentagon would absorb almost 60 percent of the cuts.  While the first official meeting of the larger House-Senate negotiating team is scheduled for next week, Ryan and Murray have been talking already.  Republicans are looking at a bushel basket of cuts to Medicare health care providers contained in Obama\u0027s budget. They also have voiced support for curbing Social Security cost-of-living adjustments, an idea Obama has backed, but only in the context of a broader deal in which Republicans would allow tax increases. That proposal won\u0027t fly in the current talks.  There are also several supercommittee ideas like curbing Postal Service cost overruns, making federal workers contribute more to their pensions and raising premiums on higher-income Medicare beneficiaries.  Democrats, meanwhile, are wary of using cuts to Medicare and other entitlement programs to ease cuts in the defense budget. Negotiators still might explore curbing generous military retirement, health care and prescription drug benefits as a way to restore cuts to readiness and procurement of weapons systems.  \"Congressional Democrats and the White House, rightly in my view, don\u0027t want to use domestic entitlement cuts to offset easing or eliminating the defense side of sequestration on top of the nondefense discretionary side,\" said Robert Greenstein, president of the Center on Budget and Policy Priorities.  ",
  "category": "POLITIC"
}