{
  "url": "http://www.cbssports.com/golf/eye-on-golf/24128213/could-tiger-woods-still-sue-brandel-chamblee",
  "title": "Could Tiger Woods still sue Brandel Chamblee?",
  "data": "  Tiger Woods likely won\u0027t pursue legal action against Brandel Chamblee. (USATSI) More Golf: Leaderboard | Rankings | Schedule | Expert Picks | Equipment | FedEx CupThe Brandel Chamblee-Tiger Woods feud has been ended, for now, on Chamblee\u0027s end.But we haven\u0027t heard from Mark Steinberg or Tiger Woods, the former of whom said last week that legal action might be in the cards because of the nature of what Chablee wrote -- essentially portraying Woods as a cheater.Is legal action a viable option for Woods though? Chamblee didn\u0027t seem to think so on Tuesday. \"I thought it incomprehensible that anyone with the slightest understanding of libel laws wouldn\u0027t know the definition of and the difference between libel and opinion.\"Is he right?I asked attorney Sia Nejad who has worked on various defamation cases for the legal firm Kubicki Draper in Florida (where Woods lives, coincidentally).He had some really interesting thoughts on the matter.Here they are:\"Public figure cases are harder to prove than private figure cases (the main difference being that in public figure cases, one must show \u0027actual malice\u0027 by the author).More importantly truth is always a defense in defamation cases. The fact that Chamblee is referring to actual events in his article makes this a very weak defamation case for Tiger.The fact that Steinberg says, \u0027Tiger accepted his penalty and moved on\u0027 does not mean that a rules violation didn\u0027t take place (on multiple occasions this year). By analogy, we wouldn\u0027t say Ryan Braun is not a cheater because he accepted his suspension and is moving on. Perhaps that is an unfair analogy but conceptually we are still talking about rules violations.I should also note that Steinberg\u0027s assessment that \"there was no intention to deceive anyone\" is entirely subjective and irrelevant in the context of whether he actually cheated or not.Bottom line is that pointing out that someone broke the rules and then calling them a cheater, albeit indirectly, is not out of bounds in any way.The statement can either be construed the following ways:1. As an opinion, and therefore not defamatory.2. As a factual statement based upon actual events.Either way, it\u0027s not defamation.It should also be mentioned that in any defamation case, one must prove damages (actual monetary damages or reputational damages). If there are no damages, there is no case. What would be the damages in this case?Everyone knows that Tiger violated the rules at Abu Dhabi and at the Masters. The fact that Chamblee points this out is not new information that would cause the public to form an opinion any more negative than they already had.Therefore, damages seems to be a big hurdle even if Tiger were able to prove the initial elements of defamation.\"So for all intents and purposes this thing is over. I don\u0027t know if Steinberg\u0027s threats late last week encouraged Chamblee to apologize but they were clearly calculated. Tiger Woods doesn\u0027t hire people who don\u0027t know libel laws but he does hire people who know how to push a narrative and get what they want in a public forum.That\u0027s exactly what Steinberg, and by proxy Woods, did here, and you know what?It worked.For more golf news, rumors and analysis, follow @EyeOnGolf and @KylePorterCBS on Twitter or Google+ and like us on Facebook.",
  "category": "GOLF"
}