{
  "url": "http://www.cbssports.com/golf/eye-on-golf/24122714/golf-writer-stands-by-implication-that-tiger-woods-is-a-cheater",
  "title": "Golf writer stands by implication that Tiger Woods is a cheater",
  "data": "  Is Tiger Woods a cheater? (USATSI) More Golf: Leaderboard | Rankings | Schedule | Expert Picks | Equipment | FedEx CupGame on.Brandell Chamblee responded to Mark Steinberg\u0027s response about Chamblee\u0027s column about Tiger Woods last week in which Woods was given an \"F\" and Chamblee insinuated that he was a cheater.When asked if Steinberg\u0027s threat that the Woods camp might consider legal action against Chamblee had rattled him, he had a terse response.\"No.\"He also said he chose his words very carefully when writing about Woods\u0027s gaffe at the BMW Championship (video below).\"I think \u0027cavalier with the rules\u0027 allows for those with a dubious opinion of the BMW video,\" said Chamblee.Chamblee then clarified why he wrote the way he did about his fourth grade teacher who caught him cheating.\"My teacher in the fourth grade did not have a dubious opinion of how I completed the test. But she was writing to one, and as I was writing to many, I felt it important to allow for the doubt some might have, so I chose my words accordingly.\"What people want to infer about that is up to them,\" he said. \"I have my opinion, they can form theirs.\"Chamblee went on to say he thought the idea of legal action, as proposed by Woods\u0027 agent Steinberg, was actually somewhat ridiculous.\"I thought it incomprehensible that anyone with the slightest understanding of libel laws wouldn\u0027t know the definition of and the difference between libel and opinion.\"No matter either because Chamblee isn\u0027t backing down.\"I don\u0027t feel I\u0027m the one that needs to justify the \u0027F.\u0027 The BMW video does it for me, followed by Tiger\u0027s silence -- until confronted -- and then by his denials in the face of incontestable evidence to the contrary of his petitions.\"To say nothing of the fact that he was disrespecting his position in golf, the traditions of golf and his fellow competitors, in my opinion.\"\"I suspected there would be the usual assortment of divisive banter about me giving Tiger an \u0027F,\u0027 but as it turns out, it was a slow week in golf, so with not much to do, my column got more attention than it should have.\"\"I\u0027m paid to have and give an opinion, and I work hard to form those opinions based upon facts, not agenda,\" he said. \"I don\u0027t always get it right but I\u0027m always trying to get it right. And I know the people I work for know that.\"Well OK then.I can\u0027t wait until Tiger\u0027s first interview about this -- one can only hope it\u0027s with Golf Channel.For more golf news, rumors and analysis, follow @EyeOnGolf and @KylePorterCBS on Twitter or Google+ and like us on Facebook.",
  "category": "GOLF"
}