{
  "url": "http://www.cbssports.com/golf/eye-on-golf/24127623/golf-writer-apologizes-to-tiger-woods-for-insinuating-he-is-a-cheater",
  "title": "Golf writer apologizes to Tiger Woods for insinuating he is a cheater",
  "data": "  Tiger Woods has been a hot topic this offseason. Shocking, I know. (USATSI) More Golf: Leaderboard | Rankings | Schedule | Expert Picks | Equipment | FedEx CupBooo! The Brandel Chamblee-Tiger Woods feud was the best thing this golf offseason had going for it and now it\u0027s probably close to over.After standing by his comments on Tuesday morning Chamblee decided to reverse course and apologize to Woods via Twitter for insinuating that Tiger was a cheater last week in a Golf.com article.Here are those tweets:What brought me here was the realization that my comments inflamed an audience on two sides of an issue.— brandel chamblee (@chambleebrandel) October 23, 2013Golf is a gentleman\u0027s game and I\u0027m not proud of this debate. I want to apologize to Tiger for this incited discourse.— brandel chamblee (@chambleebrandel) October 23, 2013And no - I was not asked to apologize— brandel chamblee (@chambleebrandel) October 23, 2013My intention was to note Tiger\u0027s rules infractions this year, but comparing that to cheating in grade school went too far.— brandel chamblee (@chambleebrandel) October 23, 2013Wait, on Tuesday morning Chamblee said this:\"I suspected there would be the usual assortment of divisive banter about me giving Tiger an \u0027F,\u0027 but as it turns out, it was a slow week in golf, so with not much to do, my column got more attention than it should have.\"So he\u0027s essentially saying \"I knew what was going to happen and I stand by it!\" and \"I didn\u0027t know what was going to happen and I no longer stand by it!\" in the same day!I believe this is what folks in the business like to call \"backpedaling.\"The damage is already done, though. Chamblee can tweet an apology every hour from now until the Masters starts and it doesn\u0027t change the fact that he essentially called Tiger a cheater in front of the whole golf world.To apologize now is almost silly -- he might as well stick it out at this point.And you know who comes off looking great, as usual, and this time without even saying so much as one word about the entire topic? Tiger Woods.For more golf news, rumors and analysis, follow @EyeOnGolf and @KylePorterCBS on Twitter or Google+ and like us on Facebook.",
  "category": "GOLF"
}