{
  "url": "http://www.cbssports.com/general/writer/gregg-doyel/24137848/bravehearts-anyone-i-hope-youre-not-offended",
  "title": "Bravehearts, anyone? I hope you\u0027re not offended",
  "data": "God help me, I\u0027ve spent the last hour trying to decide if the team nickname \"Bravehearts\" would be offensive.Not that it seems offensive. It doesn\u0027t. Not to me, anyway. But once upon a time the nickname \"Redskins\" didn\u0027t seem offensive, either. When you\u0027re 9 years old, what do you know about offensive language disguised as an NFL franchise\u0027s nickname? You don\u0027t. So I didn\u0027t. It wasn\u0027t until recent years, when more and more people raised the issue and I started to think about the name \"Redskins\" -- really think about it, not just lazily fall back on what I thought at age 9 -- did it occur to me that, yes, that nickname sure could offend some folks.Now I\u0027m wondering the same about \"Bravehearts,\" now that the news has broken that Daniel Snyder\u0027s neighbor recently bought the patent for \"Washington Bravehearts\" and the domain name WashingtonBravehearts.com.Does this mean Snyder is changing Redskins to Bravehearts? We don\u0027t know. But I can tell you this:Maybe.What I can\u0027t tell you is whether \"Bravehearts\" is a safely non-controversial nickname, or whether it would be offensive to some folks. Maybe you can tell me.No doubt in my mind, the Atlanta Braves, Cleveland Indians and Washington Redskins -- and Syracuse Orangemen and Marquette Warriors and Elon Fightin\u0027 Christians -- were named with benign intentions, with no intent to offend. That doesn\u0027t change the fact that in some cases, those team names have offended. It took years for the offended to find their voice, or for their voice to be heard, but it happened and the three colleges I named have changed their nickname, while at least one of those professional sports franchises is possibly considering the same.But honestly, the whole thing is tiresome. That\u0027s my point here as I wonder whether \"Bravehearts\" will offend anyone. The word seems to be a reference to the 1995 Mel Gibson movie of the same name, a movie that glorifies an especially violent period of Scottish history. Maybe the Washington Bravehearts would offend people of Scotland heritage. I can\u0027t imagine it would, but then again I don\u0027t consider myself Scottish. My ancestors came from Scotland several centuries ago, but I consider myself neither Scottish nor Scottish-American. I\u0027m from this place. I\u0027m American, period and end of story, which means it\u0027s just not for me to say whether Bravehearts is offensive, just as it\u0027s not for non-Native Americans to say whether \"Redskins\" is offensive.If this is the new name for the Washington NFL franchise, I hope we can avoid the following political power play:1. Team has a name with arguably offensive roots.2. Critics point out those offensive roots, quoting people from the group who are offended.3. Defenders attack critics as politically correct liberal sheep, quoting people from the group who aren\u0027t offended. Or Rick Reilly\u0027s father-in-law.4. Repeat (2) and (3) ad nauseam. Heavy on the nauseam.The fight over the name \"Redskins\" has become tiresome, not that critics should give up the fight. If the name is hurtful to a portion of the Native American population, then the right thing to do is to keep up the fight until the tone-deaf dummy in charge changes the team\u0027s name.Is that tone-deaf dummy changing the name to Bravehearts? I don\u0027t know.Would Bravehearts be safely inoffensive?Lord I hope so.",
  "category": "NFL"
}