{
  "url": "http://www.cbssports.com/nfl/eye-on-football/24138483/for-the-gambler-in-you-week-7-cowboys-to-cover-clemens-to-fail",
  "title": "For the gambler in you, Week 8: Cowboys to cover, Clemens to fail",
  "data": "Each week, we\u0027ll take the best -- and most clever -- odds collected by Bovada for the upcoming week and give our take. This is important stuff, perhaps the most important post you\u0027ll read all week. Because if you can\u0027t lose money while watching a game in which you have absolutely no effect, what\u0027s the point of watching sports at all?Note: Home team is listed first in Against the Spread.Game One: Lions -3.5 vs. CowboysSunday, 1 p.m. ET, FOX2013 Against The SpreadOverall: 4-3Overall: 6-1Home: 2-1Home: 4-0Away: 2-2Away: 2-12013 Team RankingsPass offense: 5thPass defense: 29thRush offense: 21stRush defense: 12thPass defense: 27thPass offense: 8thRush defense: 22ndRush offense: 24thVerdict: This game features two of the top-four passers in the NFL this season (Detroit\u0027s Matthew Stafford is No. 3 with 2,129 yards and Dallas\u0027 Tony Romo is No. 4 with 2,010), so it would not shock to see this game develop into a shootout. Losing defensive end DeMarcus Ware won\u0027t help the Cowboys, but I like them to travel to Detroit and pull off the win. It\u0027s time for Dallas to take control of what\u0027s been a subpar NFC East and prove it\u0027s ready to make a playoff run with its $100 million quarterback. Beating the Lions on the road will go a long way toward doing that.Game Two: Bengals -6.5 vs. JetsSunday, 4:05 p.m. ET CBS2013 Against The SpreadOverall: 4-2-1Overall: 5-2Home: 3-0Home: 3-1Away: 1-2-1Away: 2-12013 Team RankingsPass offense: 9thPass defense: 9thRush offense: 18thRush defense: 2ndPass defense: 12thPass offense: 21stRush defense: 8thRush offense: 11thVerdict: As I wrote here, I\u0027m not exactly sure why the Jets are almost a touchdown underdog vs. the Bengals, who have been too inconsistent this season in order for me to feel good about picking them in this spot. While Geno Smith has been a little up and down, his continued improvement and his chemstry with his skill players will keep this game close. I think Cincinnati ultimately will win the game, but the Jets will keep it close enough to cover. Game Three (largest spread of week): Jaguars +16.5 49ers (in London)Sunday, 1 p.m. ET, FOX2013 Against The SpreadOverall: 1-6Overall: 5-2Home: 0-3Home: 3-1Away: 1-3Away: 2-12013 Team RankingsPass offense: 21stPass defense: 5thRush offense: 32ndRush defense: 17thPass defense: 13thPass offense: 30thRush defense: 31stRush offense: 3rdVerdict: Thus far this season, the Jaguars have been brutal on the road, and somehow, they\u0027ve been even more brutal at home. So, I\u0027m guessing they\u0027ll also be brutal while playing in London. Combine that with the 49ers offense playing well -- in the past four games, San Francisco has scored at least 30 points -- and this one might get ugly (just like most of Jacksonville\u0027s games, honestly). One piece of good news for Jacksonville: Chad Henne, who will start at quarterback, has been better than Blaine Gabbert. But that certainly doesn\u0027t mean I think Jacksonville will cover. I\u0027ll go 49ers.PROP BETSKellen Clemens -- Total passing yards Week 8 vs. Seattle  Over/Under   195½Clemens, who takes over for the Rams after quarterback Sam Bradford suffered a season-ending ACL tear last week, hasn\u0027t started an NFL game since 2011. He hasn\u0027t won a game as an NFL starter since 2009. In 12 career starts, Clemens has thrown for less than 195 years five times, and if you consider his rust and the fact Seattle\u0027s pass defense ranks second in the league by allowing 190.6 yards per game, I\u0027d advise you to go under, under, under.Jamaal Charles -- Will he record 100 or more combined rushing and receiving Yards and score a TD Week 8 vs. Cleveland? (Note: Charles has done this every game this season and is two away from O.J. Simpson\u0027s record of 9)Yes   -140 (5/7)No   EVEN (1/1)Charles quietly is having one of the best seasons of any running back in the league, and he has the most fantasy points of any other back in the NFL. Though the Browns have the seventh-best defense, they\u0027ve allowed the last two running backs they\u0027ve faced (Green Bay\u0027s Eddie Lacy and Detroit\u0027s Reggie Bush) to gain at least 100 total yards and score one touchdown (and in the game before that, Buffalo\u0027s Fred Jackson had 93 total yards and two scores). I think the opposing running back success streak will continue; go yes on this bet.Last week: 2-1 against the spread; 1-1 on prop bets. Overall this year: 12-9 against the spread, 9-8 on prop bets. Last two years: 38-44 against the spread; 43-25-1 on prop bets. See my picks and all the CBSSports.com experts here.",
  "category": "NFL"
}