{
  "url": "http://www.cbssports.com/nfl/writer/pat-kirwan/24142567/six-for-sunday-linemen-dropping-qbs-hurting-spells-messy-football",
  "title": "Six for Sunday: Linemen dropping, QBs hurting spells messy football",
  "data": "   Broncos tackle Orlando Franklin is helped off the field after getting injured against the Jaguars. (USATSI) Injuries are mounting at a very fast rate as I have discussed in recent articles. The number of players on injured reserve is close to double what it was a year ago at this time. The other injury storyline involves the number of players unable to play now but could be back in the weeks to come.A number of teams are really struggling to put five healthy offensive linemen on the field to protect the QB and open holes for the running game. Most teams in the NFL only activate seven offensive linemen for games and a few teams got to the seventh lineman in a hurry last week.One more injury and a tight end or a defensive lineman has to play on the offensive line. We all saw what the Broncos offense looked like last week with both starting offensive tackles sidelined and Peyton Manning getting a beating from the Colts. Jim Schwartz of the Lions told me this week he has three offensive tackles sidelined with injuries and he\u0027s hoping to get at least one back for the Dallas game.The Steelers are on a two-game winning streak but their offensive line is in a state of flux due to injuries as they travel to Oakland. The Giants lost center David Baas for the season last week, as if they didn\u0027t have enough problems. Sacks and quarterback injuries will continue to rise this week as teams patch together five semi-healthy linemen up front.Has Andy Dalton taken the next step?The Bengals have been to the playoffs in both of Andy Dalton\u0027s years in the league but both were one-and-done affairs. Dalton has yet to throw a touchdown pass in the playoffs which has led to much scrutiny this season about him being good enough to take this team very far.I\u0027m a big fan of Dalton but the proof is in the production. Well, in the past two weeks Andy Dalton has turned it up a notch. He has won both games and completed 50 of 74 passes (67.5 percent) for 709 yards and 6 touchdown passes.Now the Jets come to town and their defense is no joke. They have given up just one touchdown pass to Tom Brady and Ben Roethlisberger combined this year. The Jets have the No. 2 run defense and will force this game into Dalton\u0027s hands. I think he\u0027s ready for the next step but time will tell.Moment of truthA few teams will meet this week and a playoff wildcard berth could be at stake. Head-to-head games from this time of year can come back to haunt the loser. The Jets at Cincinnati game, Dallas at Detroit, and possibly the Dolphins at the Patriots could have long-term effects on the playoffs. Of course winning the division takes care of the head-to-head outcomes but wild card spots are another story. Keep a close eye on these games.Here come the Steelers!Not many teams can rebound from a 0-4 start but the Steelers aren\u0027t just any team. They are on a two game winning streak right now because they don\u0027t fall apart or hit a panic button when things are bad. They rely on their history and fundamentals.In the last two weeks the Steelers defense has returned to a unit reminiscent of old Steelers teams, giving up 11 points a game, 82 yards rushing a game. Big Ben has done his part, with no interceptions or fumbles the past two weeks and the run game has come alive with rookie running back Le\u0027Veon Bell. I talked to Bell this week and he really appreciates the Steeler way of doing things.As he said \"this team sticks together and we all accepted when Coach Tomlin got rid of distractions in the building and told me no more flips in the end zone.\"A win this week over the Raiders, and a loss by the Bengals and Browns next week and the Steelers are back.Another week of backup QBs ... I want a refund!Over the past two weeks 15 times a team had to play a backup or replacement quarterback from the beginning or during a game. The results have been awful as teams in that situation went 2-13.Now we see the Vikings return to Christian Ponder, Kellen Clemens takes the field for the Rams after throwing just 100 passes in the last four years. Jason Campbell starts for the Browns with a 31-40 record as a starter and really hasn\u0027t played much since a 2011 injury. He did play one game for the Bears last year and was sacked 6 times.Campbell averages a sack every 15 throws in his career. We already watched replacement QB Mike Glennon get his fourth straight loss on Thursday night and there are a few quarterbacks like Ryan Tannehill dealing with a sore throwing shoulder.A few facts to remember•As teams enter week 8 of the NFL season, keep these things in the back of your mind. Tom Brady has been sacked 13 times in the last three weeks. He hasn\u0027t been sacked 13 times over a 3 game stretch since 2001.•Atlanta may be criticized for a lack of pass rush this year but they have 7 sacks over the last two weeks and they play Carson Palmer this week who is sacked frequently.•The Dallas defense has lost a number of key players but have played great over the last two weeks. They have given up 19 points, 0 touchdown passes created 5 turnovers and logged 6 sacks. The Lions pass rush has been their trademark on defense in the Jim Schwartz era but things are changing. In 2011 they got a sack once every 16 pass plays, in 2012 1:17 and this year 1:22.•RG3 is back to his 2012 form. In the last two weeks RG3 has run the ball 20 times for 161 yards at 8.0 per run and he has 9 first downs using his feet. He also has dropped his pass attempts from 44 per game in the first five weeks back to his 2012 29 per game.•Finally after a two-game losing streak a month ago the 49ers returned to the tried and true formula of running the ball. In their four-game winning streak, the Niners have run for 698 yards and 9 rushing touchdowns.",
  "category": "NFL"
}