{
  "url": "http://www.cbssports.com/nfl/writer/pete-prisco/24137580/ten-things-from-nfl-week-8-that-intrigue-me",
  "title": "Ten things from NFL Week 8 that intrigue me",
  "data": "  The Steelers look like they\u0027re getting on a roll. (USATSI) Cowboys CB Brandon Carr vs. Lions WR Calvin Johnson:  Carr did a nice job last week on DeSean Jackson, but Johnson is a better player than Jackson. He is also bigger. Carr is a physical corner who has the size to try and match up with Johnson, but I still expect a lot of double from the Cowboys. When they are singled, it could be fun.Can Tom Brady get it going against the Dolphins? Brady sure hasn\u0027t looked like Tom Brady so far this season. The return of Rob Gronkowski helped last week, but he seemed too focused on getting him the ball. He needs to spread it around some. It is shocking to see how low he is ranked in the passing categories halfway through the season.Are the Steelers getting on a role? They have won two consecutive games and now head to Oakland to play a Raiders team that isn\u0027t that good. The Steelers opened with four consecutive losses, but now appear ready to make a strong push to get to. 500.Prisco\u0027s top picks Niners, Saints cover big numbers Will the Jaguars show up for their London fans? The Jaguars play the 49ers, the first of four games for them in London in the next four years, so they are banking on becoming London\u0027s team. But at 0-7, they don\u0027t give the fans much to like. The 49ers seem to be rolling again. Does this get ugly? Or do the Jaguars compete like they did against Denver a few weeks ago?Can Bengals QB Andy Dalton keep it going? Dalton has six touchdown passes the past two weeks and is coming off an impressive game at Detroit last week. The Jets are a good defense, so he will face a stiff challenge to try and keep his roll going.Can the Broncos bounce back? They lost for the first time last week at Indianapolis, and there is some talk that the Colts provided the blueprint to beating the Broncos. Denver should have a chance to bounce back big here on offense against a bad Washington defense.Will Mike Vick look like he did before his hamstring injury? Vick is back as the Eagles starter this week after missing two weeks. He faces a Giants defense that isn\u0027t very good. A big part of Vick\u0027s game is his ability to move around. Will he be limited at all by the hamstring?The return of Mike Shanahan to Denver: Shanahan won two Super Bowl with the Broncos, and then was fired. This is his first trip back as a head coach since then. He faces a tough challenge trying to beat Peyton Manning after Denver suffered its first loss last week.Vikings WR Greg Jennings against his former team, the Packers: It was Jennings who had some not-so-nice things to say about Aaron Rodgers and the Packers when he left to sign with Minnesota. Jennings backed off those comments this week, but you can bet the Packers won\u0027t let him forget them.Which new starter plays best, Kellen Clemens or Jason Campbell? Will either one of them play well? Both face tough challenges. Clemens and the Rams are at home against a good Seattle team, while Campbell is on the road at Kansas City. It won\u0027t be easy for either of them.",
  "category": "NFL"
}