{
  "url": "http://www.cbsnews.com/8301-207_162-57609353/britney-spears-writes-open-letter-thanking-fans/",
  "title": "Britney Spears writes open letter thanking fans",
  "data": " \n\nThe album artwork for Britney Spears\u0027 eighth studio album, \"Britney Jean.\"\n/\n\nBritney Spears\n\n Britney Spears has said her new album is a \"personal\" one, and it has a personal title (\"Britney Jean,\" her first and middle name), and the pop star is continuing that theme by penning a personal letter to her fans.  The handwritten note was posted on Spears\u0027 website Friday. In it, she talks about putting the finishing touches on the record and thanked fans for the support they\u0027ve given her.  \"I have been through a lot in the past few years and it has really inspired me to dig deeper and write songs that I think everyone can relate to,\" she wrote.   \"Britney Jean,\" Spears\u0027 eighth studio album, will be released Dec. 3, the day after her 32nd birthday and the same month she\u0027s due to begin her concert residency in Las Vegas.   Read the full letter below:  Dear Fans,  I haven\u0027t sat down to write you guys in SUCH a long time. Long overdue! We\u0027re all so used to getting our thoughts out in 140 characters, but sometimes its nice to take time to sit down and write something a little longer and more personal. I am putting the finishing touches on my new album, \"Britney Jean\" over the next few days and I am so excited for you to hear it. I poured my heart and soul into this album and it\u0027s been an incredible journey. I\u0027ve learned a lot about myself, and as I am finishing, I am reminded of the incredible foundation that has supported me for the last 15 years. Thank you all for continuing to follow me on this journey and for allowing me to do what I love to do. I can\u0027t believe this is my eighth studio album and I know I keep telling you that it is my most personal record yet, but its true and I\u0027m really proud of that.  I have been through a lot in the past few years and it has really inspired me to dig deeper and write songs that I think everyone can relate to. Working with people like Sia, William Orbit, and of course Will.i.am has been an amazing experience. They have listened to all of my ideas and helped me bring them to life. There are a lot of really fun, upbeat dance songs, but it was important to me that I show my strength, and my attitude, and my vulnerability. Of course, I also have some surprises for you guys ;)  I want to show you the different sides of Britney Spears. I am a performer. I am a Mom. I am funny. I am your friend! I am Britney Jean.  Hope you love my labor of love!  Love Always,  Britney   ",
  "category": "ENTERTAINMENT"
}