{
  "url": "http://www.cbsnews.com/8301-207_162-57609344/mtv-to-premiere-series-on-app/",
  "title": "MTV to premiere series on app",
  "data": " MTV is releasing a full season of a new series about a luckless high school football team on its mobile application Friday, a week before the first episode is shown on television. \t It appears to be a new milestone in the fast-moving world of technology changing traditional television content, much like when Netflix made an entire season of \"House of Cards\" available at once through the streaming service. MTV made its free app available on iPhones, iPads, iPods and the Xbox 360 in June, and nearly 2 million have been downloaded. \t The series, \"Wait \u0027Til Next Year,\" is a 12-episode docudrama about a high school football team that had lost 43 games in a row and the community surrounding it. \t \"It will be fun to see if we can get them to come back and watch on television,\" said Kristin Frank, MTV\u0027s executive vice president of connected content. \t That\u0027s always been a worry among networks about new content delivery forms, since the financial underpinning of the business is still largely dependent on viewers watching programs -- and their commercials -- on television. But MTV figures that many people who watch the series on the app will become promotional vehicles themselves, spreading the word about it on social networks and encouraging others to watch on TV. \t MTV also experimented recently with its \"flock to unlock\" promotion on Miley Cyrus. The network released \"extras\" from its \"Miley: The Movement\" documentary on the app, provided a certain number of viewers tweeted requests. They did and, in effect, the fans who successfully \"unlocked\" the extra material provided MTV with free online publicity. \t During the Cyrus experiment, MTV saw an 82 percent increase week to week in the number of people downloading the app, the network said. \t VH1 recently made its new app available. The network aired reruns of last week\u0027s popular documentary about the band TLC exclusively on the app for a week before it aired again on television, Frank said. The CMT and Logo networks are also readying apps to be available in the next few months. \t So far, a little more than half of the downloaded apps have been for iPhones, and 31 percent have been for iPads, MTV said. It is expecting to make an app for Android systems soon, a spokesman said Thursday. \t MTV figured \"Wait \u0027Til Next Year\" would be a good test case for how many people are interested in using the app for new content, since it\u0027s a series that\u0027s starting without any established stars. Beyond the football team, the series focuses on cheerleaders, fans, parents and others trying to keep up enthusiasm for a program that hasn\u0027t won a game in five years. \t It debuts on television on MTV on Friday, Nov 1.  ",
  "category": "ENTERTAINMENT"
}