{
  "url": "http://www.cbsnews.com/8301-18563_162-57609221/ringo-starrs-book-photograph-recalls-a-magical-mystery-tour/",
  "title": "Ringo Starr\u0027s book \"Photograph\" recalls a magical mystery tour",
  "data": " (CBS News) LOS ANGELES -- Ringo Starr, the former Beatle, is putting out a new album -- not of his music, but of his photographs.  The album includes a magical mystery that dates back to the Beatles\u0027 first U.S. tour.  \n\n24 Photos\nRingo Starr\u0027s \"Photograph\" \nView the Full Gallery »\n\n\n\n\n\n\n\n\n\n When the Beatles arrived in America in 1964 to play \"The Ed Sullivan Show,\" the Fab Four were the subjects of countless photographs.   When Starr, now 73, looks back at those photos, he remembers a very special time.  \"It was so great, it was exciting, we were coming to America, the musical land of our dreams,\" he said.  Starr says screaming fans weren\u0027t the only ones taking pictures.   \"We all had cameras, a drink a cigarette - those were the three things we all carried all the time,\" he said.\nWatch this 1964 video of the Beatles from the CBS archives:\n\n Starr became the the band\u0027s unofficial photographer, capturing their intimate moments from the inside of Beatlemania. He also turned the camera on the media and on their fans.  He\u0027s always wondered about one photo of a group of teenagers in a car, which he took nearly 50 years ago. There\u0027s one guy back in the shadows who Starr calls \"the mystery man.\"  The teenagers had driven to New York\u0027s John F. Kennedy Airport to see the Beatles arrive. They were too late, but on the way home a limo pulled up next to their car.   \"They all put the windows down and I thought, \u0027Hey, I got me camera, I\u0027ll take them,\u0027\" said Starr. \"And guess what? They really saw us and we saw them.\"  Starr found many of his personal pictures in his basement and has compiled them into a new book called \"Photograph.\" He says it\u0027s a way to tell his own life story. \n\nPaul McCartney talks about ending feud with Yoko Ono\nPaul McCartney plays impromptu show from back of truck\nMeet the Beatles\u0027 secretary  \"I think it\u0027s a much better way because you\u0027ll tell the story and you have a page to write and then you have a picture, so this is the best way for me,\" he said.   The book prompted a search for those kids in the car. It turns out that many of them still live on the East Coast.  Starr doesn\u0027t want a reunion. He prefers to simply remember that moment when everyone was having the time of their lives.   Ringo Starr and his All Starr Band are embarking on their Fall tour. Their only U.S. dates are at the Palms Casino Resort in Las Vegas November 22 and 23.   ",
  "category": "ENTERTAINMENT"
}