{
  "url": "http://www.cbssports.com/general/eye-on-sports/23495082/defending-open-champ-andy-murray-ousted-no-9-wawrinka-advances",
  "title": "Defending Open champ Andy Murray ousted, No. 9 Wawrinka advances",
  "data": "  A disappointed Andy Murray waves goodbye to the US Open crowd. (USATSI) Far from the form he showed in his two recent Grand Slam titles -- including last year\u0027s US Open championship campaign – No. 3 Andy Murray was ousted on Thursday at the US Open thanks to a clinical, straight sets defeat from No. 9 Stanislas Wawrinka 6-4, 6-3, 6-2.\"It feels amazing, for sure, especially here, especially after that match. He\u0027s the defending champion, he\u0027s a tough opponent. I\u0027m just really happy. It was a crazy match for me and to beat him in three sets is just amazing,\" he said after the win, still a bit stunned.Wawrinka earned himself his first ever trip to a major semifinal by mixing in spins, varying his angles, and keeping the reigning Wimbledon winner completely off balance. Murray was so frustrated by Wawrinka\u0027s tactical 6-4 dissection in the first-set victory that he slammed his racket on the court, breaking the frame.The Scot hit into an uncharacteristic 30 unforced errors compared to just 15 winners. Numerous times Wawrinka was bailed out when Murray lost his concentration, hitting potential winners into the net or past the baseline.But it wasn\u0027t really Murray\u0027s miscues as much as it was Wawrinka\u0027s aggression that will see Switzerland\u0027s other star through to the semifinals. The No. 9 seed, who had previously owned a 5-8 head-to-head record against Murray, crushed 45 winners and won 88 percent of his first serves. In fact, Wawrinka never once faced a break point.Even up two sets, Wawrinka admitted that he wasn\u0027t completely comfortable facing a third.\"A little bit nervous, for sure, I was trying to be focused on my game,\" he said. \"Just to be focused on playing good, playing solid, aggressive, to go for taking the match and not let him come back.\" It\u0027s the first time since the 2010 US Open (where Wawrinka beat Murray in the third round), that the Scot lost to a player ranked outside of the top six at a major, and the stunning loss ends Murray\u0027s streak of reaching the last four major finals that he\u0027s participated in.It wasn\u0027t entirely unexpected though, as the win marked Wawrinka\u0027s seventh victory over a top-10 opponent this year, trailing only Nadal and Djokovic. He\u0027ll face the winner of No. 1 Novak Djokovic or No. 21 Mikhail Youzhny for a spot in the finals. ",
  "category": "TENNIS"
}