{
  "url": "http://www.cbssports.com/general/eye-on-sports/23511549/serena-williams-victoria-azarenka-to-meet-again-in-us-open-final",
  "title": "Serena Williams, Victoria Azarenka to meet again in US Open final",
  "data": "It only took 25 tries, but someone finally took a game off Serena Williams. But little more than that.The world\u0027s No. 1 female player cruised into her seventh career US Open final, defeating Li Na 6-0, 6-3 Friday in Flushing Meadows.Williams has been on quite the tear of late. After dusting Carla Suarez Navarro 6-0, 6-0 in the quarterfinals, Williams went on to win the first seven games of her match with Na, running her consecutive games won streak to 24 dating back to her fourth round match. The No. 5 seed finally took a game in the second set, and even tried to make something of a run. Na followed her win by breaking Williams\u0027 serve, then moving out to 40-0 in the next game. Williams battled back and won that game, drawing the set square at two apiece. Williams took control from there, however, ending the match by winning four of the next five games.Azarenka -- the No. 2 seed -- defeated Flavia Pennetta, 6-4, 6-2 to move into the final.More US OpenComplete coverage from Flushing Meadows \"I\u0027m so excited,\" Azarenka said after the match. \"It has been a long road to the final. It\u0027s an amazing feeling.\"It was tit-for-tat in the beginning, with both women winning breaks in the first set. Azarenka eventually gained the upper hand. The second set was more of a breeze for the two-time Australian Open champion, who was victorious despite committing 25 unforced errors to Pennetta\u0027s 23.Sunday will mark Azarenka\u0027s fourth appearance in a Grand Slam final, with each coming in the last two years.Last year in the finals of the same tournament, Williams defeated Azarenka 6-2, 2-6, 7-5. The two have met 16 times in their career, with Williams winning 13 times. Azarenka has won two out of the last three matches, though, most recently in August of this year.",
  "category": "TENNIS"
}