{
  "url": "http://www.cbsnews.com/8301-18563_162-57609224/arrival-of-obamacare-forcing-insurers-to-drop-customers-with-low-coverage/",
  "title": "Arrival of Obamacare forcing insurers to drop customers with low coverage",
  "data": " The Affordable Care Act was signed by President Obama in 2010 and since then he has repeated one reassuring phrase: \"If you like your insurance plan you will keep it. No one will be able to take that away from you. It hasn\u0027t happened yet. It won\u0027t happen in the future.\" But it is happening. The president\u0027s health care law raises the standards for insurance policies, which many consider to be a good thing. But hundreds of thousands of Americans whose policies don\u0027t meet the new standards are being told that their health plans are being cancelled.  Natalie Willes is a sleep consultant who helps parents in Los Angeles train their newborns to sleep. She buys her own health insurance.  \n\n\nNatalie Willes\n/\n\nCBS News\n\n \"I was completely happy with the insurance I had before,\" Willes said.   So she was surprised when she tried to renew her policy. What did she find out?  \"That my insurance was going to be completely different, and they were going to be replaced with 10 new plans that were going to fall under the regulations of the Affordable Care Act,\" she said.   Her insurer, Kaiser Permanente, is terminating policies for 160,000 people in California and presenting them with new plans that comply with the healthcare law.   \"Before I had a plan that I had a $1,500 deductible,\" she said. \"I paid $199 dollars a month. The most similar plan that I would have available to me would be $278 a month. My deductible would be $6,500 dollars, and all of my care after that point would only be covered 70 percent.\"  \n\nVaccines are now required\n/\n\nCBS News\n\n     Gerry Kominski, director of public health policy at UCLA said: \"About half of the 14 million people who buy insurance on their own are not going to be able to keep the policies that they had previously.\"  He says higher premiums help insurers pay for new requirements including accepting patients with pre-existing conditions and providing preventative care like check-ups and vaccines.   \n\nGerry Kominski\n/\n\nCBS News\n\n \"You\u0027re paying more for a better product and for more protection -- and you won\u0027t understand the value of that until you need it,\" he said.  But many can\u0027t get past the sticker shock.   \"Now I\u0027m being forced to choose from a bunch of new plans that I don\u0027t want to choose from that are all more expensive,\" Willes said.  New plan prices vary depending on age and location. But we\u0027re told younger people who currently have with high deductible plans will likely pay higher premiums and people with health problems will pay lower premiums.   ",
  "category": "HEALTH"
}