{
  "url": "http://www.cbsnews.com/8301-204_162-57609372/brett-favres-memory-loss-spotlights-known-concussion-symptom/",
  "title": "Brett Favre\u0027s memory loss spotlights known concussion symptom",
  "data": " Brett Favre\u0027s admission that he experiences memory loss has shed light on the neurological toll repeated concussions may have on athletes who participate in contact sports. Multiple reports have said that the St. Louis Rams -- whose lead quarterback Sam Bradford is out for the season with a knee injury -- asked Favre to take over signal caller duties for them. Favre revealed in a radio interview with SportsTalk 570 on Thursday that the team did not reach out to him directly but to his agent. If he had been offered the opportunity, he said would have declined to come out of retirement, detailing the memory woes that face him now. \"This was a little shocking to me that I couldn\u0027t remember my daughter playing youth soccer,\" he said. \"It was just one summer, I think. I could remember her playing basketball, I could remember her playing volleyball, so I kind of think maybe (I thought) she only played a (soccer) game or two. Well, I think she played like eight. So that\u0027s a little bit scary to me. So for the first time in 44 years, that kind of put a little fear in me.\" CBS This Morning reports that during his career, Favre was sacked 525 times, experiencing an unknown number of concussions. He has had several documented concussions, including the last play of his career with the Minnesota Vikings in 2010, which he described as so severe he didn\u0027t even know what team he was playing, according to CBS Sports.  \"When I first started playing, those first 10 years, they didn\u0027t keep a log like they do now, so there\u0027s no telling,\" Favre said.  Dr. Chris Giza, a pediatric neurologist and traumatic brain injury researcher at UCLA, told CBSNews.com that loss of memory is a common symptom among people who have experienced multiple concussions.  \"If you\u0027ve had many, many concussions, (memory problems) can be cumulative when you\u0027re getting older,\" Giza said. \"That\u0027s a common complaint.\"  Giza hasn\u0027t treated Farve, but he\u0027s a head trauma expert who co-authored the new American Academy of Neurology guidelines on sports-related concussions. Previously, concussions were graded based on perceived severity, and then recommendations were made as to how long a player should stay out of the game. Now, the academy recommends that there\u0027s any doubt about a player\u0027s condition, he or she should be kept out of athletic activity.  Giza explained that as recently as 10 years ago, there was a common misconception that a person had to be knocked unconscious to have a concussion. \"Now we know that 90 percent of concussions occur without a loss of consciousness,\" he said.  In addition, recent research suggests that repeatedly getting hit in the head can add up and cause neurological issues. Several studies have shown chronic cognitive impairment in people who participate in contact sports correlated to the number of concussions sustained and the number of years played. A recent study showed that former NFL players who said they suffered from neurological problems because of their time on the field had more patterns of unusual brain activity than healthy individuals.  \"Certainty at the professional levels we have seen some cognitive costs,\" Giza said. \n\n\n\n\n\nPlay Video\nCTE research sheds light on patients\u0027 first symptoms\n\nThere\u0027s also a growing concern over chronic traumatic encephalopathy (CTE) caused by multiple head blows. The progressive degenerative brain disease has been found in athletes who have had multiple concussions or other brain trauma, but it can only be diagnosed after death. CTE causes dementia-like issues including memory loss, changes in mood like depression, problems with cognition, behaviors like confusion and aggression, and difficulty with motor abilities. Such brain changes can begin months, years or decades after the last brain trauma or end of active athletic involvement, Boston University\u0027s Center for the Study of Traumatic Encephalopathy (sometimes referred to as the \"NFL\u0027s brain bank\" for diagnosing the disease in deceases athletes) notes. \n\n\n\n\n\nPlay Video\nJunior Seau\u0027s autopsy report\n\n Ginza pointed out that memory loss is a tricky area, and there may be other medical causes unrelated to blows to the head.  He added that the only evidence we have that CTE exists is based on case reports, which he admits is the lowest form of data. It reveals that this conditions can happen, but doesn\u0027t reveal the chance a person will develop it, nor if genetic predisposition, contact sports or other issues are behind the prevalence of the brain disease.  But contact sports leagues are well-aware of these issues. The NFL in particular has made several changes including outlawing helmet-to-helmet hits and preventing players who had a concussion from returning to the field that same game. Giza pointed out that studies suggest the move to shorten the distance for kickoff returns may reduce the number of concussions during these plays. Still, more remains to be done to prevent concussions and neurological issues related to repeated head blows, said Giza.NFL concussion settlement draws mixed opinions from ex-players \"(Sports leagues) made some sensible decisions,\" he said. \"That doesn\u0027t meant they\u0027ve done everything possible in football and contact sports... even though some of the education is getting out there, people still don\u0027t understand enough or take that education and change their behavior.\"   ",
  "category": "HEALTH"
}