{
  "url": "http://www.cbsnews.com/8301-204_162-57609211/fda-recommends-reclassifying-vicodin-as-harder-drug/",
  "title": "FDA recommends reclassifying Vicodin as harder drug",
  "data": " The Food and Drug Administration is recommending additional restrictions on prescriptions for painkillers, which could affect how patients receive the medications going forward. The FDA has proposed reclassifying hydrocodone combination pills, such as Vicodin (which combines hydrocodone with acetaminophen), from a Schedule III drug to a Schedule II drug, which will make the meds harder to obtain. \"For the millions of American patients experiencing an acute medical need or living with chronic pain, opioids, when prescribed appropriately, can allow patients to manage their pain as well as significantly improve their quality of life,\" Dr. Janet Woodcock, director for the Center for Drug Evaluation and Research at the FDA, said in a statement posted Thursday afternoon on the agency\u0027s website. \"However, in recent years, the FDA has become increasingly concerned about the abuse and misuse of opioid products, which have sadly reached epidemic proportions in certain parts of the United States.\" The New York Times first reported the recommendation, which may go into effect as early as next year. The recommendation dates back to 2009, when the Drug Enforcement Administration asked government health officials for a recommendation regarding whether to change the pills\u0027 classification. In January, an advisory panel of doctors had recommended to the FDA that the agency reclassify the pills to a tougher scheduling class. The Controlled Substances Act divides all drugs into five \"schedules\" based on their accepted medical uses and potential for abuse. Schedule V substances are medical preparations that have the lowest potential for abuse (e.g. Robitussin AC), while Schedule I substances have no \"currently accepted medical use in the U.S.,\" and include heroin, LSD and marijuana. Vicodin is currently classified as a Schedule III drug, which means it may lead to moderate or low physical dependence or high psychological dependence. It can currently be refilled up to five times before a patient has to see his doctor again. By moving it to Schedule II -- which means it has a high potential for abuse and can lead to severe physical or psychological dependence -- the drugs can only be prescribed in 90-day amounts before a trip to the doctor. Nurses and physician assistants will no longer be able to prescribe the medications. Examples of other Schedule II drugs include Adderall, Ritalin, OxyContin, morphine, opium and codeine. The FDA said its decision stems from extensive research of scientific literature and reviews of hundreds of public comments solicited by the agency. \"We anticipate that the National Institute on Drug Abuse (NIDA) will concur with our recommendation,\" Woodcock said in the statement. She told the Times the agency realizes the new restrictions would affect patients, but the public health impact of painkiller abuse had reached a tipping point. Nearly three out of four prescription drug overdoses are caused by prescription pain pills, according to the Centers for Disease Control and Prevention, an \"unprecedented rise\" that parallels a 300 percent increase in the products\u0027 sales since 1999. Deaths from prescription painkiller overdoses in women increased more than 400 percent since 1999, compared to 265 percent among men. In 2010, 2 million people reported using prescription painkillers non-medically -- which includes without a prescription or taking them for the feeling they cause -- for the first time within the last year. \"These are very difficult tradeoffs that our society has to make,\" Woodcock told the paper. \"The reason we approve these drugs is for people in pain. But we can\u0027t ignore the epidemic on the other side.\"  ",
  "category": "HEALTH"
}