{
  "url": "http://www.cbsnews.com/8301-204_162-57608999/memory-may-be-protected-by-keeping-blood-sugar-levels-low/",
  "title": "Memory may be protected by keeping blood sugar levels low",
  "data": " Keeping your blood sugar levels low might protect older adults from memory loss, new research suggests. A small study published Oct. 23 in the journal Neurology found low blood sugar levels led to memory benefits in healthy adults. \"These results suggest that even for people within the normal range of blood sugar, lowering their blood sugar levels could be a promising strategy for preventing memory problems and cognitive decline as they age,\" study author Dr. Agnes Floel, a neuroscientist at Charite University Medicine in Berlin, Germany, said in a news release. Previous studies have linked high blood sugar levels -- which can cause diabetes -- to Alzheimer\u0027s disease. This study, however, looked at people without any of those conditions and found that lower blood sugar may have protective qualities. Floel and her colleagues recruited about 140 people who were an average age of 63 and who were not diagnosed with diabetes or prediabetes, a condition in which levels of blood sugar, or glucose, are higher than normal but not yet high enough to be diagnosed as Type 2 diabetes. People with normal blood sugar levels have an A1C level that ranges from 4.5 to 6 percent, according to the Mayo Clinic. A1C is a measure of the percentage of the hemoglobin in your blood that links up with glucose molecules. An A1C level of 6.5 percent or higher may indicate diabetes, while results between 5.7 and 6.4 percent would put someone at prediabetes. Those with preexisting memory problems were also excluded from the test.  Researchers gave the participants memory tests and took readings of their glucose levels. In one of the tests, they were asked to recall a list of 15 words 30 minutes after hearing them. They were also given brain scans to measure the size of the hippocampus, a structure in the brain tied to memory functions. Participants were put into groups based on their blood sugar levels, and those with lower glucose levels were more likely to score higher on memory tests than healthy people with higher levels of blood sugar. Specifically, every 7 mmol/mol rise in blood sugar was associated with two fewer recalled words on the memory test. Brain scans showed people with the highest blood sugar levels also had smaller hippocampus volume than those with the lowest levels.  Floel said it\u0027s possible that efforts to curb calorie intake or boost physical activity might help prevent memory problems. She called for further studies to check. In August, researchers at the University of Washington in Seattle who tracked blood sugar in people with and without diabetes over seven years found higher glucose levels were associated with a higher risk of dementia among non-diabetics.  \"It\u0027s not surprising that glucose levels can potentially have these kinds of negative impacts. The risk of dementia is higher in people with diabetes,\" Dr. Robert Ratner, chief scientific and medical officer for the American Diabetes Association, told USA Today. Still, he emphasized the findings only showed an association between a single reading of glucose levels and memory. \"They haven\u0027t shown that the memory loss is either due to the higher glucose level, or that lowering glucose would improve memory,\" he said, adding there\u0027s not much people can do to lower their blood sugar levels if they\u0027re already in normal ranges. That doesn\u0027t mean eating healthy and exercising won\u0027t help boost your brain health at all. Research suggests adults over 60 with prediabetes who ate a healthy diet and lost 5 to 7 percent of their body weight (about 10 to 15 pounds for a 200-pound person) and walked or engaged in moderate exercise 30 minutes a day for five days a week were 70 percent less likely to develop diabetes, which in turn reduced their dementia risk, according to the Alzheimer\u0027s Association.  ",
  "category": "HEALTH"
}