{
  "url": "http://www.cbsnews.com/8301-505269_162-57609052/surgeon-salesmen-doctors-profit-from-devices-they-put-in-patients/",
  "title": "Surgeon salesmen? Doctors profit from devices they put in patients",
  "data": " (CBS News) By the summer of 2010, 68-year-old Lillian Kaulback had developed severe back pain. She was referred to Dr. Aria Sabit, a spine surgeon in Ventura, Calif.  Her son Kevin Reynolds, who was at the appointment with her, says a few things struck him as strange from the start. There was no secretary or medical assistant there to greet them -- just Sabit. There was no physical exam, and Reynolds says Sabit told his mother she needed surgery within three to five minutes of meeting her.  Patients like Kaulback have a higher risk of complications -- she was 68, overweight, and diabetic. Still, Sabit performed a three-level spine fusion, screwing together four of her vertebrae. Reynolds says within days, she developed a life-threatening infection. \"The independent team asked me not once, but twice to pull the plug on her,\" he told \"CBS This Morning.\" \"I said \u0027no\u0027.\"  Lillian Kaulback never walked again. Seven months after the surgery, in May of 2011, she passed away.  Reynolds is now suing Sabit for wrongful death. One of his biggest questions centers on the screws and rods used to fuse the spine, which came from a company called Apex Medical Technologies LLC. Apex had no public phone number, website, or listing of its owners. \"CBS This Morning\" has learned one of its owners was Sabit himself, with a 20 percent stake. From May of 2010 to August of 2012, his share of the profit was about $330,000.  Reynolds claims the financial incentive caused Sabit to do a riskier procedure than necessary, so he could put in more hardware. A single screw used in spine fusion surgery can cost $100 to make, and can sell for $1,000. \"I don\u0027t think he would\u0027ve worked on as many levels or possibly did that type of invasive surgery,\" Reynolds told \"CBS This Morning.\" He says Sabit never mentioned his ownership stake in Apex.  Court records show Kaulback\u0027s case is one of 28 brought against Sabit for just 17 months of work at Ventura\u0027s Community Memorial Hospital. At least 10 of the suits involve Apex implants. Legal filings show in the seven months before Sabit became an owner of the company, he did 115 spine surgeries. In the seven months after, he did 154, a 34 percent increase. (Seven full months was the length of time from when Sabit began using the implants to when he left the hospital in December of 2010.)  Sabit chose not to give \"CBS This Morning\" an interview for this story, citing pending litigation. But in a deposition, he claimed he simply had more cases as he became more established. \"As time went on I got more and more referrals,\" he said. \"By June of 2010, the wait time to have surgery done by me was probably around two-and-a-half to three months.\"  Physician-owned companies, also known as physician-owned distributorships or P.O.D.s, have been around for a little over a decade, but already supply an estimated one-sixth of spinal implants nationwide. Most simply serve as middlemen, buying implants wholesale and selling them to hospitals, but some also design and manufacture their own products. In addition to spinal implants, they currently supply hip, knee, cardiac, and other devices.  Doctors are not required to disclose their ownership in these companies, so it\u0027s very difficult to get information about them. Often patients -- and even hospitals -- don\u0027t know their physicians are involved. But today, the Inspector General of the Department of Health and Human Services released a long awaited study on them.   The report found that in fiscal year 2012, hospitals served by physician-owned companies averaged 28 percent more spine surgeries. Their rate of spine fusions jumped 21 percent after they began purchasing from these companies (that compares to a 9 percent increase for hospitals overall, during the same period). The report also found that surgeries involving physician-owned companies used 13 percent fewer devices.  Drs. Scott Lederhaus and Charles Rosen are on the board of the Association for Medical Ethics. Both spine surgeons, they say they\u0027ve seen many patients harmed by physician-owned companies, due to the strong financial incentive to perform unnecessary procedures. \"The guys that are being egregious could make, just from putting in the implants ... perhaps in excess of a half a million dollars each, per year,\" Lederhaus told \"CBS This Morning.\"  \"Doctors are not supposed to be salesmen,\" Rosen added.   Lederhaus and Rosen say physician-owned companies should be banned entirely. But Dr. John Steinmann says that would be a big mistake. His company is one of the few that discloses who its owners are. He says by cutting out the middle man and buying in bulk, he saves his hospital $1 million a year. \"I can perform exactly the same effective surgeries at a 40 percent lower rate,\" he told \"CBS This Morning.\"  Steinmann says these arrangements can greatly lower healthcare costs, they just need to be regulated, to weed out the \"bad apples.\" To help do so, he founded the American Association of Surgeon Distributors, which certifies what it believes are legal and ethical physician-owned companies. It requires doctors to disclose their ownership stakes and show cost savings, and it monitors the number of surgeries they are performing. \nBut at least for now, it appears Steinmann is the exception rather than the rule. His association has fully certified just 14 of the more than 200 physician-owned companies operating across the country, according to the most recent estimates from the Centers for Medicare and Medicaid Services. And the inspector general report found that on average, physician-owned companies are charging no less than traditional suppliers. (You can read the association\u0027s response to the report here.)  The Justice Department is now investigating whether Sabit\u0027s ownership of Apex led him to do unnecessary procedures, according to the Office of Sen. Orrin Hatch, R-Utah, and the Finance Committee. No one from Apex would give \"CBS This Morning\" an interview, but a spokesman claimed none of the suits involving the company\u0027s implants allege unnecessary procedures. In fact, at least eight of the 10 plaintiffs we identified said they plan to argue just that, though no one has claimed the implants were defective.  In depositions, Sabit has denied the allegations. He charges that his former medical group, Ventura County Neurosurgical Associates, encouraged patients to sue, so it could fire him and avoid paying his bonuses. He claims he is owed millions and has sued for wrongful termination.  Sabit also blamed a non-sterile operating room for patient infections, and in a deposition, the chief executive officer of the hospital -- which is also being sued -- defended him, saying \"the vast majority of cases that Dr. Sabit did were appropriate.\" Sabit has settled at least nine of the 28 cases, and at least one has been dismissed. He is no longer a part-owner of Apex.  Last month, the California Medical Board accused Sabit of committing dishonest, corrupt, and negligent acts in his care of five patients. It charged that he performed unnecessary procedures on three of them, and repeatedly documented procedures that he did not perform. The board will decide whether to revoke his state license after a hearing. For the time being he is still practicing, in Lapeer, Mich.  ",
  "category": "HEALTH"
}