{
  "url": "http://www.cbsnews.com/8301-207_162-57608362/tears-for-fears-haunting-debut-album-gets-a-second-look/",
  "title": "Tears For Fears\u0027 haunting debut album gets a second look",
  "data": " In terms of widespread popularity, the British rock group Tears For Fears achieved great success with its 1985 album, \"Songs From the Big Chair.\" It contained three top 10 hits, including two No. 1 smashes: \"Everybody Wants to Rule the World\" and \"Shout.\" But perhaps overlooked in America is the band\u0027s debut album from two years earlier, \"The Hurting\" -- a less commercial-sounding but nevertheless powerful and moving record. For the group\u0027s singer/guitarist/songwriter Roland Orzabal, the album is a very personal one.   \"I think it\u0027s one of those records,\" he tells CBSNews.com, \"that because it was a particularly difficult time for me emotionally, sort of late adolescence -- I think those emotions sort of never going go away and I think a lot of kids identify with that when they go through it.\" \n\n\nCover of Tears For Fears\u0027 \"The Hurting\"\n/\n\nUME\n\n Thirty years after its initial release, \"The Hurting\" has been reissued as a deluxe 3-CD/1-DVD box set that contains the original album and a slew of bonus material. (It\u0027s also available as a 2-CD deluxe edition). \"I think it coincided with a period where we were a little bit more enthusiastic,\" says Orzabal. \"So it\u0027s all come together at a good time, I think.\"   Tears for Fears was formed in the early \u002780s by childhood friends Orzabal and bassist/singer Curt Smith in Bath, England. Both the band\u0027s name and the concept behind \"The Hurting\" drew from the work of American psychologist Dr. Arthur Janov, the founder of primal therapy, a type of psychotherapy in which patients relive their childhood pain in order to overcome it (John Lennon was a follower). Orzabal\u0027s introduction to Janov\u0027s concepts was through his guitar teacher, who one day told him that she was going to America to seek therapy.   \"I said, \u0027What?\u0027\" Orzabal recalls. \"It seemed pretty drastic. And she had a copy of [Janov\u0027s book], \u0027The Primal Scream,\u0027 and she said, \u0027Why don\u0027t you read it?\u0027 And I read it and it felt like a revelation. I identified with the feelings expressed in the book and this idea that you can unburden yourself of all those dark and tormented feelings. I took to it like the proverbial duck and became very evangelical about it as well. My only convert was Curt who identified with it as well. It was then pretty much us against the world. It was like we were born again.\" \n\n\n \nAlthough \"The Hurting\u0027s\" songs are predominantly synthpop, the lyrics reveal a dark and haunting perspective of adolescent angst and pain -- quite a contrast to the more upbeat pop music from the MTV-era acts. \"Influence-wise, we probably were harking back to [post-punk band] Joy Division,\" Orzabal reflects, \"doing a sort a pop version to begin with.\"  For a collection of songs that draws on electronics, the tracks for \"The Hurting\" were first written on acoustic guitar -- Orzabal explains the acoustic guitar was the only instrument that he had then. \"It\u0027s just that they translated well to electronic style,\" he says of the tracks. \"It was very difficult for me at the time to play \"Mad World\" on acoustic guitar. It just didn\u0027t sound right. Luckily we had access to a very small 4-track or 8-track recording studio, which belonged to Ian Stanley, who later went on to co-write with us. And with \"Mad World,\" the first thing I did was try to arrange it with synths and drum machine. All of a sudden, it just sounded like a thing -- on the acoustic, it just didn\u0027t.\"  \"The Hurting\" yielded three of the band\u0027s most popular songs in its catalog. One of them is the angst-ridden \"Pale Shelter,\" whose title was inspired by the work of British sculptor Henry Moore. The other track, the aforementioned \"Mad World,\" would be later covered by numerous artists over the years, including a version by Michael Andrews and Gary Jules that was a hit in the U.K. in 2003.  \n\n\n \"It\u0027s the gift that keeps on giving,\" Orzabal says of that song\u0027s longevity. \"You look at your publishing catalog and you see all those songs you\u0027ve written. They\u0027re like children -- some go on and do really well, and some don\u0027t go on to do really well. That one, shall we say, is a late bloomer. When I first heard the Gary Jules version, I was blown away. It was hard to play on acoustic guitar. I never imagined in a million years that someone can do it. It was just absolutely shocking.\"  Another track, \"Change,\" became the band\u0027s first U.S. chart single, reaching No. 73. Featured on the box set is an alternate version of the song. \"When we did our first version,\" says Orzabal, \"I felt it was too fast and not electronic enough in a sense. So I managed to coax and moan and we rerecorded a version. But the record company was clear that they appreciated it and like the first version a lot better; the second version got buried -- until now.\"  Other treasure trove of material on \"The Hurting\" reissue include several original 7\" and 12\" versions of some of the album\u0027s tracks, performances for the BBC, and a DVD of a 1984 show at the Hammersmith Odeon. Orzabal admits the archival stuff brought back some long-forgotten memories.\"The crazy thing is Curt and I had an email discussion about it,\" he says. \"There were certain things we just couldn\u0027t remember. The thing about \u0027Suffer the Children\u0027 -- it was originally recorded for a different record company. We had to really scratch our heads and try to remember who was exactly involved and why we did it and why it didn\u0027t end up on that label, etc., etc.\" \n\n\n\nWhile \"The Hurting\" didn\u0027t make much of an impact in America in a commercial sense at the time of its release -- although it was a hit in the group\u0027s native U.K. -- it would be the precursor to Tears For Fears\u0027 breakthrough record \"Songs from the Big Chair,\" in 1985. \"There were a couple of things that worked at the time,\" Orzabal says. \"Everything that we hoped to express, we expressed in [\"The Hurting\"].   Four years after \"Songs from the Big Chair,\" Tears for Fears released its third album \"The Seeds of Love,\" which brought the smash hit \"Sowing the Seeds of Love.\" But after that, Smith left the group and Orzabal carried on the Tears for Fears name into the \u002790s. After a period of professional estrangement, the duo reunited and released \"Everybody Loves a Happy Ending\" in 2004.   \"When we were working in the past,\" says Orzabal, \"there was a lot of people in the studio--a lot of people arguing about every sort of nuance. When I got back together with Curt, there was no need to do that. We worked the two of us with a guy called Charlton Pettus and it was a very, very simple process. That [\"Everybody Loves a Happy Ending\" album] was probably the most enjoyable experience I\u0027ve had in making a record. It was very easy and fun. The whole point really was getting back together.\"  Meanwhile, there are indications these days that Orzabal and Smith are working on some new material. \"I guess we sort of started writing sessions in late April,\" Orzabal says, \"and I spent a lot of the summer in L.A. You know,it\u0027s the same old-same old -- it may end up being an empty process, which you don\u0027t think it\u0027s going to be when you begin it, but then you get into it and one song falls by the wayside and another song falls down the wayside. And then, \u0027Okay, it\u0027s Tears For Fears again.\u0027 But we are doing that.\"  Most recently, the duo did a cover version of Arcade Fire\u0027s \"Ready to Start,\" which can be streamed on the band\u0027s website. It\u0027s fitting given that Tears For Fears\u0027 synthesizer-driven sound and thoughtful lyrics can be heard in some of today\u0027s modern rock bands. Most recently, it was announced that Lorde is covering \"Everybody Wants to Rule the World\" for the upcoming soundtrack to \"The Hunger Games: Catching Fire.\"  \"We were getting together in the studio and we had quite a few new songs that we were slightly lacking with lyrics,\" Orzabal says. \"We have done a few cover versions, just to sort of oil the machine. \u0027Ready to Start\u0027 was pretty straightforward. It might not sound it, but it was. Most of the new music I hear nowadays is from my younger son\u0027s laptop. Sometimes you know the song but don\u0027t know who did it. I\u0027m pleased with that and very pleased with the some of the comments online. It\u0027s just letting people know that you are still alive and that you can still make a decent record.\"  ",
  "category": "ENTERTAINMENT"
}