{
  "url": "http://www.cbssports.com/general/eye-on-sports/23493755/no-1-bryan-brothers-falter-in-semis-lose-chance-at-calendar-grand-slam",
  "title": "No. 1 Bryan brothers falter in semis, lose chance at calendar Grand Slam",
  "data": "  Bob and Mike Bryan fall short of recording the first calendar Grand Slam since 1951. (USATSI) For the first time in the last 29 major matches -- a streak that spanned four-straight Grand Slam titles -- doubles partners and brothers Mike and Bob Bryan lost. The No. 1 doubles team fell to No. 4 Leander Paes and Radek Stepanek 6-3, 3-6, 4-6 in the semifinals of the US Open on Thursday, ending the brothers\u0027 quest to record the first calendar Grand Slam since 1951.\"I have tremendous respect for the Bryan boys,\" Paes said following the win. \"They are great ambassadors for American tennis.\"The brothers owned a 4-3 head-to-head advantage coming into the match, but weren\u0027t able to finish off their opponents despite a stellar opening set.After Paes and Stepanek cruised through the second set, the duo ran off five straight games to maintain an impressive 5-1 lead over the 15-time major winners. After each point they scored, the two began an impromptu dancing shuffle that visibly rankled the Bryans.“It came natural,” Stepanek said. “We have fun on the court. Whatever comes comes.”It likely motivated the brothers as they reeled off three-straight, including one break, to test their opponent\u0027s fortitude. Ultimately, Stepanek held serve in the 10th game of the third set, winning four straight points and ending the Bryan\u0027s streak.After the match ended, the brothers shook hands and hugged -- a seismic departure from their signature chest bump that accompanied all their wins.  It was the first time in 79 major matches that the Bryan\u0027s had lost after winning the opening set.Paes and Stepanek, semifinalists at Wimbledon this past summer, move on to the finals where they\u0027ll take on the winner of Ivan Dodig/Marcelo Melo vs. Alexander Peya/Bruno Soares. ",
  "category": "TENNIS"
}