{
  "url": "http://www.cbssports.com/general/eye-on-sports/23434130/no-1-serena-williams-handles-no-15-sloane-stephens-in-allamerican-match",
  "title": "No. 1 Serena handles No. 15 Stephens in All-American match",
  "data": "Billed as a generational match between the two best American women in tennis, Serena Williams\u0027 clinical 6-4, 6-1 dispatching of No. 15 Sloane Stephens was more a resounding statement than any sort of referendum.Williams, the defending US Open champion who had lost to the precocious 20-year-old earlier this year in the quarterfinals of the Australian Open, didn\u0027t blink in the face of her budding rival.The two had sparred through various media outlets since that match -- Stephens more so than Williams -- but at 1-1 in the head-to-head battle, Sunday\u0027s 1:28 triumph was sweet revenge for Williams, even though she tried to sell that everything was patched up between them.“She\u0027s such a good player, so it definitely felt like something bigger,” Williams said following the tense match. Neither showed much emotion, but it was clear – through her 29 unforced errors – that Stephens wasn\u0027t comfortable against the reigning champion.Williams bashed 22 winners (to Stephens\u0027 15) and dealt her understudy six aces, including a searing 121 MPH serve in the final game.Both showed reluctance to charge the net for fear of exposing themselves to the other\u0027s substantial power. Instead, each was content going blow for blow, well behind the baseline and testing the other\u0027s court coverage. Williams, who had lost just eight games throughout the first three rounds of the tournament, was clearly superior.Following the match, the two shared a few words along with a warm handshake, evidence of mutual respect as opposed to the headline-generating, petty swipes that helped fuel the pre-match hype. Irrelevelant to Sunday\u0027s result, American tennis is clearly in good hands, a fact Williams acknowledged in the post-match interview. Williams\u0027 win sends her to her 11th quarterfinals appearance at the US Open. She\u0027ll take on No. 18 seed Carla Suarez Navarro of Spain. ",
  "category": "TENNIS"
}