{
  "url": "http://www.cbssports.com/general/eye-on-sports/23564778/rafael-nadal-captures-second-us-open-title-13th-grand-slam-major",
  "title": "Rafael Nadal captures second US Open title, 13th Grand Slam",
  "data": "Rafael Nadal was pushed harder than he had been all tournament by top seed Novak Djokovic on Monday night, but the Spaniard leaned heavily on his titanic left arm, winning his second US Open and 13th Grand Slam title, 6-2, 3-6, 6-4, 6-1.\"Probably, only my team knows, how much means the match of today,\" Nadal said, following his record 37th meeting vs. Djokovic. \"Playing against Novak is a very special feeling. Probably nobody brings my game to that limit like Novak did.\" In a US Open rubber match spanning three years -- Nadal defeated the Serb at the Open in 2010 while Djokovic returned the favor a year later -- Nadal asserted himself as the best tennis player in the world, handling the top seed in 3:20 at Arthur Ashe. It was a far cry from their near-six-hour match in the 2012 Australian Open final, which Djokovic ultimately won. But what Monday\u0027s final lacked in length, the two stars made up for in sublime skill.Feverish extended rallies characterized Monday\u0027s final, as the two traded skid marks, transitioning from soft, backhanded slices to searing forehands. Nadal had significantly less winners (27-46) than his counterpart, but was much more efficient. The French Open winner hit into 20 unforced errors, 33 fewer than the reigning Australian Open champion.The entire complexion of the match swung after each former US Open champion traded sets to begin the final. At 4-4 in the third, Djokovic was up 40-0 with Nadal on serve. He battled his way back to deuce, punctuated by a 125 mph ace -- his fastest serve of the match. The game reached a second deuce before Nadal slammed his opponent\u0027s lob shot into the seats beyond the baseline. The emphatic point underscored Nadal\u0027s momentum, and he held to take the set. It was only a matter of time before Nadal would win his second title at Flushing Meadows, netting him $3.6 million in prize money.  That Djokovic couldn\u0027t close with Nadal facing three break points was extremely surprising given that he had broken Nadal in three consecutive games over the second and third sets. Nadal entered the final having been broken only once in his previous six Open matches. The fever-pitch of Monday\u0027s clash came midway through the second set, during a furious 54-shot rally that saw both players flash likely every shot in their arsenals. Nadal eventually drilled a backhand into the net, but the effort drew a raucous ovation from the crowd, as Djokovic took the game. It was the highlight of the match for the No. 1 overall seed, whose errors proved his undoing.Nadal, who improved to 60-3 on the year and won his 10th title this season, maintained his flawless 22-0 record on hardcourts this year. It wasn\u0027t long ago, though, that a knee injury sidelined Nadal for seven months, forcing him to skip last year\u0027s Open and then the Australian Open. His went on to win the next major -- the French Open -- for a record eighth time.  His 13th Grand Slam title puts him one behind Pete Sampras and four behind all-time leader Roger Federer. ",
  "category": "TENNIS"
}