{
  "url": "http://www.cbssports.com/general/eye-on-sports/23461481/no-2-azarenka-avoids-scare-advances-to-quarters-at-us-open",
  "title": "No. 2 Azarenka avoids scare, advances to quarters at US Open",
  "data": "  Victoria Azarenka survives a three-set scare on Tuesday. (USATSI) Despite playing a shaky, error-filled fourth-round match against No. 13 Ana Ivanovic, No. 2 Victoria Azarenka earned the last quarterfinal spot at the US Open with a 4-6, 6-3, 6-4 victory at Arthur Ashe stadium on Tuesday. The match, a strange, exhaustive battle between two familiar opponents (Azarenka now leads 5-2 all-time), had been postponed from Monday following a four-hour downpour.Azarenka held on despite a massive disadvantage in terms of winners (41-21), and she hardly looked like the biggest threat to unseat Serena Williams as the tournament favorite. After dropping the first set – only the second of the Open – Vika looked unsettled and frustrated, at one point screaming in the direction of her coaches box following another missed opportunity.More US OpenComplete coverage from Flushing Meadows \"I\u0027m a fighter at heart,\u0027\u0027 Azarenka said. \"I never, never give up. Whatever the score is, I\u0027m going to try to do my best because there is always an opportunity. There is always a way. You just have to make up your mind and try to find that way.\u0027\u0027She would eventually re-group, breaking her opponent in nine of her final 11 service games. Facing Ivanovic, the 2008 French Open winner who has struggled to take down the top female opponents, Azarenka took advantage of her counterpart\u0027s lack of confidence as she improved to 29-1 on hardcourts this year. Ivanovic was unable to contain her frustration, yielding 42 unforced errors and bashing her racket on the ground at least once. The two, obviously tense, combined for 17 double faults.For Ivanovic, it represents another missed opportunity as she has advanced to the quarterfinals of just one major (last year\u0027s Open) since her 2008 triumph at Roland Garros.But for last year\u0027s runner-up, the win slots her through to the quarterfinals of an extremely envious draw. Of the four women on Azarenka\u0027s side of the bracket, just one (No. 10 Roberta Vinci) is seeded, and one can only assume that the favorable draw will sprout more talk of a Serena-Azarenka final. Azarenka faces a quick turnaround where she\u0027ll meet unseeded Daniela Hantuchova on Wednesday, a result of Monday\u0027s postponement. A few hours after Azarenka made the quarterfinals, the first woman reached the semis. Fifth-seeded Li Na beat No. 24-seeded Ekaterina Makarova 6-4, 6-7 (5), 6-2 in 2 hours, 20 minutes.",
  "category": "TENNIS"
}