{
  "url": "http://www.cbssports.com/general/eye-on-sports/23476123/us-open-flavia-pennetta-reaches-first-grand-slam-semifinal",
  "title": "US Open: No. 2 Azarenka, Pennetta both reach semis with ease",
  "data": "  Victoria Azarenka returns to her second-straight Open semifinals. (USATSI) Unseeded Daniela Hantuchova proved no real threat to No. 2 Victoria Azarenka on Wednesday night at the US Open as last year\u0027s runner-up earned the straight sets victory 6-2, 6-3 to secure the last spot in the semifinals. Far from her best -- which really hasn\u0027t been on display throughout the entire Open – Azarenka built her advantage on break points, converting on 7-of-11 opportunities. In the first set alone, Azarenka won her opponent\u0027s first three service games, setting the tone for the 1:16 minute match.  Hantuchova won the first two games in the second before dropping the next five. Despite the loss, her quarterfinal appearance matched her best all-time showing (2002) at Flushing Meadows. Azarenka\u0027s win was much less dramatic than her fourth-round victory that saw her pull through after dropping the first set to No. 13 Ana Ivanovic earlier this week. She improved to 30-1 on hardcourts this year, and she has now reached the semifinals in six of her last eight Grand Slam tournaments. The two-time major winner will take on unseeded Flavia Pennetta for a shot at the finals, where she would meet the winner of No. 1 Serena Williams vs. No. 5 Na Li.  Pennetta advances to semis in straight sets Flavia Pennetta beat fellow Italian Roberta Vinci to move into her first career Grand Slam semifinal. (USATSI) It took her four tries, but Flavia Pennetta is finally moving through to the semifinals of the US Open.Pennetta had little trouble with fellow Italian Roberta Vinci Wednesday, cruising 6-4 6-1 and advancing to her first career Grand Slam semifinal.\"It\u0027s amazing. I\u0027m really happy. I cannot believe it,\" Pennetta told ESPN after the match. \"I was trying to play my tennis, trying to be aggressive, and everything was working really good.\"Very little was working, on the other hand, for the 10th-seeded Vinci, who committed 28 unforced errors and was never really in the match after having her serve broken midway through the first set.Vinci was never able to recover, and Pennetta glided through the second set rather easily for the win. Pennetta, 31, will face the winner of Daniela Hantuchova and Victoria Azarenka in Friday\u0027s semifinal.",
  "category": "TENNIS"
}