{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24138502/lakers-owner-jim-buss-says-team-working-to-extend-kobe-bryant",
  "title": "Lakers owner Jim Buss says team working to extend Kobe Bryant",
  "data": "  Kobe Bryant remains the center of the Lakers\u0027 universe. (USATSI) Los Angeles Lakers owner Jim Buss told ESPNLA.com Friday night that Kobe Bryant isn\u0027t going anywhere. Bryant is set to become a free agent at the end of this year, and with the roster, and really the entire franchise, in flux, there have been questions about whether it would be best for both the team and Bryant to part ways, allowing Bryant to pursue championship opportunities elsewhere and the team to truly start fresh. But Buss says forget it. \"I want to put an end to any speculation that we would allow Kobe to become a free agent,\" Buss told ESPNLosAngeles.com on Friday night. \"That\u0027s not going to happen. Kobe is a top priority for us. He\u0027s a Laker legend and always will be. I don\u0027t think we\u0027re done winning championships with him yet.\"[Lakers general manager] Mitch Kupchak and [Bryant\u0027s agent] Rob Pelinka have been talking, but with him being hurt, it has slowed the process some. I don\u0027t know when it\u0027ll get done, but I have faith in Rob and Mitch to work things out.\"via Jim Buss says Los Angeles Lakers won\u0027t let Kobe Bryant be free agent - ESPN Los Angeles.So the Lakers will re-sign Kobe, even if he doesn\u0027t take a drastic pay cut next summer. This kind of hurts their leverage a bit, but considering he\u0027s the second-greatest player in the franchise\u0027s history, it\u0027s not like they were coming from a position of strength anyway. Their best leverage in getting a price slice on Bryant comes down to Kobe\u0027s indomitable desire to win and obtain championship ring No. 6. The speculation about Bryant was built around financial reasons, about how smart it is to extend big money to a player past 35 years old who is coming off Achilles surgery. Would it be most prudent to consider the full season before locking Bryant into a new deal? Sure. But the Lakers also know his business value, not just to them but to their partners at Time Warner Cable, AEG and other entities. Bryant is simply too valuable through playing games for the Lakers to play games with off the court. ",
  "category": "NBA"
}