{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24138507/report-avery-bradley-talking-extension-with-celtics-bu-deal-unlikely",
  "title": "Report: Bradley talking extension with Celtics but deal unlikely",
  "data": "  Avery Bradley may not be able to steal an extension before the deadline. (USATSI) The Celtics are in a transition state, moving from contention in the Big 3 era to whatever will eventually come after. Like any team in such a position, that leaves complications on the table regarding their young talent coming up for extensions off their rookie deals. The most immediate of those concerns is Avery Bradley. CSN New England reports while a deal remains unlikely, the two sides are talking as the October 31st deadline approaches. Team president Danny Ainge, speaking prior to the Celtics Shamrock Foundation\u0027s annual gala, said he has had talks this month with Avery Bradley\u0027s representatives about extending the 6-foot-2 guard\u0027s contract.Ainge declined to address where those talks stand now, but all indications are that both sides will wait until Bradley becomes a restricted free agent this summer to work out a new deal.via Ainge says C\u0027s have talked extension with Bradley | Comcast SportsNet - CSNNE.com.I explored the situation over the summer and my thoughts haven\u0027t changed. In short, Bradley is a talented on-ball defender with good athleticism but lacks anything resembling a rounded offensive game or the defensive generalship capabilities to warrant a massive extension. They should let the market set his price and go from there. He\u0027s not going anywhere unless someone gives him a crazy deal, which is unlikely. The worst case scenario is that Bradley makes significant strides which forces the hand of the Celtics into a bigger deal. So really the bad development would be a player playing to the level of deserving a big deal. That\u0027s a good problem to have. This thing will pretty much work itself out. ",
  "category": "NBA"
}