{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24142726/evan-turner-on-extension-im-going-to-get-my-money-regardless",
  "title": "Update: Sixers\u0027 Evan Turner clarifies \u0027getting his money\u0027 remark",
  "data": "  Evan Turner isn\u0027t worried about his extension. (USATSI) Update: Turner posted the following to his Instagram page Saturday: \"The same sword they knight you, they gone good night you wit...\" I usually dont care what is written about me or what people think but in this case I do. I know you\u0027ll never win a fight with the media but ill fight any day when my character and intentions are misunderstood.This headline doesnt describe me as a person or who I am. Basketball is my passion, I dont play to get a paycheck. I play cause I love the game. I think its unreal and a blessing to be able to make money doing something you love to do and thats what I am doing. The headline above was intended to take the attention off me and keep it on my team. Im truly not worried about a matter that will be dealt with when the time comes. Im worried about the team atmosphere and getting better everyday, as I should be...hope to see everyone at the home openervia Photo by evanalmighty12.For reference, here\u0027s the full quote from Philly.com: \"I just show up and work hard. It doesn\u0027t really bother me. I just take it one day at a time. I\u0027ll be somewhere next year, so all that other stuff doesn\u0027t bother me. I\u0027m going to play hard, and I\u0027m going to get my money, regardless.\"via Brown disappointed he had to cut Royce White.Sounds a bit different, right? This sounds a lot more like \"If I work hard, I\u0027ll get paid, no matter what happens with the team.\" Turner\u0027s right that the quote paints him badly, and removing the context of it sets him up that way. More than anything it\u0027s a reminder that whenever dealing with a quote from a player, and hey, we provide a lot of them, you have to know the context of what they were saying. Original post: If you\u0027re a Philadelphia 76er, life is pretty bleak right now. Your team does not care about winning. Well no, that\u0027s not really accurate. Your team is allergic to winning right now. Even if you were to somehow pull your teammates up by their bootstraps and get them to play pretty well, management would trade you or your cohorts to make sure you\u0027re not good enough to ruin their lottery chances. But Evan Turner, subject of trade rumors and constant criticism as a No. 2 overall pick? He\u0027s not worried about much. \"I\u0027m going to get money regardless,\" he said after Friday\u0027s practice at Philadelphia College of Osteopathic medicine. \"I\u0027m not really going to worry about that.\"I just want to take it day by day and keep becoming a better player.\"via Turner\u0027s future with Sixers uncertain.Turner averaged 14 points, six boards and four assists last season for the 76ers. His shooting efficiency is the problem (42-37-74 FG-3pt-FT percentages). If he can just find a few go-to moves he can reliably hit, it would help things. And hey, he\u0027ll get minutes this year. Turner\u0027s comment more than anything shows that the players aren\u0027t in a position to think big picture. All they can do is come in and do their work. It\u0027s going to a be a tough year, they just have to hope it works out for them.",
  "category": "NBA"
}