{
  "url": "http://www.cbsnews.com/8301-33816_162-57609446/benedict-cumberbatch-voiced-film-jerusalem-inside-the-making-of-the-imax-movie/",
  "title": "Benedict Cumberbatch-voiced film \"Jerusalem:\" Inside the making of the IMAX movie",
  "data": " (CBS News) \"Jerusalem\" - a new movie narrated by actor Benedict Cumberbatch - takes viewers inside the Holy City in IMAX 3D. But how did the National Geographic Entertainment team gain such unprecedented access to the city, which is perhaps the world\u0027s most politically and religiously delicate locale?  Taran Davies, co-producer of the movie, said the film - which took five years to make - was an effort that came together \"over a million cups of tea.\"  He said, \"Jerusalem, over its 4,000-year history, it\u0027s the most fought-over place on Earth. It\u0027s been subject to 118 conflicts. It\u0027s been conquered 44 times and destroyed completely twice. But, yet, to this day, it is sacred to over half the world\u0027s population.\"   \n\n6 Photos\nJerusalem film reveals Holy City\u0027s stunning cityscape\nView the Full Gallery »\n\n\n\n\n\n\n\n\n He explained, \"I don\u0027t think IMAX footage has ever been shot of the ancient city or of the Holy Land, so this is really a first. These images that you see have never been filmed before. In fact, when we had our script, which we showed to the experts, they sort of laughed at us and said, \u0027Well, you\u0027re never going to be able to get half of what it is that you\u0027re asking for.\u0027  \"Over the course of ... about three years, we met with every single authority that you can possibly imagine meeting, from the Israeli government, military, the air force, the governor of East Jerusalem, the Religious Affairs in Jordan to name just a few of the organizations we had to meet.\"   In the process of making the movie, Davies said, \"every day was a new problem and one that you never knew that you would get over, but the wonder of the experience of making the film and the fact of bringing this giant-screen experience back to audiences here in the United States, the opportunity to visit the Holy Land, as we presented it here, is something that was worth fighting for every day for five years.\"  Speaking of Cumberbatch\u0027s narration, Davies said, \"He\u0027s done such a good job, and do you know what he said? He turned to us during the recording, and he said, \u0027Why didn\u0027t anyone teach me about this stuff when I was at school?\u0027\"  For more with Davies on the Jerusalem film and the story of life in the city that it tells, watch his full interview above.  ",
  "category": "ENTERTAINMENT"
}