{
  "url": "http://www.cbsnews.com/8301-207_162-57609458/marcia-wallace-of-bob-newhart-the-simpsons-dies-at-70/",
  "title": "Marcia Wallace, of \"Bob Newhart,\" \"The Simpsons,\" dies at 70",
  "data": " Updated at 9:21 p.m. ET  LOS ANGELES Marcia Wallace, the voice of scoffing schoolteacher Edna Krabappel on \"The Simpsons,\" whose wise-cracking characters on CBS\u0027 \"The Bob Newhart Show\" and other prime-time hits endeared her to generations of TV viewers, has died.  \n\nActress Marcia Wallace attends the 2009 American Federation of Television and Radio Artists Media and Entertainment Excellence Awards March 9, 2009, in Los Angeles.\n/\n\nGetty Images\n\n   \"Simpsons\" executive producer Al Jean said in a statement Saturday that her \"irreplaceable character,\" the fourth-grade teacher who contended with Bart Simpson\u0027s constant antics, would be retired from the show. Wallace was 70.  \"I was tremendously saddened to learn this morning of the passing of the brilliant and gracious Marcia Wallace. She was beloved by all at The Simpsons,\" Jean said. It\u0027s \"a terrible loss for all who had the pleasure of knowing her.\"  The statement did not provide a date for her death, or a cause.  \"Earlier we had discussed a potential storyline in which a character passed away; this was not Marcia\u0027s Edna Krabappel,\" Jean said. \"Marcia\u0027s passing is unrelated.\"  The longtime TV actress\u0027 credits ranged from playing a receptionist on \"The Bob Newhart Show\" to appearances on Candice Bergen\u0027s \"Murphy Brown.\"  On \"The Simpsons,\" Wallace provided the voice for world-weary Edna Krabappel, who smoked cigarettes, made sarcastic comments and finally found love in the arms of Simpsons neighbor Ned Flanders after fans voted online at the end of season 22 to keep the unlikely couple together.  Wallace\u0027s trademark \"Ha!\" punctuated Krabappel\u0027s frequent wisecracks, and her character was also known for the catchphrase, \"Do what I mean, not what I say.\"  Harry Shearer, the voice of Ned Flanders on the show, said Wallace \"brought this huge, positive energy\" to her work on \"The Simpsons.\"  \"She was just a warm and wonderful person,\" Shearer told The Associated Press.  ",
  "category": "ENTERTAINMENT"
}