{
  "url": "http://www.cbsnews.com/8301-207_162-57609176/oscar-season-starts-with-a-game-of-musical-chairs/",
  "title": "Oscar season starts with a game of musical chairs",
  "data": " The first act of the Oscar season is playing out like an episode of \"Survivor.\" \t Several anticipated films planned to be released in the heart of awards season have picked up stakes and moved to 2014. Changes often happen in the highly contentious fall movie season, but rarely has there been an exodus like this. \t \n\n\n\n\n\n37 Photos\nFall movies 2013\n\nMost recently, George Clooney\u0027s World War II drama \"The Monuments Men,\" previously dated for Dec. 18, was moved by Sony to early next year, after the end-of-year eligibility cutoff. Earlier postponed was Bennett Miller\u0027s brother drama \"Foxcatcher,\" with Channing Tatum and Steve Carell; \"Grace of Monaco,\" starring Nicole Kidman as Grace Kelly; and James Grey\u0027s \"The Immigrant,\" starring Joaquin Phoenix and Marion Cotillard. \t Martin Scorsese\u0027s \"The Wolf of Wall Street\" is also up in the air, widely expected to move from a long-planned November release to Christmas. Scorsese is racing to edit his ambitious Wall Street epic, starring Leonardo DiCaprio, in time for release this year. Paramount declined to comment on its plans for \"The Wolf of Wall Street,\" but the studio announced Thursday that its spy franchise film \"Jack Ryan\" is moving from Dec. 25 to Jan. 17. \t So why the game of musical chairs? The holiday season is a packed one, so the margins for capturing box-office and awards momentum are thin. And three Oscar favorites have already firmly established themselves: Steve McQueen\u0027s hugely acclaimed slavery epic \"12 Years a Slave\"; the global box-office juggernaut and technical marvel \"Gravity\"; and the Tom Hanks Somali pirate docudrama \"Captain Phillips.\" \t \n\n\n\n\n\nPlay Video\nChiwetel Ejiofor on role in \"12 Years a Slave\"\n\nFor now, the favorite is \"12 Years a Slave,\" which picked up a leading three nominations from the Gotham Independent Film Awards on Thursday. Based on the account of Solomon Northup (played by Chewitel Ejiofor), the film bears the weight of being a landmark -- a movie that depicts American slavery more faithfully than it ever has been before. Henry Louis Gates Jr. has called it \"the best film about slavery ever made from the point of view of a slave.\" \t \"It\u0027s going to go on its own journey and we\u0027ll see where that ends up,\" says Ejiofor. \"The important thing is that people should see it with their own eyes if there\u0027s hyper buzz about it. I think this is a deeply involved story about a man who had a profound experience. I was deeply moved by his book and his experience, and I feel like outside of anything else, that should be given its place and its own sort of room.\" \t \"Gravity\" has been a different kind of sensation, leading the box office for three consecutive weeks in addition to nearly universal raves from critics. Alfonso Cuaron\u0027s film and \"12 Years a Slave\" are currently the consensus top two Oscar contenders, according to a recent \"Gurus o\u0027 Gold\" poll of 15 Oscar prognosticators and film writers at MovieCityNews.com. \t But the reasons for the release date changes have less to do with the seeming lock on awards than with the individual challenges of each film. Clooney has said the extensive visual effects for \"The Monuments Men\" needed time for completion. Sony Pictures Classics said \"Foxcatcher,\" too, needed more time to finish. No reason was given for the Weinstein Co.\u0027s postponement of \"The Immigrant,\" which premiered at the Cannes Film Festival in May. \t \"Grace of Monaco\" is moving to March, Harvey Weinstein has said, because \"it\u0027s just not ready.\" Director Olivier Dahan has vehemently disputed that, telling French newspaper Liberation that he considers the film finished and strongly disapproves of the cut Weinstein is seeking. (The Weinstein Co. declined to comment.) \t A move to early next year, as \"The Monuments Men\" is doing, signals a lack of faith in awards attention. While the holiday season is the one of the most prestigious and lucrative times of the year to release a film, the early winter months are typically considered the doldrums of the moviegoing year. \t But it also means much more room at the box office. In late December, \"The Monuments Men\" would have had to compete with, presumably, \"The Wolf of Wall Street,\" Ben Stiller\u0027s \"The Secret Life of Walter Mitty,\" \u0027\u0027August: Osage County,\" \u0027\u0027Anchorman 2: The Legends Continue\" and the 3-D action film \"47 Ronin.\" \t The competition will be far less stiff when \"The Monuments Men\" opens next year. It will hope to follow the playbook of a few other recent awards season emigrants: Scorsese\u0027s \"Shutter Island\" ($294.8 million worldwide after a Feb. 18 debut in 2010) and \"The Great Gatsby\" ($348.8 million worldwide with a release last May). \t Aside from \"The Wolf of Wall Street,\" awards contenders yet to premiere include David O. Russell\u0027s Abscam drama \"American Hustle\" and the Disney tale of the making of \"Mary Poppins,\" \u0027\u0027Saving Mr. Banks.\" Riding in with acclaim from film festivals will be the Coen brothers\u0027 Greenwich Village folk tale \"Inside Llewyn Davis,\" Alexander Payne\u0027s Midwest road trip \"Nebraska,\" Spike Jonze\u0027s futuristic romance \"Her\" and the Texas HIV drama \"Dallas Buyers Club.\" \t A lot can change between now and the 86th annual Academy Awards on March 2. But even in October, some things are locked. \t \"Awards don\u0027t make your movie more pretty or more ugly,\" says Cuaron. \"You\u0027ve already finished it. The rest is not in my hands.\"  ",
  "category": "ENTERTAINMENT"
}