{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24137887/hall-of-famer-bill-sharman-dead-at-87",
  "title": "Hall of Famer, former Lakers coach Bill Sharman dead at 87",
  "data": "Hall of Famer Bill Sharman has died at the age of 87, his wife told the LA Times Friday. Sharman had suffered a stroke earlier this week. The Lakers released the following statement: Bill Sharman, former Head Coach, General Manager, President and Special Consultant for the Lakers, passed away this morning at his home in Redondo Beach. Sharman passed away peacefully surrounded by his wife Joyce and his family.In 1971-72, his first season with the Lakers, Sharman led the club to their first NBA championship in Los Angeles, a then-NBA record and current franchise record 69 wins, and compiled the longest winning streak in the history of professional sports (33 consecutive victories). Sharman\u0027s success that season earned him the NBA\u0027s “Coach of the Year” award, and he would go on to lead the team until 1975-76. After his coaching stint ended, Sharman transitioned to the Lakers front office, being named General Manager prior to the 1976-77 season and later becoming team president following the 1982 season. Sharman served for the past 23 years as a Special Consultant with the Lakers.“Today is a sad day for anyone who loves and cares about the Lakers,” said Lakers President Jeanie Buss. “As our head coach, Bill led us to our first championship in Los Angeles, and he was an important contributor to the 10 championship teams that followed. For the last 34 years, his importance to Dr. Buss and our family, and for the last 42 years to the Lakers organization, cannot be measured in words. His knowledge and passion for the game were unsurpassed, and the Lakers and our fans were beneficiaries of that. Despite his greatness as a player, coach and executive, Bill was one of the sweetest, nicest and most humble people I\u0027ve ever known. He was truly one of a kind. On behalf of our organization, the Buss family, and the entire Lakers family, I send my condolences, prayers and love to Joyce and the Sharman family.”“Bill Sharman was a great man, and I loved him dearly,” said Lakers General Manager Mitch Kupchak. “From the time I signed with the team as a free agent in 1981 when Bill was General Manager, he\u0027s been a mentor, a work collaborator, and most importantly, a friend. He\u0027s meant a great deal to the success of the Lakers and to me personally, and he will be missed terribly. My love and sympathy go to Joyce and Bill\u0027s family.”Born William Walton Sharman on May 25, 1926, in Abilene, Texas, he grew up in Lomita, attending Narbonne High School in Harbor City before moving to Porterville in the San Joaquin Valley. He excelled not only in basketball but football, baseball, tennis, track and boxing.Sharman was elected to the Naismith Memorial Basketball Hall of Fame as a player in 1976 and as a coach in 2004, joining John Wooden and Lenny Wilkens as the only men honored in both roles, and in 1996 was selected as one of the 50 greatest players of the NBA\u0027s first 50 years.Bill is survived by his wife Joyce, two daughters (Nancy \u0026 Janice) and two sons (Tom \u0026 Jerry) from a previous marriage.Warriors executive and former Laker Jerry West also released a statement: “This is a very sad day for me.  Bill Sharman was, without a doubt, one of the greatest human beings I have ever met and one of my all-time favorite individuals, both as a competitor and as a friend.  He was the epitome of class and dignity and, I can assure you, we find few men of his character in this world.  I extend my deepest sympathy to his wife, Joyce, and his children.  We will miss him.”The Celtics also released a statement Friday: \"The Boston Celtics organization was deeply saddened to hear of the passing of Bill Sharman today,” said Celtics President of Basketball Operations, Danny Ainge. “Bill was one of a handful of people that have been enshrined in the Hall of Fame as a player for his exploits on the court and for his guidance in coaching from the sidelines. Bill combined with Bob Cousy to form one of the dominant backcourts of their era winning four championships together. The Celtic family has lost a great friend today.”SI.com shared several gems of journalism about Sharman Friday.",
  "category": "NBA"
}