{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24137615/lebron-says-he-no-longer-views-paul-pierce-as-his-individual-rival",
  "title": "LeBron says he no longer views Paul Pierce as his individual rival",
  "data": "  LeBron says he doesn\u0027t have a rival. (USATSI)LeBron James has really had no equal for the last five years, but if there was ever one player that often stood in his way, or got under his skin, it was Paul Pierce. Between the Celtics and Heat battling constantly for Eastern Conference supremecy to the knockdown, drag-out playoff series, Pierce and LeBron stood toe-to-toe often. What it led to was a rivalry within a rivalry, with Pierce kind of becoming LeBron\u0027s nemesis. But now, LeBron says he doesn\u0027t see it that way, or any other player as an individual rival for that matter. Via the Miami Herald:“Paul was one of those rival guys, but I\u0027ve been going against different guys the last few years.[...]“It\u0027s not just one guy,” James said. “I haven\u0027t played against one individual for a long period of time — since basically it was me and Paul. Me and Paul, we had so many duels and almost every year we were going against Boston whether I was in Cleveland the last few years or Miami … So, I don\u0027t know if there is one particular guy. There are some teams I believe are very competitive in both conferences, but it\u0027s not just one guy.”I don\u0027t think LeBron is saying that there\u0027s no one on his level, that he\u0027s unmatched and therefore unworthy of a rival, as much as he\u0027s saying that he doesn\u0027t view any single player as his nemesis. LeBron said over the summer that if he had a rival, it would\u0027ve been Pierce. \"I would say that I don\u0027t really have an individual rivalry. I think the closest would be Paul Pierce,\" James said in June. \"I would say Boston is a rival of mine because I\u0027ve met them so many times in the postseason. I\u0027ve been able to advance against them, they\u0027ve sent me home fishing a few times. So I would say Boston and Paul Pierce would kind of be that guy, if I had to name just one guy.\"But now, with the Celtics now turned into the Nets with Pierce and Kevin Garnett moving to Brooklyn, that animosity seems to have dried up to some degree. Kobe Bryant was always seen as the likely rival, but he and LeBron never met in a Finals. Carmelo Anthony could be, but his teams have never been quite good enough. Kevin Durant is as close to an equal as there is to LeBron, but the only time he and LeBron would meet is in the Finals, where they have once. But for LeBron, it\u0027s just him against the world. Which sounds about right. ",
  "category": "NBA"
}