{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24137976/report-suns-trade-marcin-gortat-to-wizards-for-emeka-okafor",
  "title": "Report: Suns trade Marcin Gortat to Wizards for Emeka Okafor",
  "data": "  The Wizards have reportedly traded for Marcin Gortat. (USATSI) ESPN reports the Suns have agreed on a trade sending Marcin Gortat to the Wizards for Emeka Okafor. Hearing: Suns are trading Marcin Gortat to the Wizards. Okafor on his way to Phoenix. More details to come— Marc Stein (@ESPNSteinLine) October 25, 2013Proposed deal will send Gortat, Shannon Brown and Kendall Marshall to Wizards and Suns on course to receive Emeka Okafor \u0026 at least one pick— Marc Stein (@ESPNSteinLine) October 25, 2013Translation: The Washington Wizards are not screwing around.The Wizards are hellbent on making the playoffs, and that objective was compromised when Emeka Okafor went down with a herniated disck in his neck. He\u0027s out indefinitely. This puts them right back into the playoff race and can arguably be considered an upgrade over Okafor. The pick is reportedly a first-round pick in next year\u0027s loaded draft, protected through No. 12. Phoenix gets Wizards pick in 2014 -- which is protected to No. 12.— Jeff Goodman (@GoodmanESPN) October 25, 2013For the Suns, their intention is clear. Focus on young talent, clear more salary space, and focus on next June\u0027s draft. Lock them into the No. 2 spot in the lottery right now. That also moves them into an even better position than the Sixers after Philadelphia traded Jrue Holiday for Nerlens Noel and a protected 2014 pick from the Pelicans. The Suns arleady have a lotto-protected pick from the Pacers and a top-13 protected pick from Minnesota. The Wizards are likely to be just better than that No. 12 spot and just low enough to still hit in the top 15. In a loaded draft, that\u0027s terrific value. Zach Harper Grading the trade Okafor is scheduled to make over $14 million according to ShamSports.com, but is an expiring contract. Gortat is also an expiring at just over $7.7 million this season. Gortat said earlier this month that he was fine with being on the trade block. No surprise, given Phoenix\u0027s struggles after the trade of Steve Nash in 2012. Multiple sources including NBA.com report the Wizards will waive Marshall and Brown. Brown won\u0027t have a hard time finding somewhere to land. He\u0027s got his drawbacks but is decent second or third guard. Marshall will likely have a much harder time, as he just doesn\u0027t have the athleticism or outstanding skill to play minutes at his point in his career. ",
  "category": "NBA"
}