{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24132864/report-mike-miller-considering-suing-the-heat-over-involvement-in-defraudment",
  "title": "Report: Miller considers suing Heat over loss of $1.7 million in swindle",
  "data": "  Mike Miller could sue his former team. (USATSI) When Mike Miller was waived last summer using the amnesty clause by Miami, it was thought there would be no bad blood. He helped them win two championships, they needed the financial relief, Miller wanted to keep playing, these things happen. But it appears that there is an emnity from Miller\u0027s side that has nothing to do with basketball. The Miami Herald reports that Miller has drawn up a complaint to be filed in court asking the Heat for over $1.7 million in damages related to a scam he fell victim to. The head of the scam was introduced to Miller by a team employ. It\u0027s a long story. Take it away, Herald: Miller, who now plays for the Memphis Grizzlies, lost $1.7 million in a scam allegedly orchestrated by Haider Zafar, a South Beach bling king who presented himself as a member of a wealthy Pakistani family.According to Miller\u0027s complaint that has been drawn up but not yet filed, a Heat employee introduced Miller to Zafar, and Zafar used $700,000 of the money he stole from Miller to pay for courtside Heat tickets.Settlement talks between Miller and the Heat have stalled. Miller asked for that $700,000 back from the Heat, plus attorney\u0027s fees, but “the parties were far apart,” Miller\u0027s attorney, Andrew Fine, said.In the potential lawsuit, Miller is seeking a lot more: the entire $1.7 million that he lost in Zafar\u0027s scam.via Mike Miller mulling lawsuit against Heat; Dolphins call about Pro Bowler; UM, Marlins | Sports Buzz.The paper notes that the \"bling king\" is in custody in Ohio on an unrelated fraud case, that teammates James Jones and Rashard Lewis were also victims of the fraud, that the Heat employee who introduced the two left the team during the playoffs, and most disturbingly, that meetings involving the two were held at the Heat\u0027s offices. The paper notes that Miller hasn\u0027t filed the complaint yet, but he very clearly takes the situation seriously.Miller signed with the Grizzlies last July.",
  "category": "NBA"
}