{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24142937/report-hayward-jazz-far-apart-on-extension-talks",
  "title": "Report: Hayward, Jazz \u0027far apart\u0027 on extension talks",
  "data": "Gordon Hayward and the Jazz haven\u0027t agreed on an extension yet.   (USATSI)Yahoo Sports reports that the Utah Jazz and Gordon Hayward are not close on a contract extension with the October 31st deadline less than a week away.As the deadline for Class of 2010 contract extensions looms at midnight on Friday, the Utah Jazz and forward Gordon Hayward remain far apart in discussions, league sources told Yahoo Sports.Talks are expected to pick up this week, but there\u0027s nothing resembling even the baseline for an agreement in place, sources told Yahoo.via Jazz, Gordon Hayward far apart in extension talks - Yahoo Sports.The Jazz just gave Derrick Favors a four-year, $49 million deal. Hayward is better than Favors, so one would assume his reps would want a better deal than that. The combination of the two deals could seriously impact their future cap space, but they also know the two players are good enough to provide a core for them to build towards the future with.The deadline for extensions for players coming off rookie scale deals is Oct. 31. If a deal isn\u0027t in place, they will enter restricted free agency next summer.The Jazz are likely anticipating a breakout season for Hayward, a player they selected ninth overall in 2010. Hayward, 23, has steadily improved season by season, putting up respectable numbers in 2012-13, while improving quite a bit as a defender.With Utah entering in a bit of a rebuilding mode, Hayward is set to take on more offensive responsibility and could improve on his 14.1 points he averaged last season. That happens, and with the hunger throughout the league for stars, Hayward could find himself getting a lucrative offer sheet in restricted free agency. So the Jazz are trying to get out in front of it. It\u0027s kind of a gamble because Hayward could have a mediocre season and you don\u0027t know how he\u0027s set to respond, but he\u0027s performed well in preseason and appears ready.The Jazz are really banking on Favors and Hayward being key parts of their future, because they\u0027re set to commit a solid portion of their cap to both. It\u0027s a gamble, but probably a necessary one. Because once you get talent, you really can\u0027t just let them walk away.",
  "category": "NBA"
}