{
  "url": "http://www.cbssports.com/nba/eye-on-basketball/24138188/reports-andrew-bogut-agrees-to-threeyear-extension-with-warriors",
  "title": "Reports: Andrew Bogut agrees to three-year extension with Warriors",
  "data": "  Andrew Bogut is staying with the Warriors long-term. (USATSI)The Warriors didn\u0027t get Dwight Howard over the summer, so they\u0027ve just inked their current center to an extension.According to multiple reports, the Warriors and Andrew Bogut have agreed on a three-year extension worth as much as $42 million including incentives. The base salary is reportedly $36 million, according to Yahoo Sports.The incentives are said to be mostly based around him playing and performing at the level he\u0027s capable of. For Bogut, a lot of his career has been hampered due to injuries, most recently that being an ankle issue with the Warriors and a severe elbow injury he suffered in Milwaukee. The Warriors acquired Bogut in a three-way deal in March 2012 that sent Monta Ellis to Milwaukee. The Warriors are obviously trying to get out in front of this by signing Bogut now and while it\u0027s somewhat of a gamble, it\u0027s the smart move. If Bogut were to perform at the level he\u0027s capable of and stay healthy, he would require a top level contract when he hit free agency next summer. By signing Bogut now, the Warriors could be saving big time in the long run. Bogut started the Warriors final 32 regular season games as well as all 12 of their postseason games and played well. Bogut had recently acknowledged that his deal would likely include incentives, but still wanted solid guaranteed money.“Just based on the fact that my last two injuries I can\u0027t control,” Bogut told NBA.com recently. “If these were chronic injuries from lack of conditioning or not working out in the summer or being a fat slob, I can understand the caution. But would I do things to the extent that Andrew Bynum\u0027s done with his contract? Hell no. The clauses that he has, there\u0027s no chance I would sign a contract. But basically having game incentives — whatever the number is, 60, 70, whatever it is — I have no problem. I think that\u0027s only fair.”With this deal done, the Warriors have a long-term core built around him, Stephen Curry, Andre Iguodala, Harrison Barnes and Klay Thompson. Not bad at all. Bogut, 28, averaged 5.8 points and 7.7 rebounds last season, but has averages of 12.2 points and 9.2 rebounds for his career.",
  "category": "NBA"
}