{
  "url": "http://www.cbssports.com/general/eye-on-sports/23448742/no-7-federer-falls-in-straight-sets-as-no-19-robredo-shocks-us-open",
  "title": "No. 7 Federer falls in straight sets as No. 19 Robredo shocks US Open",
  "data": "  Federer hadn\u0027t dropped one set all tournament before Monday night. (USATSI) Spain\u0027s No. 19 Tommy Robredo landed the upset of the US Open on Monday night, defeating five-time Open champion Roger Federer in straight sets, 7-6, 6-3, 6-4.Of the ten times that the two had met previously, Federer had won them all. In fact, Federer hadn\u0027t even dropped a set throughout the first three rounds of the Open, and only once did an opponent take more than three games from him. But Robredo, despite an extremely partisan crowd, maintained his composure to reach the quarterfinals at Flushing Meadows for the first time in his career. He had failed in his seven previous fourth-round matches.“I won. That\u0027s amazing, isn\u0027t it?” Robredo said following the stunning win. “I beat the best guy of all-time in a great stadium like this in the US Open. I\u0027m delighted. It\u0027s unreal.”Robredo was clinical in his first-ever defeat of Federer. The Spaniard landed 70 percent of his first serves in, minimized his errors and converted on 4-of-7 breakpoints. Federer, in stark contrast, didn\u0027t capitalize on his break-point opportunities (2-of-16). But more than breaking Robredo\u0027s serves, Federer was far from his typically precise self, amassing 43 unforced errors. Robredo also consistenly hit minimal angles even when Federer rushed the net.Robredo\u0027s stunning upset also derails what would\u0027ve likely been the most enticing match of the US Open: The first-ever Nadal-Federer showdown at the Open.It wasn\u0027t meant to be, as Robredo broke Federer at 3-3 in the third, then refused to give-in to the 17-time major winner.Up next he\u0027ll likely take on his countryman Rafael Nadal (Robredo is 0-6 all-time), hoping for an even bigger upset than what transpired on Monday night. ",
  "category": "TENNIS"
}