{
  "url": "http://www.cbssports.com/general/eye-on-sports/23478451/no-8-gasquet-beats-no-4-ferrer-secures-firstever-us-open-semifinal",
  "title": "No. 8 Gasquet beats No. 4 Ferrer, secures first-ever US Open semifinal",
  "data": "  Richard Gasquet celebrates his first Grand Slam semifinal since 2007. (USATSI) Richard Gasquet forged ahead to maintain his best-ever showing at the US Open, advancing to the semifinals with a thrilling, five-set victory over No. 4 David Ferrer on Wednesday afternoon. Gasquet nearly blew a two set lead to last year\u0027s semifinalist, eventually winning 6-3, 6-1, 4-6, 2-6, 6-3. The match lasted 3:23 minutes.Wednesday\u0027s win came on the heels of Monday\u0027s five-setter which saw Gasquet prevail after a grueling 4:40 minutes. Even more challenging, Ferrer is widely known as one of the most fit players in the world – his hustle as much a staple of his game as his backhand.  “I think I have experience in five sets. I\u0027ve played a lot in my life, and this one was very important to go in semis at US Open,” Gasquet said. “It\u0027s important for my game, especially against a big player like him. I kept my serve in the fifth and I broke him.”It was a combination of timely ground strokes and concentration that allowed the 27-year-old to advance and not cough up his two-set lead, despite Ferrer\u0027s backhand which won him the third and fourth sets. Gasquet finished with 52 winners to Ferrer\u0027s 40, and was especially tough against his counterpart\u0027s serves in the fifth set. Gasquet broke Ferrer in the sixth game to take a 4-2 lead, then faced little resistance to win the last two.Ferrer, who has advanced to at least the quarterfinals of the last eight Grand Slams, dropped his career record to 8-2 against the Frenchman and 19-10 in career five-set matches. Gasquet upped his total to 7-12 in such circumstances.Prior to this year, Gasquet had advanced to the fourth round of the US Open four times but couldn\u0027t manage to break through. In fact, only once in his career has he made it past the fourth round of any major (semifinals at Wimbledon 2007).His reward?He\u0027ll take on the winner of No. 2 Rafael Nadal (career 0-10) or No. 19 Tommy Robredo (2-2) for a spot in the finals. Fortunately, he\u0027ll have two days to rest before Saturday\u0027s match. ",
  "category": "TENNIS"
}