{
  "url": "http://www.cbssports.com/general/eye-on-sports/23546120/serena-williams-repeats-at-us-open-wins-17th-grand-slam-title",
  "title": "Serena Williams repeats at US Open, wins 17th Grand Slam title",
  "data": "Serena Williams weathered swirling winds and remarkable will from Victoria Azarenka to win her second successive US Open championship on Sunday, 7-5, 6-7, 6-1. The final -- a rematch of last year\u0027s three-setter which Williams eventually won -- lasted 2:45 and was highlighted by a 70-minute second set that saw Azarenka fend off volley after volley to stave off elimination. Down 4-1 in the second, Azarenka fought back, breaking Williams three times before ultimately stealing the set off an 8-6 tiebreak. Williams had been broken just twice heading into the final.Most Grand Slam titles - WomenPlayerTotAOFOWUSOMargaret Court2411535Steffi Graf224675Helen Willis190487Chris Evert182736Martina Navratilova183294Serena Williams175255Key: AO - Australian Open; FO - French Open; W - Wimbledon; USO - US Open\"Vika\u0027s such a great opponent. She\u0027s such a great fighter, and that\u0027s why she\u0027s been able to win multiple Grand Slams,\" Williams said. \"You know, it was never over until match point.\"It was the first time throughout Williams\u0027 entire US Open run that she lost a set, previously dropping a high of four games and only 16 total. It was also one of the few times that Williams showed any real frustration, slamming the racket on the ground after losing the set. Her footwork had stalled, her body language had plummeted, and her concentration -- as evident by 35 unforced errors -- had waned. Williams, though, quickly moved past her devastating collapse, polishing off the No. 2 seed in a quick, 37-minute final set to win her fifth US Open title. She broke Azarenka twice in the final set, the No. 2 seed seemingly spent from her comeback.   As impressive as her final set was, the bigger achievement may have been handling both her nerves as well as the swirling winds throughout Arthur Ashe Stadium. Numerous times Williams was caught off guard when an Azarenka return would swerve, throwing off the 17-time Grand Slam winner\u0027s timing. She continued to plead to no one in particular that the wind, as much as her opponent, was affecting her game.But with nine aces and 36 winners (compared to Azarenka\u0027s two and 17, respectively), Williams dodged what would\u0027ve been one of the biggest collapses of her career. Instead, she won her second Grand Slam of the year (French Open), ensuring that she\u0027ll remain the No. 1 player in the world.Her year concludes with nine tournament titles, an impeccable 67-4 record and her 17th career Grand Slam singles championship, one behind Chris Evert and Martina Navratilova. ",
  "category": "TENNIS"
}