{
  "url": "http://www.cbsnews.com/8301-204_162-57609212/fat-letters-outrage-some-california-parents/",
  "title": "\"Fat letters\" outrage some California parents",
  "data": " Some California parents are outraged because they say their children are being sent home with \"fat letters,\" or notes explaining that their children are considered obese.  California students are required by the California Department of Education to take a Physical Fitness Test that looks at six areas of fitness during grades five, seven and nine.  California happens to be one of 19 states that require schools to screen for obesity, and they do so through a body mass index test (BMI) reading, a height-to-weight ratio measurement that is used by doctors to designate if a person is underweight, normal weight, overweight or obese. This BMI screening is done at the same time as the Physical Fitness Test. The department also requires that students are notified of their test results, normally via a letter, an information officer from the California Department of Education told CBSNews.com. However, individual local school districts can make the choice to let parents know the results as well. These letters include the BMI of each student.  The National Eating Disorders Association showed the Sacramento Bee one letter sent to a 12-year-old seventh grader. She was rated in the \"Healthy Fitness Zone\" in all categories except for aerobic (the ability to run one mile) and body mass index. The letter said she received a \"needs improvement -- health risk\" grade in these two areas. The Association told the Bee that it feared that students who read this letter may be influenced into developing eating disorder behaviors like skipping meals, vomiting or taking laxatives. The group previously found that 42 percent of first through third grade girls have said they want to be thinner, and 81 percent of 10-year-olds are afraid of being fat.  Some other California school districts, including those in the San Fernando Valley, go a little further and specifically send letters just addressing a child\u0027s obesity issue to their parents -- not just their test results.  \"We let the parents know in a gentle fashion, but we also send out a ton of handouts to try to help that family,\" Lauren Schmitt, a registered dietitian who works with preschoolers in the San Fernando Valley, told CBS Los Angeles.  Schmitt said that they use growth charts and percentiles to make their obesity judgments. If a child is in the 95th percentile for their age and weight or height and weight, they are considered to be obese. She said out of the 900 two to five-year-olds she works with, about 200 are obese.  \"It shouldn\u0027t be a stigma. It\u0027s not a way to categorize someone. It\u0027s just showing that this child has increased risk to be obese as an adult, which then could lead to quite a few chronic diseases,\" said Schmitt. \n\n\n\n\n\nPlay Video\n\"Fat\" letters being sent to parents of overweight children\n\nMassachusetts was another state that mandated BMI screening for students and required parents to be notified if the child was overweight or obese. However, the state reversed its decision on the \"fat letters\" in October because of concerns over bullying and self esteem.  I think it just hits home, that it\u0027s very common sense. Why are we doing this?,\" Tracy Watson, whose son Cam was sent home with a letter than he was obese, told CBS Boston. \"These letters were doing more harm than good to kids out there.\" However, Harold Cox, a member of the Massachusetts Public Health Council, voted that the letters are necessary because they teach parents about healthy lifestyles, diets and exercise.  Childhood obesity rates have more than doubled in children and tripled in adolescents over the last three decades, according to the Centers for Disease Control and Prevention. Now, more than one-third of children and adolescents were overweight and obese. \"Just because you don\u0027t like the information that you\u0027re getting doesn\u0027t mean you shouldn\u0027t get the information,\" Cox said to CBS Boston. \"Obesity is not going away. A third of our children in our state have some weight problem.\"  ",
  "category": "HEALTH"
}