{
  "url": "http://www.cbsnews.com/8301-204_162-57608967/flu-shot-reduces-heart-attack-risk-in-high-risk-patients-says-study/",
  "title": "Flu shot reduces heart attack risk in high-risk patients, says study",
  "data": " Every flu season doctors spread the word about the importance of getting a vaccine to avoid serious complications from the illness or even death for some high-risk groups. \n\n\n\n\n\nPlay Video\nFlu shot: What you need to know about the new vaccine\n\n A new study adds the jab might also help stave off heart attacks and strokes. Canadian researchers at six studies of heart health and found people who got a flu shot were less likely to experience a major cardiac event or die from heart-related causes. \"These findings are extraordinary given the potential for this vaccine to serve as yearly preventative therapy for patients with heart disease, the leading cause of death among men and women in North America,\" study author Dr. Jacob Udell, a cardiologist at the University of Toronto, said in a statement. For the study, researchers pulled data on more than 6,700 patients who were 67 years old on average. About 35 percent had a history of heart problems. They found that people who got the flu shot were 36 percent less likely to experience a major event such as a heart attack, stroke, heart failure or death from cardiac-related causes one year after receiving the vaccine. Those who had a recent heart attack -- and therefore are at higher risk for another -- had a 55 percent lower risk for a cardiac event following the shot. Overall, participants were less likely to die from cardiac-related causes and other causes if they received flu shots. The findings were published Oct. 22 in JAMA. \n\n\n\n\n\nPlay Video\nStudy: Flu shot helps lower risk of heart attack and stroke\n\n\n\n\n\n\n\nPlay Video\nFlu shots may help reduce heart attack risk\n\n Previous studies have linked flu vaccines and heart protection but this is the first study to retrospectively look back at earlier research papers to form a larger data pool, Dr. Curtis Rimmerman, the Gus P. Karos Endowed chair in clinical cardiovascular medicine at the Cleveland Clinic, told CBSNews.com. \"I think there is some power in numbers here,\" he said. To him, the most important finding was the protection offered in people with pre-existing heart conditions up to 12 months after the shot. Flu can be very serious, causing significant respiratory symptoms and fever. People with preexisting medical conditions may fare worse, and the Centers for Disease Control and Prevention adds those who have previously had heart failure or disease may worsen their condition if they come down with the flu. \"It could be the tipping point to push them over the edge,\" said Rimmerman, who was not involved in the new study. The researchers called for a more rigorous, controlled study to see if giving flu shots can reduce heart events, since this study only looked back at older research. Rimmerman emphasized that while high-risk patients showed the most protection, that doesn\u0027t mean other people won\u0027t be offered the same cardiovascular benefits. For those who won\u0027t get the shot because they fear getting sick, he said \"the (vaccine\u0027s) benefits clearly quite outweigh the risks.\"  ",
  "category": "HEALTH"
}