{
  "url": "http://www.cbssports.com/golf/eye-on-golf/24103071/golf-writer-rips-tiger-woods-gives-him-grade-of-f-for-2013",
  "title": "Golf writer implies Tiger Woods cheats, gives grade of \u0027F\u0027 for 2013",
  "data": "  Tiger Woods had the toughest five-win season ever in 2013. (USATSI) More Golf: Leaderboard | Rankings | Schedule | Expert Picks | Equipment | FedEx CupTiger Woods won five times in 2013 which, you would think, deserves a year-end grade of an \"A\" or at least a \"B+,\" right?Not if you\u0027re Brandel Chamblee.The Golf Channel commentator and contributor to Golf.com said on Friday Woods deserves an \"F\" for the year.He explains his reasoning with a story about himself:\"When I was in the fourth grade, I cheated on a math test and when I got the paper back it had \"100\" written at the top and just below the grade, was this quote, \u0027Oh, what a tangled web we weave when first we practice to deceive!\u0027 It was an oft-quoted line from the epic poem \"Marmion\" by Sir Walter Scott, and my teacher\u0027s message was clear. Written once more beneath that quote was my grade of \"100\", but this time with a line drawn through it and beneath that an F.\"I never did ask my teacher how she knew I cheated and I certainly didn\u0027t protest the grade. I knew I had done the wrong thing and my teacher the right, but I never forgot the way I felt when I read that quote.\"I remember when we only talked about Tiger\u0027s golf. I miss those days. He won five times and contended in majors and won the Vardon Trophy and ... how shall we say this ... was a little cavalier with the rules.\"I think the line between being critical and trying to crawl inside the head of somebody you don\u0027t know personally is pretty thin and I think Chamblee stepped over it. His opinion is his opinion but I don\u0027t agree with it. If we focused on, say, Charlie Hoffman as much as we do Woods would we also draw the same conclusions about him and his ball drops and everything else?Maybe, but the point is not whether or not we would, it\u0027s that we have nothing to compare modern-day coverage of Tiger to. It\u0027s difficult for me to say \"Woods is doing this and others wouldn\u0027t!\" because there\u0027s no comparison.For more golf news, rumors and analysis, follow @EyeOnGolf and @KylePorterCBS on Twitter or Google+ and like us on Facebook.",
  "category": "GOLF"
}