{
  "url": "http://www.cbssports.com/golf/eye-on-golf/24128168/pga-tour-expert-picks-cimb-classic",
  "title": "PGA Tour Expert Picks: CIMB Classic",
  "data": "  Will Rickie Fowler win for the second time in his career this weekend? (USATSI) More Golf: Leaderboard | Rankings | Schedule | Expert Picks | Equipment | FedEx CupThe 2013-2014 PGA Tour season gets going early with a new wraparound schedule and the third event of the season (and first international event) is the CIMB Classic.Let\u0027s do a little Q\u0026A on what to expect from this week\u0027s event.What is it?CIMB Classic, the third event (of six total) of the fall portion of the 2013-2014 PGA Tour season.Where is it?Kuala Lumpur Golf \u0026 Country Club in Kuala Lumpur, MalaysiaWhen is it?Oct. 24-27What is the purse?$7 millionHow can I watch it?This is a little complicated. It will be aired live from 11 p.m. - 3 a.m. starting Wednesday night through Sunday morning on Golf Channel.There will also be a replay each day (Thursday through Sunday) on Golf Channel from 6-10:30 p.m.Who\u0027s playing?Some notable names include Phil Mickelson, Keegan Bradley, Sergio Garcia, Hideki Matsuyama, Rickie Fowler, Nick Watney, Bill Haas, Ernie Els, Bubba Watson, and Billy Horschel.It\u0027s by far the biggest event in terms of big-time names so far this fall season.Who are the former champions?2012 -- Nick Watney2011 -- Bo Van Pelt2010 -- Ben CraneWait, Malaysia? The PGA Tour plays in Malaysia?I know, weird, right?Until this year this tournament wasn\u0027t an official money event on the PGA Tour but with the new wraparound schedule it\u0027s official -- 500 FedEx Cup points, the whole nine yards. The tournament has only been in existence for three years.It\u0027s the first tournament ever sanctioned by the PGA Tour in southeast Asia and is currently co-sanctioned by the Asian Tour.Where\u0027s Tiger?Tiger Woods actually played in this event last year and finished T4 but he\u0027s skipping this time around and will play a made-for-TV event with Rory McIlroy on Sunday night (US time).So who are you picking?I\u0027m glad you asked. Here are my picks for the CIMB Classic:WinnerRickie Fowler (33-1) -- Fowler has only played this event once, a T5 back in 2010 when his buddy Ben Crane took the title.Fowler usually has strong starts to his seasons, though. He finished in the top six in three of his first seven events of the 2013 season and top 10 in five of his first 14 events of 2012. Plus, somebody has to keep up the tradition of an Oklahoma State golfer winning this tournament in odd-numbered years (Bo Van Pelt won in 2011)!Lock for top 10Hideki Matsuyama (16-1) -- I\u0027m telling you right now, you need to buy Matsuyama stock. He finished T3 at the Frys.com Open before skipping the Shriners last week.It\u0027s no joke that he\u0027s the the fourth-biggest favorite in a loaded field this week in Malaysia. After getting cut at the Sony Open earlier this year he played six other PGA Tour tournaments and never finished worse than T21. That includes a T10 at the US Open, T6 at the British Open, and T19 at the PGA Championship. Matsuyama is the real deal.Oh, and have I mentioned he\u0027s 21 years old?SleeperHarris English (66-1) -- He\u0027s never played this tournament and didn\u0027t finish in the top 10 after winning the St. Jude Classic last season but his game is better than 66-1, especially in a small field like this.I think English gets his second win in the 2013-14 season and until Vegas bumps his odds I\u0027ll keep slotting him in this position.For more golf news, rumors and analysis, follow @EyeOnGolf and @KylePorterCBS on Twitter or Google+ and like us on Facebook.",
  "category": "GOLF"
}