{
  "url": "http://www.cbssports.com/collegefootball/writer/dennis-dodd/24137829/cardinals-chiefs-mizzou-tigers-make-missouri-the-showoff-state",
  "title": "Cardinals, Chiefs, Mizzou Tigers make Missouri the Show-Off State",
  "data": "  Missouri loves company -- when it comes to winners. (USATSI) KANSAS CITY, Mo. -- What this scene really needs is Stan Musial -- or Lamar Hunt or Dan Devine. But they\u0027re gone and that\u0027s the real shame of what\u0027s happening with this Missouri Miracle, or whatever you want to call it at the moment.It needs someone to share it with, totally.Together, the Kansas City Chiefs, St. Louis Cardinals and Missouri Tigers have reached an all-time high in the Show-Me State. But Cardinal fans could -- for the most part --- care less about the Chiefs. The same for the Chiefs in regard to the Cardinals. Missouri is the state university -- with an undefeated football team -- but there are diehard Chiefs fans who are also Jayhawks, loyal to the nearby state university in Lawrence, Kan.Best not to even go there.It is, one state under ... sod, really. The fans consider sacred the ground on which their heroes play these days. That includes the hallowed turf at Arrowhead Stadium, where the Kansas City Chiefs are the NFL\u0027s lone undefeated team in Week 8.Missouri resides at 87-year-old Faurot Field, where greats have trod but never in this fashion -- 7-0 and a top-five ranking in only the Tigers\u0027 second season in the mighty SEC.Busch Stadium is in its third reincarnation but already has hosted three World Series in its short history (since 2006). The latest continues Saturday when the Fall Classic moves to St. Louis for Game 3 with the Red Sox.That would be the same day Missouri hosts South Carolina with a chance to go 8-0 for the first time since 1960. That\u0027s Saturday, the day before the Cardinals and Red Sox play Game 4 two hours east at Busch. Two hours west, the Chiefs have their own chance to go 8-0 on Sunday. That would continue one of the biggest turnarounds in NFL history. Just a few months ago, the Chiefs put a bow on a flaming-bag-of-poo season, going 2-14.Tim Vogler is one of those involved in this Midwestern phenomenon. The president/CEO of a financial institution is a native St. Louisan and Missouri fan who has lived across the state in Kansas City for 23 years.\"If you put them in order of Chiefs, Mizzou and Cardinals,\" Vogler said. \"It\u0027s, \u0027Surprise, big surprise, no surprise.\u0027 \"The Chiefs are in their 43rd season of chasing their lone NFL title in 1970. Missouri, 5-7 last season, has been Team Futility itself for a large part of its history. It is possible we are living through the best era ever for the Cardinals, who are in the postseason for the 11th time since 1996.The saddest part is that each franchise\u0027s patron saints are missing this united ascension to excellence. Musial\u0027s death in January merited a special section in the St. Louis Post-Dispatch. It made the cover of Sports Illustrated. Fifty years after he played his last game, fans laid flowers at the base the famous Musial statue outside of Busch.Those fans have used the famous Musial statue outside of Busch as a GPS pushpin of sorts. \"Meet me at the Musial statue,\" has been uttered between friends and family for generations since the statue went up at old Busch Stadium in 1968.Hunt literally built the Chiefs from a start-up in the old AFL. The visionary billionaire moved the Dallas Texans to Kansas City 50 years ago this year. His hand is still witnessed on game days at Arrowhead, still looking futuristic in its fifth decade. The pregame, in-game and postgame revelry rival any SEC tailgate.Which is fitting. The passionate following makes a metro area of more than 2 million seem more like Tuscaloosa than Tampa Bay, more Notre Dame than New York Giants during the season. With barbeque smoke rising up, the parking lot looks post-apocalyptic. It\u0027s also the loudest place in sports, as designated by the Guinness Book of World Records a couple of weeks ago.Hunt\u0027s legacy lives on seven years after his death. His son Clark now oversees the city\u0027s most valued possession.Dan Devine has been gone for 11 years now, but Missouri\u0027s most successful coach is not forgotten. His Tigers won 72 games in the 1960s, never losing more than three in any season. They challenged for a national championship in 1960 and won the old Big Eight in 1969.In these parts, Devine is not remembered as Rudy\u0027s coach at Notre Dame or an NFL coach with the Packers. He is revered as a black and gold touchstone. The last Missouri team to start 8-0 was Devine\u0027s \u002760 squad.\"This is the high-water mark for the state of Missouri,\" said Kansas City attorney Paul Blackman. \"The nice thing is there is something for everybody. These are the salad days.\"There is that in this diverse state. The boot heel region is old South, resting across the Mississippi River from Tennessee and Kentucky. The largely agricultural north touches Iowa, Nebraska, Kansas and Illinois. No wonder Missouri fans considered themselves good fits for both the Big Ten and SEC during conference realignment.The state is defined by its two biggest cities. The more provincial St. Louis teeters more toward an eastern mentality. The more sedate Kansas City metro area is cut in two by a state line with the large suburbs on the Kansas side.But they are united by their flagship sports. The Cardinals are in their fourth World Series since 2004. Only the Yankees have won more world championships. Fans and players are proud of what has been called \"The Cardinal Way,\" a selfless team-first attitude that was reflected in Game 2. The Cardinals scored three times in the seventh against Boston thanks to a double steal, sacrifice fly and two errors.Chiefs fans hang onto that last title like a ratty old sweater. What once was beautiful can be remade again. New coach Andy Reid -- a former Missouri assistant -- has actually brought a bit of that Cardinal Way to Kansas City. The Chiefs, with nary a superstar, are a sum of their parts.The Cardinals are a model franchise but were financial underdogs when they played the Los Angeles Dodgers -- with a $200 million-plus payroll, in the League Championship Series. Missouri\u0027s facilities are impressive but its athletic budget rests in the bottom half of the SEC.The Chiefs figured to be better (they could hardly be any worse), but the current turnaround is one for the ages.The fortunes of the three franchises before their current seasons were reflected in the state\u0027s nickname: Show-Me.All this is not lost on the likes of Max Utsler. The associate professor at Kansas\u0027 William Allen White School of Journalism earned his degree from Missouri, teaches at KU and is a diehard Cardinals fan, originally from central Illinois.As a 5-year old he was asked by his Sunday teacher to declare his loyalty between the Cards and Cubs. That started a lifelong devotion that will continue Sunday when he takes his son to Game 4 in St. Louis.\"Growing up, my dad put a radio on our tractor. That made me more willing to drive the tractor,\" Utsler said. \"We listened to WGIL in Galesburg, Illinois. We listened to Harry Caray and Jack Buck.\"My feelings have just have grown. I get nervous before the games.\"He is joined in a diverse state with diverse loyalties this weekend.",
  "category": "NFL"
}