{
  "url": "http://www.cbssports.com/nfl/eye-on-football/24138206/flashback-steve-youngs-43year-40-million-usfl-contract",
  "title": "FLASHBACK: Steve Young\u0027s 43-year, $40 million USFL contract",
  "data": "  Here\u0027s Steve Young slinging passes for the USFL\u0027s LA Express. (USATSI) Ex-49ers quarterback Steve Young signed a contract in 1984 that if it were still valid, would have paid him more in 2014 than current 49ers quarterback Colin Kaepernick. Kaepernick, who will be in the in final year of his rookie deal next season, will pull in roughly $974,000 in base salary. Young would have pulled in $1 million. How\u0027s that possible? Thanks to possibly the most creative contract in football history -- or dumbest. In 1984, Young decided to forgo the NFL Draft and join the upstart United States Football League (USFL).The billionaire owner of the USFL\u0027s LA Express, J. William Oldenberg, lured Young to the new league by basically offering him a four-year, $40 million contract that would be payable over 43 years.Young\u0027s other choice was to go No. 1 overall in the 1984 NFL Draft to the Cincinnati Bengals, but the Bengals were only offering him $3.5 million, according to a Sports Illustrated article from March 1984. The $3.5 million wasn\u0027t even guaranteed -- Young would get a $1 million signing bonus and a five-year nonguaranteed contract at $500,000 per year. Apparently, it wasn\u0027t a tough decision and Young signed with the Express. Under the USFL contract, Young received $4 million up front and base salaries of $200,000, $280,000, $330,000 and $400,000 for the four-year duration of the deal. Once the contract expired, Young would have no further obligation to the team, but the Express would pay him the final $30 million over 37 years, from when Young turned 28 until he turns 65. The contract was set up as an annuity and if Young had funded the annuity, he would\u0027ve been getting a $1 million check in 2014. That number would have gone up until the final year of the deal in 2027 when Young would have collected a check worth $3.173 million. Unfortunately, Young didn\u0027t fund the annuity. (Young talks about his USFL contract around the 4:40 mark)\"We never funded the annuity. The owner was so crazy, it had to stay in his name for 45 years,\" Young said. \"So they gave me the option to take the money, which I think was $1 million bucks or $900,000 to fund the annuity -- either take that money or fund the annuity -- I just took the money. The whole idea of the annuity is false advertising.\"The USFL eventually went bankrupt, but not before Young collected a few million dollars.According to the Los Angeles Times, Young only ended up making $4.8 million in the USFL before signing with the Buccaneers in 1985. That ended up not working out well either because the 1985 Buccaneers were almost as bad as the 2013 Buccaneers. Young was eventually traded to San Francisco and the rest, as they say, is history.(Wink of the CBS Eye to Yahoo\u0027s Postgame blog)",
  "category": "NFL"
}