{
  "url": "http://www.cbssports.com/nfl/draft/blog/rob-rang/24143898/nfl-draft-notes-oregon-states-sean-mannion-fails-to-deliver",
  "title": "NFL Draft Notes -- Oregon State\u0027s Sean Mannion fails to deliver",
  "data": "  While Sean Mannion\u0027s statistics were solid, his average yards per completion -- 6.6 -- says it all. (USATSI) Much has been made of the Pac-12\u0027s underclassmen quarterbacks with many talent evaluators (including this one) focusing their attention on a trio of redshirt sophomores -- Oregon\u0027s Marcus Mariota, UCLA\u0027s Brett Hundley and Stanford\u0027s Kevin Hogan.Meanwhile, Oregon State junior Sean Mannion quietly was putting up better passing numbers than any of them, leading the country with 2,992 passing yards and 29 touchdowns against just three interceptions.None of that production, however, came against a defense as stout as Stanford\u0027s, which made Saturday night\u0027s tilt in Corvalis a must-see for scouts.  At 6-foot-4, 220 pounds, Mannion possesses the prototypical frame scouts are looking for at the quarterback position. He possesses an efficient, over-the-top delivery and anticipates very well, releasing passes before his receivers make their final breaks. Mannion\u0027s awareness and next level accuracy led to some of his more impressive throws against Stanford, including a perfect quick out to wideout Kevin Cummings to convert a 4th down early in the second quarter and a more challenging deep out to star Brandin Cooks in the third.Cooks, who entered Saturday night\u0027s showdown leading the country with an average of 168 receiving yards a game, could play a critical role in any decision Mannion makes after this season. Mannion wouldn\u0027t be the first quarterback to leave school early with his top pass-catcher exhausting his eligibility.Ironically enough, it was the inability of Mannion and Cook to hook up consistently in this contest that played a critical role in Stanford\u0027s smothering 20-12 victory.While Mannion\u0027s statistics were solid (41/57 for 271 yards and a touchdown), his average yards per completion -- 6.6 -- says it all. Virtually all of Mannion\u0027s attempts in this contest were short to intermediate throws, raising the one significant concern scouts had about his projection to the NFL entering this game - arm strength. Mannion showed some zip when he needed to on slants, crossers and dig routes but did not challenge Stanford deep in this contest. The longest attempts of Mannion\u0027s night were frustrated deep throws in the closing minutes that were as much designed at drawing a penalty flag as be completed. To be fair, with Trent Murphy, Josh Mauro and Ben Gardner largely controlling the line of scrimmage for Stanford, it is worth noting that Mannion didn\u0027t have much time to attack down the field. The Cardinal defensive front sacked him eight times and hit him much more often than that. Frankly, his willingness to take what the defense gave him will be seen as some as an example of the 26-game starter\u0027s poise and understanding of the offense.In previous games this season, however, in which he\u0027s peppered defenses deep with Cooks and the rest of Oregon State\u0027s talented pass catchers, Mannion has relied more on touch than velocity.Talent evaluators had seen this type of production from Oregon State quarterbacks in the past. Oregon State\u0027s Mike Riley, who served as head coach of the San Diego Chargers from 1999-2001, is one of the more respected teachers in college football. In his offense, Sean Canfield looked like a potential star, as well, only to have his marginal arm strength get exposed at the Senior Bowl.In a close game at home against No. 6 Stanford, however, Mannion never took the shots downfield needed to keep up with Hogan and the Cardinal. And by doing so, failed to answer the most important question scouts have about his potential future in the NFL.",
  "category": "NFL"
}