{
  "url": "http://www.cbssports.com/nfl/eye-on-football/24137797/steelers-cb-ike-taylor-on-raiders-its-scary-going-into-the-black-hole",
  "title": "Steelers CB Ike Taylor on Raiders: It\u0027s scary going into the Black Hole",
  "data": "  If you\u0027re not a Raiders player, you should stay far, far away from the Black Hole. (USATSI) If Steelers cornerback Ike Taylor picks off a Terrelle Pryor pass and returns it for a touchdown in the south end zone at O.co Coliseum in Oakland in Sunday, don\u0027t look for Taylor to be making a Lambeau-style leap into the crowd. Mainly, because he wants to live. The south end zone is where the infamous \u0027Black Hole\u0027 is and Taylor knows all about the Raiders fans in the infamous Black Hole.  \"It\u0027s scary going into that Black Hole. They\u0027re really serious about that,\" Taylor said, via the Pittsburgh Tribune-Review. \"You can jump into the stands if you want to, but I don\u0027t think you\u0027re going to come back out.\"The Black Hole is the same group of fans that made headlines earlier this month for making an RIP banner for Manti Te\u0027o\u0027s fake dead girlfriend. In Taylor\u0027s 11-year NFL career, he\u0027s never won in Oakland, going 0-2. In 2006, the Raiders went 2-14, but sure enough, they beat the Steelers in Oakland. In 2012, Oakland only won four games and of course, one of those four game came against Pittsburgh at O.co. Taylor seems to have a respect for the fans now. \"Just going into the Black Hole, in general, you\u0027re talking about serious fans. If you don\u0027t go in wearing black and silver, you can get wind up getting hurt,\" Taylor said. Teammate Ryan Clark seems to agree, \"More than anything, when you see those fans, you think about the tradition, you think about the history of the Black Hole,\" Clark said. \"You think about the crazed, obsessed feeling those fans have towards their team. I think that\u0027s why it\u0027s a tough place to play. Once they get it rolling there, and the fans get involved, it can get loud.\"So how long has it been since the Steelers came away from the Black Hole with a win? Try 1995. Pittsburgh starting running back Le\u0027veon Bell was 3-years-old. That was the Raiders first year back in Oakland after spending 13 seasons in Los Angeles and it was also the year the Steelers returned to the Super Bowl for the first time since 1979. ",
  "category": "NFL"
}